una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u4.h
// -------- HDMA_GCFG : (HDMA Offset: 0x0)  -------- 
#define AT91C_HDMA_ARB_CFG    ((unsigned int) 0x1 <<  4) // (HDMA) Arbiter mode.
#define 	AT91C_HDMA_ARB_CFG_FIXED                ((unsigned int) 0x0 <<  4) // (HDMA) Fixed priority arbiter.
#define 	AT91C_HDMA_ARB_CFG_ROUND_ROBIN          ((unsigned int) 0x1 <<  4) // (HDMA) Modified round robin arbiter.
// -------- HDMA_EN : (HDMA Offset: 0x4)  -------- 
#define AT91C_HDMA_ENABLE     ((unsigned int) 0x1 <<  0) // (HDMA) 
#define 	AT91C_HDMA_ENABLE_DISABLE              ((unsigned int) 0x0) // (HDMA) Disables HDMA.
#define 	AT91C_HDMA_ENABLE_ENABLE               ((unsigned int) 0x1) // (HDMA) Enables HDMA.
// -------- HDMA_SREQ : (HDMA Offset: 0x8)  -------- 
#define AT91C_HDMA_SSREQ0     ((unsigned int) 0x1 <<  0) // (HDMA) Request a source single transfer on channel 0
#define 	AT91C_HDMA_SSREQ0_0                    ((unsigned int) 0x0) // (HDMA) No effect.
#define 	AT91C_HDMA_SSREQ0_1                    ((unsigned int) 0x1) // (HDMA) Request a source single transfer on channel 0.
#define AT91C_HDMA_DSREQ0     ((unsigned int) 0x1 <<  1) // (HDMA) Request a destination single transfer on channel 0
#define 	AT91C_HDMA_DSREQ0_0                    ((unsigned int) 0x0 <<  1) // (HDMA) No effect.
#define 	AT91C_HDMA_DSREQ0_1                    ((unsigned int) 0x1 <<  1) // (HDMA) Request a destination single transfer on channel 0.
#define AT91C_HDMA_SSREQ1     ((unsigned int) 0x1 <<  2) // (HDMA) Request a source single transfer on channel 1
#define 	AT91C_HDMA_SSREQ1_0                    ((unsigned int) 0x0 <<  2) // (HDMA) No effect.
#define 	AT91C_HDMA_SSREQ1_1                    ((unsigned int) 0x1 <<  2) // (HDMA) Request a source single transfer on channel 1.
#define AT91C_HDMA_DSREQ1     ((unsigned int) 0x1 <<  3) // (HDMA) Request a destination single transfer on channel 1
#define 	AT91C_HDMA_DSREQ1_0                    ((unsigned int) 0x0 <<  3) // (HDMA) No effect.
#define 	AT91C_HDMA_DSREQ1_1                    ((unsigned int) 0x1 <<  3) // (HDMA) Request a destination single transfer on channel 1.
#define AT91C_HDMA_SSREQ2     ((unsigned int) 0x1 <<  4) // (HDMA) Request a source single transfer on channel 2
#define 	AT91C_HDMA_SSREQ2_0                    ((unsigned int) 0x0 <<  4) // (HDMA) No effect.
#define 	AT91C_HDMA_SSREQ2_1                    ((unsigned int) 0x1 <<  4) // (HDMA) Request a source single transfer on channel 2.
#define AT91C_HDMA_DSREQ2     ((unsigned int) 0x1 <<  5) // (HDMA) Request a destination single transfer on channel 2
#define 	AT91C_HDMA_DSREQ2_0                    ((unsigned int) 0x0 <<  5) // (HDMA) No effect.
#define 	AT91C_HDMA_DSREQ2_1                    ((unsigned int) 0x1 <<  5) // (HDMA) Request a destination single transfer on channel 2.
#define AT91C_HDMA_SSREQ3     ((unsigned int) 0x1 <<  6) // (HDMA) Request a source single transfer on channel 3
#define 	AT91C_HDMA_SSREQ3_0                    ((unsigned int) 0x0 <<  6) // (HDMA) No effect.
#define 	AT91C_HDMA_SSREQ3_1                    ((unsigned int) 0x1 <<  6) // (HDMA) Request a source single transfer on channel 3.
#define AT91C_HDMA_DSREQ3     ((unsigned int) 0x1 <<  7) // (HDMA) Request a destination single transfer on channel 3
#define 	AT91C_HDMA_DSREQ3_0                    ((unsigned int) 0x0 <<  7) // (HDMA) No effect.
#define 	AT91C_HDMA_DSREQ3_1                    ((unsigned int) 0x1 <<  7) // (HDMA) Request a destination single transfer on channel 3.
// -------- HDMA_CREQ : (HDMA Offset: 0xc)  -------- 
#define AT91C_HDMA_SCREQ0     ((unsigned int) 0x1 <<  0) // (HDMA) Request a source chunk transfer on channel 0
#define 	AT91C_HDMA_SCREQ0_0                    ((unsigned int) 0x0) // (HDMA) No effect.
#define 	AT91C_HDMA_SCREQ0_1                    ((unsigned int) 0x1) // (HDMA) Request a source chunk transfer on channel 0.
#define AT91C_HDMA_DCREQ0     ((unsigned int) 0x1 <<  1) // (HDMA) Request a destination chunk transfer on channel 0
#define 	AT91C_HDMA_DCREQ0_0                    ((unsigned int) 0x0 <<  1) // (HDMA) No effect.
#define 	AT91C_HDMA_DCREQ0_1                    ((unsigned int) 0x1 <<  1) // (HDMA) Request a destination chunk transfer on channel 0.
#define AT91C_HDMA_SCREQ1     ((unsigned int) 0x1 <<  2) // (HDMA) Request a source chunk transfer on channel 1
#define 	AT91C_HDMA_SCREQ1_0                    ((unsigned int) 0x0 <<  2) // (HDMA) No effect.
#define 	AT91C_HDMA_SCREQ1_1                    ((unsigned int) 0x1 <<  2) // (HDMA) Request a source chunk transfer on channel 1.
#define AT91C_HDMA_DCREQ1     ((unsigned int) 0x1 <<  3) // (HDMA) Request a destination chunk transfer on channel 1
#define 	AT91C_HDMA_DCREQ1_0                    ((unsigned int) 0x0 <<  3) // (HDMA) No effect.
#define 	AT91C_HDMA_DCREQ1_1                    ((unsigned int) 0x1 <<  3) // (HDMA) Request a destination chunk transfer on channel 1.
#define AT91C_HDMA_SCREQ2     ((unsigned int) 0x1 <<  4) // (HDMA) Request a source chunk transfer on channel 2
#define 	AT91C_HDMA_SCREQ2_0                    ((unsigned int) 0x0 <<  4) // (HDMA) No effect.
#define 	AT91C_HDMA_SCREQ2_1                    ((unsigned int) 0x1 <<  4) // (HDMA) Request a source chunk transfer on channel 2.
#define AT91C_HDMA_DCREQ2     ((unsigned int) 0x1 <<  5) // (HDMA) Request a destination chunk transfer on channel 2
#define 	AT91C_HDMA_DCREQ2_0                    ((unsigned int) 0x0 <<  5) // (HDMA) No effect.
#define 	AT91C_HDMA_DCREQ2_1                    ((unsigned int) 0x1 <<  5) // (HDMA) Request a destination chunk transfer on channel 2.
#define AT91C_HDMA_SCREQ3     ((unsigned int) 0x1 <<  6) // (HDMA) Request a source chunk transfer on channel 3
#define 	AT91C_HDMA_SCREQ3_0                    ((unsigned int) 0x0 <<  6) // (HDMA) No effect.
#define 	AT91C_HDMA_SCREQ3_1                    ((unsigned int) 0x1 <<  6) // (HDMA) Request a source chunk transfer on channel 3.
#define AT91C_HDMA_DCREQ3     ((unsigned int) 0x1 <<  7) // (HDMA) Request a destination chunk transfer on channel 3
#define 	AT91C_HDMA_DCREQ3_0                    ((unsigned int) 0x0 <<  7) // (HDMA) No effect.
#define 	AT91C_HDMA_DCREQ3_1                    ((unsigned int) 0x1 <<  7) // (HDMA) Request a destination chunk transfer on channel 3.
// -------- HDMA_LAST : (HDMA Offset: 0x10)  -------- 
#define AT91C_HDMA_SLAST0     ((unsigned int) 0x1 <<  0) // (HDMA) Indicates that this source request is the last transfer of the buffer on channel 0
#define 	AT91C_HDMA_SLAST0_0                    ((unsigned int) 0x0) // (HDMA) No effect.
#define 	AT91C_HDMA_SLAST0_1                    ((unsigned int) 0x1) // (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 0.
#define AT91C_HDMA_DLAST0     ((unsigned int) 0x1 <<  1) // (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 0
#define 	AT91C_HDMA_DLAST0_0                    ((unsigned int) 0x0 <<  1) // (HDMA) No effect.
#define 	AT91C_HDMA_DLAST0_1                    ((unsigned int) 0x1 <<  1) // (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 0.
#define AT91C_HDMA_SLAST1     ((unsigned int) 0x1 <<  2) // (HDMA) Indicates that this source request is the last transfer of the buffer on channel 1
#define 	AT91C_HDMA_SLAST1_0                    ((unsigned int) 0x0 <<  2) // (HDMA) No effect.
#define 	AT91C_HDMA_SLAST1_1                    ((unsigned int) 0x1 <<  2) // (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 1.
#define AT91C_HDMA_DLAST1     ((unsigned int) 0x1 <<  3) // (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 1
#define 	AT91C_HDMA_DLAST1_0                    ((unsigned int) 0x0 <<  3) // (HDMA) No effect.
#define 	AT91C_HDMA_DLAST1_1                    ((unsigned int) 0x1 <<  3) // (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 1.
#define AT91C_HDMA_SLAST2     ((unsigned int) 0x1 <<  4) // (HDMA) Indicates that this source request is the last transfer of the buffer on channel 2
#define 	AT91C_HDMA_SLAST2_0                    ((unsigned int) 0x0 <<  4) // (HDMA) No effect.
#define 	AT91C_HDMA_SLAST2_1                    ((unsigned int) 0x1 <<  4) // (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 2.
#define AT91C_HDMA_DLAST2     ((unsigned int) 0x1 <<  5) // (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 2
#define 	AT91C_HDMA_DLAST2_0                    ((unsigned int) 0x0 <<  5) // (HDMA) No effect.
#define 	AT91C_HDMA_DLAST2_1                    ((unsigned int) 0x1 <<  5) // (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 2.
#define AT91C_HDMA_SLAST3     ((unsigned int) 0x1 <<  6) // (HDMA) Indicates that this source request is the last transfer of the buffer on channel 3
#define 	AT91C_HDMA_SLAST3_0                    ((unsigned int) 0x0 <<  6) // (HDMA) No effect.
#define 	AT91C_HDMA_SLAST3_1                    ((unsigned int) 0x1 <<  6) // (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 3.
#define AT91C_HDMA_DLAST3     ((unsigned int) 0x1 <<  7) // (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 3
#define 	AT91C_HDMA_DLAST3_0                    ((unsigned int) 0x0 <<  7) // (HDMA) No effect.
#define 	AT91C_HDMA_DLAST3_1                    ((unsigned int) 0x1 <<  7) // (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 3.
// -------- HDMA_EBCIER : (HDMA Offset: 0x18) Buffer Transfer Completed/Chained Buffer Transfer Completed/Access Error Interrupt Enable Register -------- 
#define AT91C_HDMA_BTC0       ((unsigned int) 0x1 <<  0) // (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_BTC1       ((unsigned int) 0x1 <<  1) // (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_BTC2       ((unsigned int) 0x1 <<  2) // (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_BTC3       ((unsigned int) 0x1 <<  3) // (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_BTC4       ((unsigned int) 0x1 <<  4) // (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_BTC5       ((unsigned int) 0x1 <<  5) // (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_BTC6       ((unsigned int) 0x1 <<  6) // (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_BTC7       ((unsigned int) 0x1 <<  7) // (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_CBTC0      ((unsigned int) 0x1 <<  8) // (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_CBTC1      ((unsigned int) 0x1 <<  9) // (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_CBTC2      ((unsigned int) 0x1 << 10) // (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_CBTC3      ((unsigned int) 0x1 << 11) // (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_CBTC4      ((unsigned int) 0x1 << 12) // (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_CBTC5      ((unsigned int) 0x1 << 13) // (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_CBTC6      ((unsigned int) 0x1 << 14) // (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_CBTC7      ((unsigned int) 0x1 << 15) // (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_ERR0       ((unsigned int) 0x1 << 16) // (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_ERR1       ((unsigned int) 0x1 << 17) // (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_ERR2       ((unsigned int) 0x1 << 18) // (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_ERR3       ((unsigned int) 0x1 << 19) // (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_ERR4       ((unsigned int) 0x1 << 20) // (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_ERR5       ((unsigned int) 0x1 << 21) // (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_ERR6       ((unsigned int) 0x1 << 22) // (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
#define AT91C_HDMA_ERR7       ((unsigned int) 0x1 << 23) // (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
// -------- HDMA_EBCIDR : (HDMA Offset: 0x1c)  -------- 
// -------- HDMA_EBCIMR : (HDMA Offset: 0x20)  -------- 
// -------- HDMA_EBCISR : (HDMA Offset: 0x24)  -------- 
// -------- HDMA_CHER : (HDMA Offset: 0x28)  -------- 
#define AT91C_HDMA_ENA0       ((unsigned int) 0x1 <<  0) // (HDMA) When set, channel 0 enabled.
#define 	AT91C_HDMA_ENA0_0                    ((unsigned int) 0x0) // (HDMA) No effect.
#define 	AT91C_HDMA_ENA0_1                    ((unsigned int) 0x1) // (HDMA) Channel 0 enabled.
#define AT91C_HDMA_ENA1       ((unsigned int) 0x1 <<  1) // (HDMA) When set, channel 1 enabled.
#define 	AT91C_HDMA_ENA1_0                    ((unsigned int) 0x0 <<  1) // (HDMA) No effect.
#define 	AT91C_HDMA_ENA1_1                    ((unsigned int) 0x1 <<  1) // (HDMA) Channel 1 enabled.
#define AT91C_HDMA_ENA2       ((unsigned int) 0x1 <<  2) // (HDMA) When set, channel 2 enabled.
#define 	AT91C_HDMA_ENA2_0                    ((unsigned int) 0x0 <<  2) // (HDMA) No effect.
#define 	AT91C_HDMA_ENA2_1                    ((unsigned int) 0x1 <<  2) // (HDMA) Channel 2 enabled.
#define AT91C_HDMA_ENA3       ((unsigned int) 0x1 <<  3) // (HDMA) When set, channel 3 enabled.
#define 	AT91C_HDMA_ENA3_0                    ((unsigned int) 0x0 <<  3) // (HDMA) No effect.
#define 	AT91C_HDMA_ENA3_1                    ((unsigned int) 0x1 <<  3) // (HDMA) Channel 3 enabled.
#define AT91C_HDMA_ENA4       ((unsigned int) 0x1 <<  4) // (HDMA) When set, channel 4 enabled.
#define 	AT91C_HDMA_ENA4_0                    ((unsigned int) 0x0 <<  4) // (HDMA) No effect.
#define 	AT91C_HDMA_ENA4_1                    ((unsigned int) 0x1 <<  4) // (HDMA) Channel 4 enabled.
#define AT91C_HDMA_ENA5       ((unsigned int) 0x1 <<  5) // (HDMA) When set, channel 5 enabled.
#define 	AT91C_HDMA_ENA5_0                    ((unsigned int) 0x0 <<  5) // (HDMA) No effect.
#define 	AT91C_HDMA_ENA5_1                    ((unsigned int) 0x1 <<  5) // (HDMA) Channel 5 enabled.
#define AT91C_HDMA_ENA6       ((unsigned int) 0x1 <<  6) // (HDMA) When set, channel 6 enabled.
#define 	AT91C_HDMA_ENA6_0                    ((unsigned int) 0x0 <<  6) // (HDMA) No effect.
#define 	AT91C_HDMA_ENA6_1                    ((unsigned int) 0x1 <<  6) // (HDMA) Channel 6 enabled.
#define AT91C_HDMA_ENA7       ((unsigned int) 0x1 <<  7) // (HDMA) When set, channel 7 enabled.
#define 	AT91C_HDMA_ENA7_0                    ((unsigned int) 0x0 <<  7) // (HDMA) No effect.
#define 	AT91C_HDMA_ENA7_1                    ((unsigned int) 0x1 <<  7) // (HDMA) Channel 7 enabled.
#define AT91C_HDMA_SUSP0      ((unsigned int) 0x1 <<  8) // (HDMA) When set, channel 0 freezed and its current context.
#define 	AT91C_HDMA_SUSP0_0                    ((unsigned int) 0x0 <<  8) // (HDMA) No effect.
#define 	AT91C_HDMA_SUSP0_1                    ((unsigned int) 0x1 <<  8) // (HDMA) Channel 0 freezed.
#define AT91C_HDMA_SUSP1      ((unsigned int) 0x1 <<  9) // (HDMA) When set, channel 1 freezed and its current context.
#define 	AT91C_HDMA_SUSP1_0                    ((unsigned int) 0x0 <<  9) // (HDMA) No effect.
#define 	AT91C_HDMA_SUSP1_1                    ((unsigned int) 0x1 <<  9) // (HDMA) Channel 1 freezed.
#define AT91C_HDMA_SUSP2      ((unsigned int) 0x1 << 10) // (HDMA) When set, channel 2 freezed and its current context.
#define 	AT91C_HDMA_SUSP2_0                    ((unsigned int) 0x0 << 10) // (HDMA) No effect.
#define 	AT91C_HDMA_SUSP2_1                    ((unsigned int) 0x1 << 10) // (HDMA) Channel 2 freezed.
#define AT91C_HDMA_SUSP3      ((unsigned int) 0x1 << 11) // (HDMA) When set, channel 3 freezed and its current context.
#define 	AT91C_HDMA_SUSP3_0                    ((unsigned int) 0x0 << 11) // (HDMA) No effect.
#define 	AT91C_HDMA_SUSP3_1                    ((unsigned int) 0x1 << 11) // (HDMA) Channel 3 freezed.
#define AT91C_HDMA_SUSP4      ((unsigned int) 0x1 << 12) // (HDMA) When set, channel 4 freezed and its current context.
#define 	AT91C_HDMA_SUSP4_0                    ((unsigned int) 0x0 << 12) // (HDMA) No effect.
#define 	AT91C_HDMA_SUSP4_1                    ((unsigned int) 0x1 << 12) // (HDMA) Channel 4 freezed.
#define AT91C_HDMA_SUSP5      ((unsigned int) 0x1 << 13) // (HDMA) When set, channel 5 freezed and its current context.
#define 	AT91C_HDMA_SUSP5_0                    ((unsigned int) 0x0 << 13) // (HDMA) No effect.
#define 	AT91C_HDMA_SUSP5_1                    ((unsigned int) 0x1 << 13) // (HDMA) Channel 5 freezed.
#define AT91C_HDMA_SUSP6      ((unsigned int) 0x1 << 14) // (HDMA) When set, channel 6 freezed and its current context.
#define 	AT91C_HDMA_SUSP6_0                    ((unsigned int) 0x0 << 14) // (HDMA) No effect.
#define 	AT91C_HDMA_SUSP6_1                    ((unsigned int) 0x1 << 14) // (HDMA) Channel 6 freezed.
#define AT91C_HDMA_SUSP7      ((unsigned int) 0x1 << 15) // (HDMA) When set, channel 7 freezed and its current context.
#define 	AT91C_HDMA_SUSP7_0                    ((unsigned int) 0x0 << 15) // (HDMA) No effect.
#define 	AT91C_HDMA_SUSP7_1                    ((unsigned int) 0x1 << 15) // (HDMA) Channel 7 freezed.
#define AT91C_HDMA_KEEP0      ((unsigned int) 0x1 << 24) // (HDMA) When set, it resumes the channel 0 from an automatic stall state.
#define 	AT91C_HDMA_KEEP0_0                    ((unsigned int) 0x0 << 24) // (HDMA) No effect.
#define 	AT91C_HDMA_KEEP0_1                    ((unsigned int) 0x1 << 24) // (HDMA) Resumes the channel 0.
#define AT91C_HDMA_KEEP1      ((unsigned int) 0x1 << 25) // (HDMA) When set, it resumes the channel 1 from an automatic stall state.
#define 	AT91C_HDMA_KEEP1_0                    ((unsigned int) 0x0 << 25) // (HDMA) No effect.
#define 	AT91C_HDMA_KEEP1_1                    ((unsigned int) 0x1 << 25) // (HDMA) Resumes the channel 1.
#define AT91C_HDMA_KEEP2      ((unsigned int) 0x1 << 26) // (HDMA) When set, it resumes the channel 2 from an automatic stall state.
#define 	AT91C_HDMA_KEEP2_0                    ((unsigned int) 0x0 << 26) // (HDMA) No effect.
#define 	AT91C_HDMA_KEEP2_1                    ((unsigned int) 0x1 << 26) // (HDMA) Resumes the channel 2.
#define AT91C_HDMA_KEEP3      ((unsigned int) 0x1 << 27) // (HDMA) When set, it resumes the channel 3 from an automatic stall state.
#define 	AT91C_HDMA_KEEP3_0                    ((unsigned int) 0x0 << 27) // (HDMA) No effect.
#define 	AT91C_HDMA_KEEP3_1                    ((unsigned int) 0x1 << 27) // (HDMA) Resumes the channel 3.
#define AT91C_HDMA_KEEP4      ((unsigned int) 0x1 << 28) // (HDMA) When set, it resumes the channel 4 from an automatic stall state.
#define 	AT91C_HDMA_KEEP4_0                    ((unsigned int) 0x0 << 28) // (HDMA) No effect.
#define 	AT91C_HDMA_KEEP4_1                    ((unsigned int) 0x1 << 28) // (HDMA) Resumes the channel 4.
#define AT91C_HDMA_KEEP5      ((unsigned int) 0x1 << 29) // (HDMA) When set, it resumes the channel 5 from an automatic stall state.
#define 	AT91C_HDMA_KEEP5_0                    ((unsigned int) 0x0 << 29) // (HDMA) No effect.
#define 	AT91C_HDMA_KEEP5_1                    ((unsigned int) 0x1 << 29) // (HDMA) Resumes the channel 5.
#define AT91C_HDMA_KEEP6      ((unsigned int) 0x1 << 30) // (HDMA) When set, it resumes the channel 6 from an automatic stall state.
#define 	AT91C_HDMA_KEEP6_0                    ((unsigned int) 0x0 << 30) // (HDMA) No effect.
#define 	AT91C_HDMA_KEEP6_1                    ((unsigned int) 0x1 << 30) // (HDMA) Resumes the channel 6.
#define AT91C_HDMA_KEEP7      ((unsigned int) 0x1 << 31) // (HDMA) When set, it resumes the channel 7 from an automatic stall state.
#define 	AT91C_HDMA_KEEP7_0                    ((unsigned int) 0x0 << 31) // (HDMA) No effect.
#define 	AT91C_HDMA_KEEP7_1                    ((unsigned int) 0x1 << 31) // (HDMA) Resumes the channel 7.
// -------- HDMA_CHDR : (HDMA Offset: 0x2c)  -------- 
#define AT91C_HDMA_DIS0       ((unsigned int) 0x1 <<  0) // (HDMA) Write one to this field to disable the channel 0.
#define 	AT91C_HDMA_DIS0_0                    ((unsigned int) 0x0) // (HDMA) No effect.
#define 	AT91C_HDMA_DIS0_1                    ((unsigned int) 0x1) // (HDMA) Disables the channel 0.
#define AT91C_HDMA_DIS1       ((unsigned int) 0x1 <<  1) // (HDMA) Write one to this field to disable the channel 1.
#define 	AT91C_HDMA_DIS1_0                    ((unsigned int) 0x0 <<  1) // (HDMA) No effect.
#define 	AT91C_HDMA_DIS1_1                    ((unsigned int) 0x1 <<  1) // (HDMA) Disables the channel 1.
#define AT91C_HDMA_DIS2       ((unsigned int) 0x1 <<  2) // (HDMA) Write one to this field to disable the channel 2.
#define 	AT91C_HDMA_DIS2_0                    ((unsigned int) 0x0 <<  2) // (HDMA) No effect.
#define 	AT91C_HDMA_DIS2_1                    ((unsigned int) 0x1 <<  2) // (HDMA) Disables the channel 2.
#define AT91C_HDMA_DIS3       ((unsigned int) 0x1 <<  3) // (HDMA) Write one to this field to disable the channel 3.
#define 	AT91C_HDMA_DIS3_0                    ((unsigned int) 0x0 <<  3) // (HDMA) No effect.
#define 	AT91C_HDMA_DIS3_1                    ((unsigned int) 0x1 <<  3) // (HDMA) Disables the channel 3.
#define AT91C_HDMA_DIS4       ((unsigned int) 0x1 <<  4) // (HDMA) Write one to this field to disable the channel 4.
#define 	AT91C_HDMA_DIS4_0                    ((unsigned int) 0x0 <<  4) // (HDMA) No effect.
#define 	AT91C_HDMA_DIS4_1                    ((unsigned int) 0x1 <<  4) // (HDMA) Disables the channel 4.
#define AT91C_HDMA_DIS5       ((unsigned int) 0x1 <<  5) // (HDMA) Write one to this field to disable the channel 5.
#define 	AT91C_HDMA_DIS5_0                    ((unsigned int) 0x0 <<  5) // (HDMA) No effect.
#define 	AT91C_HDMA_DIS5_1                    ((unsigned int) 0x1 <<  5) // (HDMA) Disables the channel 5.
#define AT91C_HDMA_DIS6       ((unsigned int) 0x1 <<  6) // (HDMA) Write one to this field to disable the channel 6.
#define 	AT91C_HDMA_DIS6_0                    ((unsigned int) 0x0 <<  6) // (HDMA) No effect.
#define 	AT91C_HDMA_DIS6_1                    ((unsigned int) 0x1 <<  6) // (HDMA) Disables the channel 6.
#define AT91C_HDMA_DIS7       ((unsigned int) 0x1 <<  7) // (HDMA) Write one to this field to disable the channel 7.
