una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u4.h
#define AT91C_MCI0_DMA  ((AT91_REG *) 	0x40000050) // (MCI0) MCI DMA Configuration Register
#define AT91C_MCI0_SDCR ((AT91_REG *) 	0x4000000C) // (MCI0) MCI SD/SDIO Card Register
#define AT91C_MCI0_IPNAME1 ((AT91_REG *) 	0x400000F0) // (MCI0) MCI IPNAME1 REGISTER 
#define AT91C_MCI0_CSTOR ((AT91_REG *) 	0x4000001C) // (MCI0) MCI Completion Signal Timeout Register
#define AT91C_MCI0_RDR  ((AT91_REG *) 	0x40000030) // (MCI0) MCI Receive Data Register
#define AT91C_MCI0_CMDR ((AT91_REG *) 	0x40000014) // (MCI0) MCI Command Register
#define AT91C_MCI0_IDR  ((AT91_REG *) 	0x40000048) // (MCI0) MCI Interrupt Disable Register
#define AT91C_MCI0_ADDRSIZE ((AT91_REG *) 	0x400000EC) // (MCI0) MCI ADDRSIZE REGISTER 
#define AT91C_MCI0_WPCR ((AT91_REG *) 	0x400000E4) // (MCI0) MCI Write Protection Control Register
#define AT91C_MCI0_RSPR ((AT91_REG *) 	0x40000020) // (MCI0) MCI Response Register
#define AT91C_MCI0_IPNAME2 ((AT91_REG *) 	0x400000F4) // (MCI0) MCI IPNAME2 REGISTER 
#define AT91C_MCI0_CR   ((AT91_REG *) 	0x40000000) // (MCI0) MCI Control Register
#define AT91C_MCI0_IMR  ((AT91_REG *) 	0x4000004C) // (MCI0) MCI Interrupt Mask Register
#define AT91C_MCI0_WPSR ((AT91_REG *) 	0x400000E8) // (MCI0) MCI Write Protection Status Register
#define AT91C_MCI0_DTOR ((AT91_REG *) 	0x40000008) // (MCI0) MCI Data Timeout Register
#define AT91C_MCI0_MR   ((AT91_REG *) 	0x40000004) // (MCI0) MCI Mode Register
#define AT91C_MCI0_SR   ((AT91_REG *) 	0x40000040) // (MCI0) MCI Status Register
#define AT91C_MCI0_IER  ((AT91_REG *) 	0x40000044) // (MCI0) MCI Interrupt Enable Register
#define AT91C_MCI0_VER  ((AT91_REG *) 	0x400000FC) // (MCI0) MCI VERSION REGISTER 
#define AT91C_MCI0_FEATURES ((AT91_REG *) 	0x400000F8) // (MCI0) MCI FEATURES REGISTER 
#define AT91C_MCI0_BLKR ((AT91_REG *) 	0x40000018) // (MCI0) MCI Block Register
#define AT91C_MCI0_ARGR ((AT91_REG *) 	0x40000010) // (MCI0) MCI Argument Register
#define AT91C_MCI0_FIFO ((AT91_REG *) 	0x40000200) // (MCI0) MCI FIFO Aperture Register
#define AT91C_MCI0_TDR  ((AT91_REG *) 	0x40000034) // (MCI0) MCI Transmit Data Register
#define AT91C_MCI0_CFG  ((AT91_REG *) 	0x40000054) // (MCI0) MCI Configuration Register
// ========== Register definition for PDC_TWI0 peripheral ========== 
#define AT91C_TWI0_TNCR ((AT91_REG *) 	0x4008411C) // (PDC_TWI0) Transmit Next Counter Register
#define AT91C_TWI0_PTCR ((AT91_REG *) 	0x40084120) // (PDC_TWI0) PDC Transfer Control Register
#define AT91C_TWI0_PTSR ((AT91_REG *) 	0x40084124) // (PDC_TWI0) PDC Transfer Status Register
#define AT91C_TWI0_RCR  ((AT91_REG *) 	0x40084104) // (PDC_TWI0) Receive Counter Register
#define AT91C_TWI0_TNPR ((AT91_REG *) 	0x40084118) // (PDC_TWI0) Transmit Next Pointer Register
#define AT91C_TWI0_RNPR ((AT91_REG *) 	0x40084110) // (PDC_TWI0) Receive Next Pointer Register
#define AT91C_TWI0_RPR  ((AT91_REG *) 	0x40084100) // (PDC_TWI0) Receive Pointer Register
#define AT91C_TWI0_RNCR ((AT91_REG *) 	0x40084114) // (PDC_TWI0) Receive Next Counter Register
#define AT91C_TWI0_TPR  ((AT91_REG *) 	0x40084108) // (PDC_TWI0) Transmit Pointer Register
#define AT91C_TWI0_TCR  ((AT91_REG *) 	0x4008410C) // (PDC_TWI0) Transmit Counter Register
// ========== Register definition for PDC_TWI1 peripheral ========== 
#define AT91C_TWI1_TNCR ((AT91_REG *) 	0x4008811C) // (PDC_TWI1) Transmit Next Counter Register
#define AT91C_TWI1_PTCR ((AT91_REG *) 	0x40088120) // (PDC_TWI1) PDC Transfer Control Register
#define AT91C_TWI1_RNCR ((AT91_REG *) 	0x40088114) // (PDC_TWI1) Receive Next Counter Register
#define AT91C_TWI1_RCR  ((AT91_REG *) 	0x40088104) // (PDC_TWI1) Receive Counter Register
#define AT91C_TWI1_RPR  ((AT91_REG *) 	0x40088100) // (PDC_TWI1) Receive Pointer Register
#define AT91C_TWI1_TNPR ((AT91_REG *) 	0x40088118) // (PDC_TWI1) Transmit Next Pointer Register
#define AT91C_TWI1_RNPR ((AT91_REG *) 	0x40088110) // (PDC_TWI1) Receive Next Pointer Register
#define AT91C_TWI1_TCR  ((AT91_REG *) 	0x4008810C) // (PDC_TWI1) Transmit Counter Register
#define AT91C_TWI1_TPR  ((AT91_REG *) 	0x40088108) // (PDC_TWI1) Transmit Pointer Register
#define AT91C_TWI1_PTSR ((AT91_REG *) 	0x40088124) // (PDC_TWI1) PDC Transfer Status Register
// ========== Register definition for TWI0 peripheral ========== 
#define AT91C_TWI0_FEATURES ((AT91_REG *) 	0x400840F8) // (TWI0) TWI FEATURES REGISTER 
#define AT91C_TWI0_IPNAME1 ((AT91_REG *) 	0x400840F0) // (TWI0) TWI IPNAME1 REGISTER 
#define AT91C_TWI0_SMR  ((AT91_REG *) 	0x40084008) // (TWI0) Slave Mode Register
#define AT91C_TWI0_MMR  ((AT91_REG *) 	0x40084004) // (TWI0) Master Mode Register
#define AT91C_TWI0_SR   ((AT91_REG *) 	0x40084020) // (TWI0) Status Register
#define AT91C_TWI0_IPNAME2 ((AT91_REG *) 	0x400840F4) // (TWI0) TWI IPNAME2 REGISTER 
#define AT91C_TWI0_CR   ((AT91_REG *) 	0x40084000) // (TWI0) Control Register
#define AT91C_TWI0_IER  ((AT91_REG *) 	0x40084024) // (TWI0) Interrupt Enable Register
#define AT91C_TWI0_RHR  ((AT91_REG *) 	0x40084030) // (TWI0) Receive Holding Register
#define AT91C_TWI0_ADDRSIZE ((AT91_REG *) 	0x400840EC) // (TWI0) TWI ADDRSIZE REGISTER 
#define AT91C_TWI0_THR  ((AT91_REG *) 	0x40084034) // (TWI0) Transmit Holding Register
#define AT91C_TWI0_VER  ((AT91_REG *) 	0x400840FC) // (TWI0) Version Register
#define AT91C_TWI0_IADR ((AT91_REG *) 	0x4008400C) // (TWI0) Internal Address Register
#define AT91C_TWI0_IMR  ((AT91_REG *) 	0x4008402C) // (TWI0) Interrupt Mask Register
#define AT91C_TWI0_CWGR ((AT91_REG *) 	0x40084010) // (TWI0) Clock Waveform Generator Register
#define AT91C_TWI0_IDR  ((AT91_REG *) 	0x40084028) // (TWI0) Interrupt Disable Register
// ========== Register definition for TWI1 peripheral ========== 
#define AT91C_TWI1_VER  ((AT91_REG *) 	0x400880FC) // (TWI1) Version Register
#define AT91C_TWI1_IDR  ((AT91_REG *) 	0x40088028) // (TWI1) Interrupt Disable Register
#define AT91C_TWI1_IPNAME2 ((AT91_REG *) 	0x400880F4) // (TWI1) TWI IPNAME2 REGISTER 
#define AT91C_TWI1_CWGR ((AT91_REG *) 	0x40088010) // (TWI1) Clock Waveform Generator Register
#define AT91C_TWI1_CR   ((AT91_REG *) 	0x40088000) // (TWI1) Control Register
#define AT91C_TWI1_ADDRSIZE ((AT91_REG *) 	0x400880EC) // (TWI1) TWI ADDRSIZE REGISTER 
#define AT91C_TWI1_IADR ((AT91_REG *) 	0x4008800C) // (TWI1) Internal Address Register
#define AT91C_TWI1_IER  ((AT91_REG *) 	0x40088024) // (TWI1) Interrupt Enable Register
#define AT91C_TWI1_SMR  ((AT91_REG *) 	0x40088008) // (TWI1) Slave Mode Register
#define AT91C_TWI1_RHR  ((AT91_REG *) 	0x40088030) // (TWI1) Receive Holding Register
#define AT91C_TWI1_FEATURES ((AT91_REG *) 	0x400880F8) // (TWI1) TWI FEATURES REGISTER 
#define AT91C_TWI1_IMR  ((AT91_REG *) 	0x4008802C) // (TWI1) Interrupt Mask Register
#define AT91C_TWI1_SR   ((AT91_REG *) 	0x40088020) // (TWI1) Status Register
#define AT91C_TWI1_THR  ((AT91_REG *) 	0x40088034) // (TWI1) Transmit Holding Register
#define AT91C_TWI1_MMR  ((AT91_REG *) 	0x40088004) // (TWI1) Master Mode Register
#define AT91C_TWI1_IPNAME1 ((AT91_REG *) 	0x400880F0) // (TWI1) TWI IPNAME1 REGISTER 
// ========== Register definition for PDC_US0 peripheral ========== 
#define AT91C_US0_RNCR  ((AT91_REG *) 	0x40090114) // (PDC_US0) Receive Next Counter Register
#define AT91C_US0_TNPR  ((AT91_REG *) 	0x40090118) // (PDC_US0) Transmit Next Pointer Register
#define AT91C_US0_TPR   ((AT91_REG *) 	0x40090108) // (PDC_US0) Transmit Pointer Register
#define AT91C_US0_RCR   ((AT91_REG *) 	0x40090104) // (PDC_US0) Receive Counter Register
#define AT91C_US0_RNPR  ((AT91_REG *) 	0x40090110) // (PDC_US0) Receive Next Pointer Register
#define AT91C_US0_TNCR  ((AT91_REG *) 	0x4009011C) // (PDC_US0) Transmit Next Counter Register
#define AT91C_US0_PTSR  ((AT91_REG *) 	0x40090124) // (PDC_US0) PDC Transfer Status Register
#define AT91C_US0_RPR   ((AT91_REG *) 	0x40090100) // (PDC_US0) Receive Pointer Register
#define AT91C_US0_PTCR  ((AT91_REG *) 	0x40090120) // (PDC_US0) PDC Transfer Control Register
#define AT91C_US0_TCR   ((AT91_REG *) 	0x4009010C) // (PDC_US0) Transmit Counter Register
// ========== Register definition for US0 peripheral ========== 
#define AT91C_US0_NER   ((AT91_REG *) 	0x40090044) // (US0) Nb Errors Register
#define AT91C_US0_RHR   ((AT91_REG *) 	0x40090018) // (US0) Receiver Holding Register
#define AT91C_US0_IPNAME1 ((AT91_REG *) 	0x400900F0) // (US0) US IPNAME1 REGISTER 
#define AT91C_US0_MR    ((AT91_REG *) 	0x40090004) // (US0) Mode Register
#define AT91C_US0_RTOR  ((AT91_REG *) 	0x40090024) // (US0) Receiver Time-out Register
#define AT91C_US0_IF    ((AT91_REG *) 	0x4009004C) // (US0) IRDA_FILTER Register
#define AT91C_US0_ADDRSIZE ((AT91_REG *) 	0x400900EC) // (US0) US ADDRSIZE REGISTER 
#define AT91C_US0_IDR   ((AT91_REG *) 	0x4009000C) // (US0) Interrupt Disable Register
#define AT91C_US0_IMR   ((AT91_REG *) 	0x40090010) // (US0) Interrupt Mask Register
#define AT91C_US0_IER   ((AT91_REG *) 	0x40090008) // (US0) Interrupt Enable Register
#define AT91C_US0_TTGR  ((AT91_REG *) 	0x40090028) // (US0) Transmitter Time-guard Register
#define AT91C_US0_IPNAME2 ((AT91_REG *) 	0x400900F4) // (US0) US IPNAME2 REGISTER 
#define AT91C_US0_FIDI  ((AT91_REG *) 	0x40090040) // (US0) FI_DI_Ratio Register
#define AT91C_US0_CR    ((AT91_REG *) 	0x40090000) // (US0) Control Register
#define AT91C_US0_BRGR  ((AT91_REG *) 	0x40090020) // (US0) Baud Rate Generator Register
#define AT91C_US0_MAN   ((AT91_REG *) 	0x40090050) // (US0) Manchester Encoder Decoder Register
#define AT91C_US0_VER   ((AT91_REG *) 	0x400900FC) // (US0) VERSION Register
#define AT91C_US0_FEATURES ((AT91_REG *) 	0x400900F8) // (US0) US FEATURES REGISTER 
#define AT91C_US0_CSR   ((AT91_REG *) 	0x40090014) // (US0) Channel Status Register
#define AT91C_US0_THR   ((AT91_REG *) 	0x4009001C) // (US0) Transmitter Holding Register
// ========== Register definition for PDC_US1 peripheral ========== 
#define AT91C_US1_TNPR  ((AT91_REG *) 	0x40094118) // (PDC_US1) Transmit Next Pointer Register
#define AT91C_US1_TPR   ((AT91_REG *) 	0x40094108) // (PDC_US1) Transmit Pointer Register
#define AT91C_US1_RNCR  ((AT91_REG *) 	0x40094114) // (PDC_US1) Receive Next Counter Register
#define AT91C_US1_TNCR  ((AT91_REG *) 	0x4009411C) // (PDC_US1) Transmit Next Counter Register
#define AT91C_US1_RNPR  ((AT91_REG *) 	0x40094110) // (PDC_US1) Receive Next Pointer Register
#define AT91C_US1_TCR   ((AT91_REG *) 	0x4009410C) // (PDC_US1) Transmit Counter Register
#define AT91C_US1_PTSR  ((AT91_REG *) 	0x40094124) // (PDC_US1) PDC Transfer Status Register
#define AT91C_US1_RCR   ((AT91_REG *) 	0x40094104) // (PDC_US1) Receive Counter Register
#define AT91C_US1_RPR   ((AT91_REG *) 	0x40094100) // (PDC_US1) Receive Pointer Register
#define AT91C_US1_PTCR  ((AT91_REG *) 	0x40094120) // (PDC_US1) PDC Transfer Control Register
// ========== Register definition for US1 peripheral ========== 
#define AT91C_US1_IMR   ((AT91_REG *) 	0x40094010) // (US1) Interrupt Mask Register
#define AT91C_US1_RTOR  ((AT91_REG *) 	0x40094024) // (US1) Receiver Time-out Register
#define AT91C_US1_RHR   ((AT91_REG *) 	0x40094018) // (US1) Receiver Holding Register
#define AT91C_US1_IPNAME1 ((AT91_REG *) 	0x400940F0) // (US1) US IPNAME1 REGISTER 
#define AT91C_US1_VER   ((AT91_REG *) 	0x400940FC) // (US1) VERSION Register
#define AT91C_US1_MR    ((AT91_REG *) 	0x40094004) // (US1) Mode Register
#define AT91C_US1_FEATURES ((AT91_REG *) 	0x400940F8) // (US1) US FEATURES REGISTER 
#define AT91C_US1_NER   ((AT91_REG *) 	0x40094044) // (US1) Nb Errors Register
#define AT91C_US1_IPNAME2 ((AT91_REG *) 	0x400940F4) // (US1) US IPNAME2 REGISTER 
#define AT91C_US1_CR    ((AT91_REG *) 	0x40094000) // (US1) Control Register
#define AT91C_US1_BRGR  ((AT91_REG *) 	0x40094020) // (US1) Baud Rate Generator Register
#define AT91C_US1_IF    ((AT91_REG *) 	0x4009404C) // (US1) IRDA_FILTER Register
#define AT91C_US1_IER   ((AT91_REG *) 	0x40094008) // (US1) Interrupt Enable Register
#define AT91C_US1_TTGR  ((AT91_REG *) 	0x40094028) // (US1) Transmitter Time-guard Register
#define AT91C_US1_FIDI  ((AT91_REG *) 	0x40094040) // (US1) FI_DI_Ratio Register
#define AT91C_US1_MAN   ((AT91_REG *) 	0x40094050) // (US1) Manchester Encoder Decoder Register
#define AT91C_US1_ADDRSIZE ((AT91_REG *) 	0x400940EC) // (US1) US ADDRSIZE REGISTER 
#define AT91C_US1_CSR   ((AT91_REG *) 	0x40094014) // (US1) Channel Status Register
#define AT91C_US1_THR   ((AT91_REG *) 	0x4009401C) // (US1) Transmitter Holding Register
#define AT91C_US1_IDR   ((AT91_REG *) 	0x4009400C) // (US1) Interrupt Disable Register
// ========== Register definition for PDC_US2 peripheral ========== 
#define AT91C_US2_RPR   ((AT91_REG *) 	0x40098100) // (PDC_US2) Receive Pointer Register
#define AT91C_US2_TPR   ((AT91_REG *) 	0x40098108) // (PDC_US2) Transmit Pointer Register
#define AT91C_US2_TCR   ((AT91_REG *) 	0x4009810C) // (PDC_US2) Transmit Counter Register
#define AT91C_US2_PTSR  ((AT91_REG *) 	0x40098124) // (PDC_US2) PDC Transfer Status Register
#define AT91C_US2_PTCR  ((AT91_REG *) 	0x40098120) // (PDC_US2) PDC Transfer Control Register
#define AT91C_US2_RNPR  ((AT91_REG *) 	0x40098110) // (PDC_US2) Receive Next Pointer Register
#define AT91C_US2_TNCR  ((AT91_REG *) 	0x4009811C) // (PDC_US2) Transmit Next Counter Register
#define AT91C_US2_RNCR  ((AT91_REG *) 	0x40098114) // (PDC_US2) Receive Next Counter Register
#define AT91C_US2_TNPR  ((AT91_REG *) 	0x40098118) // (PDC_US2) Transmit Next Pointer Register
#define AT91C_US2_RCR   ((AT91_REG *) 	0x40098104) // (PDC_US2) Receive Counter Register
// ========== Register definition for US2 peripheral ========== 
#define AT91C_US2_MAN   ((AT91_REG *) 	0x40098050) // (US2) Manchester Encoder Decoder Register
#define AT91C_US2_ADDRSIZE ((AT91_REG *) 	0x400980EC) // (US2) US ADDRSIZE REGISTER 
#define AT91C_US2_MR    ((AT91_REG *) 	0x40098004) // (US2) Mode Register
#define AT91C_US2_IPNAME1 ((AT91_REG *) 	0x400980F0) // (US2) US IPNAME1 REGISTER 
#define AT91C_US2_IF    ((AT91_REG *) 	0x4009804C) // (US2) IRDA_FILTER Register
#define AT91C_US2_BRGR  ((AT91_REG *) 	0x40098020) // (US2) Baud Rate Generator Register
#define AT91C_US2_FIDI  ((AT91_REG *) 	0x40098040) // (US2) FI_DI_Ratio Register
#define AT91C_US2_IER   ((AT91_REG *) 	0x40098008) // (US2) Interrupt Enable Register
#define AT91C_US2_RTOR  ((AT91_REG *) 	0x40098024) // (US2) Receiver Time-out Register
#define AT91C_US2_CR    ((AT91_REG *) 	0x40098000) // (US2) Control Register
#define AT91C_US2_THR   ((AT91_REG *) 	0x4009801C) // (US2) Transmitter Holding Register
#define AT91C_US2_CSR   ((AT91_REG *) 	0x40098014) // (US2) Channel Status Register
#define AT91C_US2_VER   ((AT91_REG *) 	0x400980FC) // (US2) VERSION Register
#define AT91C_US2_FEATURES ((AT91_REG *) 	0x400980F8) // (US2) US FEATURES REGISTER 
#define AT91C_US2_IDR   ((AT91_REG *) 	0x4009800C) // (US2) Interrupt Disable Register
#define AT91C_US2_TTGR  ((AT91_REG *) 	0x40098028) // (US2) Transmitter Time-guard Register
#define AT91C_US2_IPNAME2 ((AT91_REG *) 	0x400980F4) // (US2) US IPNAME2 REGISTER 
#define AT91C_US2_RHR   ((AT91_REG *) 	0x40098018) // (US2) Receiver Holding Register
#define AT91C_US2_NER   ((AT91_REG *) 	0x40098044) // (US2) Nb Errors Register
#define AT91C_US2_IMR   ((AT91_REG *) 	0x40098010) // (US2) Interrupt Mask Register
// ========== Register definition for PDC_US3 peripheral ========== 
#define AT91C_US3_TPR   ((AT91_REG *) 	0x4009C108) // (PDC_US3) Transmit Pointer Register
#define AT91C_US3_PTCR  ((AT91_REG *) 	0x4009C120) // (PDC_US3) PDC Transfer Control Register
#define AT91C_US3_TCR   ((AT91_REG *) 	0x4009C10C) // (PDC_US3) Transmit Counter Register
#define AT91C_US3_RCR   ((AT91_REG *) 	0x4009C104) // (PDC_US3) Receive Counter Register
#define AT91C_US3_RNCR  ((AT91_REG *) 	0x4009C114) // (PDC_US3) Receive Next Counter Register
#define AT91C_US3_RNPR  ((AT91_REG *) 	0x4009C110) // (PDC_US3) Receive Next Pointer Register
#define AT91C_US3_RPR   ((AT91_REG *) 	0x4009C100) // (PDC_US3) Receive Pointer Register
#define AT91C_US3_PTSR  ((AT91_REG *) 	0x4009C124) // (PDC_US3) PDC Transfer Status Register
#define AT91C_US3_TNCR  ((AT91_REG *) 	0x4009C11C) // (PDC_US3) Transmit Next Counter Register
#define AT91C_US3_TNPR  ((AT91_REG *) 	0x4009C118) // (PDC_US3) Transmit Next Pointer Register
// ========== Register definition for US3 peripheral ========== 
#define AT91C_US3_MAN   ((AT91_REG *) 	0x4009C050) // (US3) Manchester Encoder Decoder Register
#define AT91C_US3_CSR   ((AT91_REG *) 	0x4009C014) // (US3) Channel Status Register
#define AT91C_US3_BRGR  ((AT91_REG *) 	0x4009C020) // (US3) Baud Rate Generator Register
#define AT91C_US3_IPNAME2 ((AT91_REG *) 	0x4009C0F4) // (US3) US IPNAME2 REGISTER 
#define AT91C_US3_RTOR  ((AT91_REG *) 	0x4009C024) // (US3) Receiver Time-out Register
#define AT91C_US3_ADDRSIZE ((AT91_REG *) 	0x4009C0EC) // (US3) US ADDRSIZE REGISTER 
#define AT91C_US3_CR    ((AT91_REG *) 	0x4009C000) // (US3) Control Register
#define AT91C_US3_IF    ((AT91_REG *) 	0x4009C04C) // (US3) IRDA_FILTER Register
#define AT91C_US3_FEATURES ((AT91_REG *) 	0x4009C0F8) // (US3) US FEATURES REGISTER 
#define AT91C_US3_VER   ((AT91_REG *) 	0x4009C0FC) // (US3) VERSION Register
#define AT91C_US3_RHR   ((AT91_REG *) 	0x4009C018) // (US3) Receiver Holding Register
#define AT91C_US3_TTGR  ((AT91_REG *) 	0x4009C028) // (US3) Transmitter Time-guard Register
#define AT91C_US3_NER   ((AT91_REG *) 	0x4009C044) // (US3) Nb Errors Register
#define AT91C_US3_IMR   ((AT91_REG *) 	0x4009C010) // (US3) Interrupt Mask Register
#define AT91C_US3_THR   ((AT91_REG *) 	0x4009C01C) // (US3) Transmitter Holding Register
#define AT91C_US3_IDR   ((AT91_REG *) 	0x4009C00C) // (US3) Interrupt Disable Register
#define AT91C_US3_MR    ((AT91_REG *) 	0x4009C004) // (US3) Mode Register
#define AT91C_US3_IER   ((AT91_REG *) 	0x4009C008) // (US3) Interrupt Enable Register
#define AT91C_US3_FIDI  ((AT91_REG *) 	0x4009C040) // (US3) FI_DI_Ratio Register
#define AT91C_US3_IPNAME1 ((AT91_REG *) 	0x4009C0F0) // (US3) US IPNAME1 REGISTER 
// ========== Register definition for PDC_SSC0 peripheral ========== 
#define AT91C_SSC0_RNCR ((AT91_REG *) 	0x40004114) // (PDC_SSC0) Receive Next Counter Register
#define AT91C_SSC0_TPR  ((AT91_REG *) 	0x40004108) // (PDC_SSC0) Transmit Pointer Register
#define AT91C_SSC0_TCR  ((AT91_REG *) 	0x4000410C) // (PDC_SSC0) Transmit Counter Register
#define AT91C_SSC0_PTCR ((AT91_REG *) 	0x40004120) // (PDC_SSC0) PDC Transfer Control Register
#define AT91C_SSC0_TNPR ((AT91_REG *) 	0x40004118) // (PDC_SSC0) Transmit Next Pointer Register
#define AT91C_SSC0_RPR  ((AT91_REG *) 	0x40004100) // (PDC_SSC0) Receive Pointer Register
#define AT91C_SSC0_TNCR ((AT91_REG *) 	0x4000411C) // (PDC_SSC0) Transmit Next Counter Register
#define AT91C_SSC0_RNPR ((AT91_REG *) 	0x40004110) // (PDC_SSC0) Receive Next Pointer Register
#define AT91C_SSC0_RCR  ((AT91_REG *) 	0x40004104) // (PDC_SSC0) Receive Counter Register
#define AT91C_SSC0_PTSR ((AT91_REG *) 	0x40004124) // (PDC_SSC0) PDC Transfer Status Register
// ========== Register definition for SSC0 peripheral ========== 
#define AT91C_SSC0_CR   ((AT91_REG *) 	0x40004000) // (SSC0) Control Register
#define AT91C_SSC0_RHR  ((AT91_REG *) 	0x40004020) // (SSC0) Receive Holding Register
#define AT91C_SSC0_TSHR ((AT91_REG *) 	0x40004034) // (SSC0) Transmit Sync Holding Register
#define AT91C_SSC0_RFMR ((AT91_REG *) 	0x40004014) // (SSC0) Receive Frame Mode Register
#define AT91C_SSC0_IDR  ((AT91_REG *) 	0x40004048) // (SSC0) Interrupt Disable Register
#define AT91C_SSC0_TFMR ((AT91_REG *) 	0x4000401C) // (SSC0) Transmit Frame Mode Register
#define AT91C_SSC0_RSHR ((AT91_REG *) 	0x40004030) // (SSC0) Receive Sync Holding Register
#define AT91C_SSC0_RC1R ((AT91_REG *) 	0x4000403C) // (SSC0) Receive Compare 1 Register
#define AT91C_SSC0_TCMR ((AT91_REG *) 	0x40004018) // (SSC0) Transmit Clock Mode Register
#define AT91C_SSC0_RCMR ((AT91_REG *) 	0x40004010) // (SSC0) Receive Clock ModeRegister
#define AT91C_SSC0_SR   ((AT91_REG *) 	0x40004040) // (SSC0) Status Register
#define AT91C_SSC0_RC0R ((AT91_REG *) 	0x40004038) // (SSC0) Receive Compare 0 Register
#define AT91C_SSC0_THR  ((AT91_REG *) 	0x40004024) // (SSC0) Transmit Holding Register
#define AT91C_SSC0_CMR  ((AT91_REG *) 	0x40004004) // (SSC0) Clock Mode Register
#define AT91C_SSC0_IER  ((AT91_REG *) 	0x40004044) // (SSC0) Interrupt Enable Register
#define AT91C_SSC0_IMR  ((AT91_REG *) 	0x4000404C) // (SSC0) Interrupt Mask Register
// ========== Register definition for PDC_PWMC peripheral ========== 
#define AT91C_PWMC_TNCR ((AT91_REG *) 	0x4008C11C) // (PDC_PWMC) Transmit Next Counter Register
#define AT91C_PWMC_TPR  ((AT91_REG *) 	0x4008C108) // (PDC_PWMC) Transmit Pointer Register
#define AT91C_PWMC_RPR  ((AT91_REG *) 	0x4008C100) // (PDC_PWMC) Receive Pointer Register
#define AT91C_PWMC_TCR  ((AT91_REG *) 	0x4008C10C) // (PDC_PWMC) Transmit Counter Register
#define AT91C_PWMC_PTSR ((AT91_REG *) 	0x4008C124) // (PDC_PWMC) PDC Transfer Status Register
#define AT91C_PWMC_RNPR ((AT91_REG *) 	0x4008C110) // (PDC_PWMC) Receive Next Pointer Register
#define AT91C_PWMC_RCR  ((AT91_REG *) 	0x4008C104) // (PDC_PWMC) Receive Counter Register
#define AT91C_PWMC_RNCR ((AT91_REG *) 	0x4008C114) // (PDC_PWMC) Receive Next Counter Register
#define AT91C_PWMC_PTCR ((AT91_REG *) 	0x4008C120) // (PDC_PWMC) PDC Transfer Control Register
#define AT91C_PWMC_TNPR ((AT91_REG *) 	0x4008C118) // (PDC_PWMC) Transmit Next Pointer Register
// ========== Register definition for PWMC_CH0 peripheral ========== 
#define AT91C_PWMC_CH0_DTR ((AT91_REG *) 	0x4008C218) // (PWMC_CH0) Channel Dead Time Value Register
#define AT91C_PWMC_CH0_CMR ((AT91_REG *) 	0x4008C200) // (PWMC_CH0) Channel Mode Register
#define AT91C_PWMC_CH0_CCNTR ((AT91_REG *) 	0x4008C214) // (PWMC_CH0) Channel Counter Register
#define AT91C_PWMC_CH0_CPRDR ((AT91_REG *) 	0x4008C20C) // (PWMC_CH0) Channel Period Register
#define AT91C_PWMC_CH0_DTUPDR ((AT91_REG *) 	0x4008C21C) // (PWMC_CH0) Channel Dead Time Update Value Register
#define AT91C_PWMC_CH0_CPRDUPDR ((AT91_REG *) 	0x4008C210) // (PWMC_CH0) Channel Period Update Register
#define AT91C_PWMC_CH0_CDTYUPDR ((AT91_REG *) 	0x4008C208) // (PWMC_CH0) Channel Duty Cycle Update Register
#define AT91C_PWMC_CH0_CDTYR ((AT91_REG *) 	0x4008C204) // (PWMC_CH0) Channel Duty Cycle Register
// ========== Register definition for PWMC_CH1 peripheral ========== 
#define AT91C_PWMC_CH1_CCNTR ((AT91_REG *) 	0x4008C234) // (PWMC_CH1) Channel Counter Register
#define AT91C_PWMC_CH1_DTR ((AT91_REG *) 	0x4008C238) // (PWMC_CH1) Channel Dead Time Value Register
#define AT91C_PWMC_CH1_CDTYUPDR ((AT91_REG *) 	0x4008C228) // (PWMC_CH1) Channel Duty Cycle Update Register
#define AT91C_PWMC_CH1_DTUPDR ((AT91_REG *) 	0x4008C23C) // (PWMC_CH1) Channel Dead Time Update Value Register
#define AT91C_PWMC_CH1_CDTYR ((AT91_REG *) 	0x4008C224) // (PWMC_CH1) Channel Duty Cycle Register
#define AT91C_PWMC_CH1_CPRDR ((AT91_REG *) 	0x4008C22C) // (PWMC_CH1) Channel Period Register
#define AT91C_PWMC_CH1_CPRDUPDR ((AT91_REG *) 	0x4008C230) // (PWMC_CH1) Channel Period Update Register
#define AT91C_PWMC_CH1_CMR ((AT91_REG *) 	0x4008C220) // (PWMC_CH1) Channel Mode Register
// ========== Register definition for PWMC_CH2 peripheral ========== 
#define AT91C_PWMC_CH2_CDTYR ((AT91_REG *) 	0x4008C244) // (PWMC_CH2) Channel Duty Cycle Register
#define AT91C_PWMC_CH2_DTUPDR ((AT91_REG *) 	0x4008C25C) // (PWMC_CH2) Channel Dead Time Update Value Register
#define AT91C_PWMC_CH2_CCNTR ((AT91_REG *) 	0x4008C254) // (PWMC_CH2) Channel Counter Register
#define AT91C_PWMC_CH2_CMR ((AT91_REG *) 	0x4008C240) // (PWMC_CH2) Channel Mode Register
