una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u4.h
#define AT91C_PWMC_CH2_CPRDR ((AT91_REG *) 	0x4008C24C) // (PWMC_CH2) Channel Period Register
#define AT91C_PWMC_CH2_CPRDUPDR ((AT91_REG *) 	0x4008C250) // (PWMC_CH2) Channel Period Update Register
#define AT91C_PWMC_CH2_CDTYUPDR ((AT91_REG *) 	0x4008C248) // (PWMC_CH2) Channel Duty Cycle Update Register
#define AT91C_PWMC_CH2_DTR ((AT91_REG *) 	0x4008C258) // (PWMC_CH2) Channel Dead Time Value Register
// ========== Register definition for PWMC_CH3 peripheral ========== 
#define AT91C_PWMC_CH3_CPRDUPDR ((AT91_REG *) 	0x4008C270) // (PWMC_CH3) Channel Period Update Register
#define AT91C_PWMC_CH3_DTR ((AT91_REG *) 	0x4008C278) // (PWMC_CH3) Channel Dead Time Value Register
#define AT91C_PWMC_CH3_CDTYR ((AT91_REG *) 	0x4008C264) // (PWMC_CH3) Channel Duty Cycle Register
#define AT91C_PWMC_CH3_DTUPDR ((AT91_REG *) 	0x4008C27C) // (PWMC_CH3) Channel Dead Time Update Value Register
#define AT91C_PWMC_CH3_CDTYUPDR ((AT91_REG *) 	0x4008C268) // (PWMC_CH3) Channel Duty Cycle Update Register
#define AT91C_PWMC_CH3_CCNTR ((AT91_REG *) 	0x4008C274) // (PWMC_CH3) Channel Counter Register
#define AT91C_PWMC_CH3_CMR ((AT91_REG *) 	0x4008C260) // (PWMC_CH3) Channel Mode Register
#define AT91C_PWMC_CH3_CPRDR ((AT91_REG *) 	0x4008C26C) // (PWMC_CH3) Channel Period Register
// ========== Register definition for PWMC peripheral ========== 
#define AT91C_PWMC_CMP6MUPD ((AT91_REG *) 	0x4008C19C) // (PWMC) PWM Comparison Mode 6 Update Register
#define AT91C_PWMC_ISR1 ((AT91_REG *) 	0x4008C01C) // (PWMC) PWMC Interrupt Status Register 1
#define AT91C_PWMC_CMP5V ((AT91_REG *) 	0x4008C180) // (PWMC) PWM Comparison Value 5 Register
#define AT91C_PWMC_CMP4MUPD ((AT91_REG *) 	0x4008C17C) // (PWMC) PWM Comparison Mode 4 Update Register
#define AT91C_PWMC_FMR  ((AT91_REG *) 	0x4008C05C) // (PWMC) PWM Fault Mode Register
#define AT91C_PWMC_CMP6V ((AT91_REG *) 	0x4008C190) // (PWMC) PWM Comparison Value 6 Register
#define AT91C_PWMC_EL4MR ((AT91_REG *) 	0x4008C08C) // (PWMC) PWM Event Line 4 Mode Register
#define AT91C_PWMC_UPCR ((AT91_REG *) 	0x4008C028) // (PWMC) PWM Update Control Register
#define AT91C_PWMC_CMP1VUPD ((AT91_REG *) 	0x4008C144) // (PWMC) PWM Comparison Value 1 Update Register
#define AT91C_PWMC_CMP0M ((AT91_REG *) 	0x4008C138) // (PWMC) PWM Comparison Mode 0 Register
#define AT91C_PWMC_CMP5VUPD ((AT91_REG *) 	0x4008C184) // (PWMC) PWM Comparison Value 5 Update Register
#define AT91C_PWMC_FPER3 ((AT91_REG *) 	0x4008C074) // (PWMC) PWM Fault Protection Enable Register 3
#define AT91C_PWMC_OSCUPD ((AT91_REG *) 	0x4008C058) // (PWMC) PWM Output Selection Clear Update Register
#define AT91C_PWMC_FPER1 ((AT91_REG *) 	0x4008C06C) // (PWMC) PWM Fault Protection Enable Register 1
#define AT91C_PWMC_SCUPUPD ((AT91_REG *) 	0x4008C030) // (PWMC) PWM Update Period Update Register
#define AT91C_PWMC_DIS  ((AT91_REG *) 	0x4008C008) // (PWMC) PWMC Disable Register
#define AT91C_PWMC_IER1 ((AT91_REG *) 	0x4008C010) // (PWMC) PWMC Interrupt Enable Register 1
#define AT91C_PWMC_IMR2 ((AT91_REG *) 	0x4008C03C) // (PWMC) PWMC Interrupt Mask Register 2
#define AT91C_PWMC_CMP0V ((AT91_REG *) 	0x4008C130) // (PWMC) PWM Comparison Value 0 Register
#define AT91C_PWMC_SR   ((AT91_REG *) 	0x4008C00C) // (PWMC) PWMC Status Register
#define AT91C_PWMC_CMP4M ((AT91_REG *) 	0x4008C178) // (PWMC) PWM Comparison Mode 4 Register
#define AT91C_PWMC_CMP3M ((AT91_REG *) 	0x4008C168) // (PWMC) PWM Comparison Mode 3 Register
#define AT91C_PWMC_IER2 ((AT91_REG *) 	0x4008C034) // (PWMC) PWMC Interrupt Enable Register 2
#define AT91C_PWMC_CMP3VUPD ((AT91_REG *) 	0x4008C164) // (PWMC) PWM Comparison Value 3 Update Register
#define AT91C_PWMC_CMP2M ((AT91_REG *) 	0x4008C158) // (PWMC) PWM Comparison Mode 2 Register
#define AT91C_PWMC_IDR2 ((AT91_REG *) 	0x4008C038) // (PWMC) PWMC Interrupt Disable Register 2
#define AT91C_PWMC_EL2MR ((AT91_REG *) 	0x4008C084) // (PWMC) PWM Event Line 2 Mode Register
#define AT91C_PWMC_CMP7V ((AT91_REG *) 	0x4008C1A0) // (PWMC) PWM Comparison Value 7 Register
#define AT91C_PWMC_CMP1M ((AT91_REG *) 	0x4008C148) // (PWMC) PWM Comparison Mode 1 Register
#define AT91C_PWMC_CMP0VUPD ((AT91_REG *) 	0x4008C134) // (PWMC) PWM Comparison Value 0 Update Register
#define AT91C_PWMC_WPSR ((AT91_REG *) 	0x4008C0E8) // (PWMC) PWM Write Protection Status Register
#define AT91C_PWMC_CMP6VUPD ((AT91_REG *) 	0x4008C194) // (PWMC) PWM Comparison Value 6 Update Register
#define AT91C_PWMC_CMP1MUPD ((AT91_REG *) 	0x4008C14C) // (PWMC) PWM Comparison Mode 1 Update Register
#define AT91C_PWMC_CMP1V ((AT91_REG *) 	0x4008C140) // (PWMC) PWM Comparison Value 1 Register
#define AT91C_PWMC_FCR  ((AT91_REG *) 	0x4008C064) // (PWMC) PWM Fault Mode Clear Register
#define AT91C_PWMC_VER  ((AT91_REG *) 	0x4008C0FC) // (PWMC) PWMC Version Register
#define AT91C_PWMC_EL1MR ((AT91_REG *) 	0x4008C080) // (PWMC) PWM Event Line 1 Mode Register
#define AT91C_PWMC_EL6MR ((AT91_REG *) 	0x4008C094) // (PWMC) PWM Event Line 6 Mode Register
#define AT91C_PWMC_ISR2 ((AT91_REG *) 	0x4008C040) // (PWMC) PWMC Interrupt Status Register 2
#define AT91C_PWMC_CMP4VUPD ((AT91_REG *) 	0x4008C174) // (PWMC) PWM Comparison Value 4 Update Register
#define AT91C_PWMC_CMP5MUPD ((AT91_REG *) 	0x4008C18C) // (PWMC) PWM Comparison Mode 5 Update Register
#define AT91C_PWMC_OS   ((AT91_REG *) 	0x4008C048) // (PWMC) PWM Output Selection Register
#define AT91C_PWMC_FPV  ((AT91_REG *) 	0x4008C068) // (PWMC) PWM Fault Protection Value Register
#define AT91C_PWMC_FPER2 ((AT91_REG *) 	0x4008C070) // (PWMC) PWM Fault Protection Enable Register 2
#define AT91C_PWMC_EL7MR ((AT91_REG *) 	0x4008C098) // (PWMC) PWM Event Line 7 Mode Register
#define AT91C_PWMC_OSSUPD ((AT91_REG *) 	0x4008C054) // (PWMC) PWM Output Selection Set Update Register
#define AT91C_PWMC_FEATURES ((AT91_REG *) 	0x4008C0F8) // (PWMC) PWMC FEATURES REGISTER 
#define AT91C_PWMC_CMP2V ((AT91_REG *) 	0x4008C150) // (PWMC) PWM Comparison Value 2 Register
#define AT91C_PWMC_FSR  ((AT91_REG *) 	0x4008C060) // (PWMC) PWM Fault Mode Status Register
#define AT91C_PWMC_ADDRSIZE ((AT91_REG *) 	0x4008C0EC) // (PWMC) PWMC ADDRSIZE REGISTER 
#define AT91C_PWMC_OSC  ((AT91_REG *) 	0x4008C050) // (PWMC) PWM Output Selection Clear Register
#define AT91C_PWMC_SCUP ((AT91_REG *) 	0x4008C02C) // (PWMC) PWM Update Period Register
#define AT91C_PWMC_CMP7MUPD ((AT91_REG *) 	0x4008C1AC) // (PWMC) PWM Comparison Mode 7 Update Register
#define AT91C_PWMC_CMP2VUPD ((AT91_REG *) 	0x4008C154) // (PWMC) PWM Comparison Value 2 Update Register
#define AT91C_PWMC_FPER4 ((AT91_REG *) 	0x4008C078) // (PWMC) PWM Fault Protection Enable Register 4
#define AT91C_PWMC_IMR1 ((AT91_REG *) 	0x4008C018) // (PWMC) PWMC Interrupt Mask Register 1
#define AT91C_PWMC_EL3MR ((AT91_REG *) 	0x4008C088) // (PWMC) PWM Event Line 3 Mode Register
#define AT91C_PWMC_CMP3V ((AT91_REG *) 	0x4008C160) // (PWMC) PWM Comparison Value 3 Register
#define AT91C_PWMC_IPNAME1 ((AT91_REG *) 	0x4008C0F0) // (PWMC) PWMC IPNAME1 REGISTER 
#define AT91C_PWMC_OSS  ((AT91_REG *) 	0x4008C04C) // (PWMC) PWM Output Selection Set Register
#define AT91C_PWMC_CMP0MUPD ((AT91_REG *) 	0x4008C13C) // (PWMC) PWM Comparison Mode 0 Update Register
#define AT91C_PWMC_CMP2MUPD ((AT91_REG *) 	0x4008C15C) // (PWMC) PWM Comparison Mode 2 Update Register
#define AT91C_PWMC_CMP4V ((AT91_REG *) 	0x4008C170) // (PWMC) PWM Comparison Value 4 Register
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0x4008C004) // (PWMC) PWMC Enable Register
#define AT91C_PWMC_CMP3MUPD ((AT91_REG *) 	0x4008C16C) // (PWMC) PWM Comparison Mode 3 Update Register
#define AT91C_PWMC_EL0MR ((AT91_REG *) 	0x4008C07C) // (PWMC) PWM Event Line 0 Mode Register
#define AT91C_PWMC_OOV  ((AT91_REG *) 	0x4008C044) // (PWMC) PWM Output Override Value Register
#define AT91C_PWMC_WPCR ((AT91_REG *) 	0x4008C0E4) // (PWMC) PWM Write Protection Enable Register
#define AT91C_PWMC_CMP7M ((AT91_REG *) 	0x4008C1A8) // (PWMC) PWM Comparison Mode 7 Register
#define AT91C_PWMC_CMP6M ((AT91_REG *) 	0x4008C198) // (PWMC) PWM Comparison Mode 6 Register
#define AT91C_PWMC_CMP5M ((AT91_REG *) 	0x4008C188) // (PWMC) PWM Comparison Mode 5 Register
#define AT91C_PWMC_IPNAME2 ((AT91_REG *) 	0x4008C0F4) // (PWMC) PWMC IPNAME2 REGISTER 
#define AT91C_PWMC_CMP7VUPD ((AT91_REG *) 	0x4008C1A4) // (PWMC) PWM Comparison Value 7 Update Register
#define AT91C_PWMC_SYNC ((AT91_REG *) 	0x4008C020) // (PWMC) PWM Synchronized Channels Register
#define AT91C_PWMC_MR   ((AT91_REG *) 	0x4008C000) // (PWMC) PWMC Mode Register
#define AT91C_PWMC_IDR1 ((AT91_REG *) 	0x4008C014) // (PWMC) PWMC Interrupt Disable Register 1
#define AT91C_PWMC_EL5MR ((AT91_REG *) 	0x4008C090) // (PWMC) PWM Event Line 5 Mode Register
// ========== Register definition for SPI0 peripheral ========== 
#define AT91C_SPI0_ADDRSIZE ((AT91_REG *) 	0x400080EC) // (SPI0) SPI ADDRSIZE REGISTER 
#define AT91C_SPI0_RDR  ((AT91_REG *) 	0x40008008) // (SPI0) Receive Data Register
#define AT91C_SPI0_FEATURES ((AT91_REG *) 	0x400080F8) // (SPI0) SPI FEATURES REGISTER 
#define AT91C_SPI0_CR   ((AT91_REG *) 	0x40008000) // (SPI0) Control Register
#define AT91C_SPI0_IPNAME1 ((AT91_REG *) 	0x400080F0) // (SPI0) SPI IPNAME1 REGISTER 
#define AT91C_SPI0_VER  ((AT91_REG *) 	0x400080FC) // (SPI0) Version Register
#define AT91C_SPI0_IDR  ((AT91_REG *) 	0x40008018) // (SPI0) Interrupt Disable Register
#define AT91C_SPI0_TDR  ((AT91_REG *) 	0x4000800C) // (SPI0) Transmit Data Register
#define AT91C_SPI0_MR   ((AT91_REG *) 	0x40008004) // (SPI0) Mode Register
#define AT91C_SPI0_IER  ((AT91_REG *) 	0x40008014) // (SPI0) Interrupt Enable Register
#define AT91C_SPI0_IMR  ((AT91_REG *) 	0x4000801C) // (SPI0) Interrupt Mask Register
#define AT91C_SPI0_IPNAME2 ((AT91_REG *) 	0x400080F4) // (SPI0) SPI IPNAME2 REGISTER 
#define AT91C_SPI0_CSR  ((AT91_REG *) 	0x40008030) // (SPI0) Chip Select Register
#define AT91C_SPI0_SR   ((AT91_REG *) 	0x40008010) // (SPI0) Status Register
// ========== Register definition for UDPHS_EPTFIFO peripheral ========== 
#define AT91C_UDPHS_EPTFIFO_READEPT6 ((AT91_REG *) 	0x201E0000) // (UDPHS_EPTFIFO) FIFO Endpoint Data Register 6
#define AT91C_UDPHS_EPTFIFO_READEPT2 ((AT91_REG *) 	0x201A0000) // (UDPHS_EPTFIFO) FIFO Endpoint Data Register 2
#define AT91C_UDPHS_EPTFIFO_READEPT1 ((AT91_REG *) 	0x20190000) // (UDPHS_EPTFIFO) FIFO Endpoint Data Register 1
#define AT91C_UDPHS_EPTFIFO_READEPT0 ((AT91_REG *) 	0x20180000) // (UDPHS_EPTFIFO) FIFO Endpoint Data Register 0
#define AT91C_UDPHS_EPTFIFO_READEPT5 ((AT91_REG *) 	0x201D0000) // (UDPHS_EPTFIFO) FIFO Endpoint Data Register 5
#define AT91C_UDPHS_EPTFIFO_READEPT4 ((AT91_REG *) 	0x201C0000) // (UDPHS_EPTFIFO) FIFO Endpoint Data Register 4
#define AT91C_UDPHS_EPTFIFO_READEPT3 ((AT91_REG *) 	0x201B0000) // (UDPHS_EPTFIFO) FIFO Endpoint Data Register 3
// ========== Register definition for UDPHS_EPT_0 peripheral ========== 
#define AT91C_UDPHS_EPT_0_EPTCTL ((AT91_REG *) 	0x400A410C) // (UDPHS_EPT_0) UDPHS Endpoint Control Register
#define AT91C_UDPHS_EPT_0_EPTSTA ((AT91_REG *) 	0x400A411C) // (UDPHS_EPT_0) UDPHS Endpoint Status Register
#define AT91C_UDPHS_EPT_0_EPTCLRSTA ((AT91_REG *) 	0x400A4118) // (UDPHS_EPT_0) UDPHS Endpoint Clear Status Register
#define AT91C_UDPHS_EPT_0_EPTCTLDIS ((AT91_REG *) 	0x400A4108) // (UDPHS_EPT_0) UDPHS Endpoint Control Disable Register
#define AT91C_UDPHS_EPT_0_EPTCFG ((AT91_REG *) 	0x400A4100) // (UDPHS_EPT_0) UDPHS Endpoint Config Register
#define AT91C_UDPHS_EPT_0_EPTSETSTA ((AT91_REG *) 	0x400A4114) // (UDPHS_EPT_0) UDPHS Endpoint Set Status Register
#define AT91C_UDPHS_EPT_0_EPTCTLENB ((AT91_REG *) 	0x400A4104) // (UDPHS_EPT_0) UDPHS Endpoint Control Enable Register
// ========== Register definition for UDPHS_EPT_1 peripheral ========== 
#define AT91C_UDPHS_EPT_1_EPTSTA ((AT91_REG *) 	0x400A413C) // (UDPHS_EPT_1) UDPHS Endpoint Status Register
#define AT91C_UDPHS_EPT_1_EPTSETSTA ((AT91_REG *) 	0x400A4134) // (UDPHS_EPT_1) UDPHS Endpoint Set Status Register
#define AT91C_UDPHS_EPT_1_EPTCTL ((AT91_REG *) 	0x400A412C) // (UDPHS_EPT_1) UDPHS Endpoint Control Register
#define AT91C_UDPHS_EPT_1_EPTCFG ((AT91_REG *) 	0x400A4120) // (UDPHS_EPT_1) UDPHS Endpoint Config Register
#define AT91C_UDPHS_EPT_1_EPTCTLDIS ((AT91_REG *) 	0x400A4128) // (UDPHS_EPT_1) UDPHS Endpoint Control Disable Register
#define AT91C_UDPHS_EPT_1_EPTCLRSTA ((AT91_REG *) 	0x400A4138) // (UDPHS_EPT_1) UDPHS Endpoint Clear Status Register
#define AT91C_UDPHS_EPT_1_EPTCTLENB ((AT91_REG *) 	0x400A4124) // (UDPHS_EPT_1) UDPHS Endpoint Control Enable Register
// ========== Register definition for UDPHS_EPT_2 peripheral ========== 
#define AT91C_UDPHS_EPT_2_EPTCTLENB ((AT91_REG *) 	0x400A4144) // (UDPHS_EPT_2) UDPHS Endpoint Control Enable Register
#define AT91C_UDPHS_EPT_2_EPTCLRSTA ((AT91_REG *) 	0x400A4158) // (UDPHS_EPT_2) UDPHS Endpoint Clear Status Register
#define AT91C_UDPHS_EPT_2_EPTCFG ((AT91_REG *) 	0x400A4140) // (UDPHS_EPT_2) UDPHS Endpoint Config Register
#define AT91C_UDPHS_EPT_2_EPTCTL ((AT91_REG *) 	0x400A414C) // (UDPHS_EPT_2) UDPHS Endpoint Control Register
#define AT91C_UDPHS_EPT_2_EPTSETSTA ((AT91_REG *) 	0x400A4154) // (UDPHS_EPT_2) UDPHS Endpoint Set Status Register
#define AT91C_UDPHS_EPT_2_EPTSTA ((AT91_REG *) 	0x400A415C) // (UDPHS_EPT_2) UDPHS Endpoint Status Register
#define AT91C_UDPHS_EPT_2_EPTCTLDIS ((AT91_REG *) 	0x400A4148) // (UDPHS_EPT_2) UDPHS Endpoint Control Disable Register
// ========== Register definition for UDPHS_EPT_3 peripheral ========== 
#define AT91C_UDPHS_EPT_3_EPTCTLDIS ((AT91_REG *) 	0x400A4168) // (UDPHS_EPT_3) UDPHS Endpoint Control Disable Register
#define AT91C_UDPHS_EPT_3_EPTCTLENB ((AT91_REG *) 	0x400A4164) // (UDPHS_EPT_3) UDPHS Endpoint Control Enable Register
#define AT91C_UDPHS_EPT_3_EPTSETSTA ((AT91_REG *) 	0x400A4174) // (UDPHS_EPT_3) UDPHS Endpoint Set Status Register
#define AT91C_UDPHS_EPT_3_EPTCLRSTA ((AT91_REG *) 	0x400A4178) // (UDPHS_EPT_3) UDPHS Endpoint Clear Status Register
#define AT91C_UDPHS_EPT_3_EPTCFG ((AT91_REG *) 	0x400A4160) // (UDPHS_EPT_3) UDPHS Endpoint Config Register
#define AT91C_UDPHS_EPT_3_EPTSTA ((AT91_REG *) 	0x400A417C) // (UDPHS_EPT_3) UDPHS Endpoint Status Register
#define AT91C_UDPHS_EPT_3_EPTCTL ((AT91_REG *) 	0x400A416C) // (UDPHS_EPT_3) UDPHS Endpoint Control Register
// ========== Register definition for UDPHS_EPT_4 peripheral ========== 
#define AT91C_UDPHS_EPT_4_EPTSETSTA ((AT91_REG *) 	0x400A4194) // (UDPHS_EPT_4) UDPHS Endpoint Set Status Register
#define AT91C_UDPHS_EPT_4_EPTCTLDIS ((AT91_REG *) 	0x400A4188) // (UDPHS_EPT_4) UDPHS Endpoint Control Disable Register
#define AT91C_UDPHS_EPT_4_EPTCTL ((AT91_REG *) 	0x400A418C) // (UDPHS_EPT_4) UDPHS Endpoint Control Register
#define AT91C_UDPHS_EPT_4_EPTCFG ((AT91_REG *) 	0x400A4180) // (UDPHS_EPT_4) UDPHS Endpoint Config Register
#define AT91C_UDPHS_EPT_4_EPTCTLENB ((AT91_REG *) 	0x400A4184) // (UDPHS_EPT_4) UDPHS Endpoint Control Enable Register
#define AT91C_UDPHS_EPT_4_EPTSTA ((AT91_REG *) 	0x400A419C) // (UDPHS_EPT_4) UDPHS Endpoint Status Register
#define AT91C_UDPHS_EPT_4_EPTCLRSTA ((AT91_REG *) 	0x400A4198) // (UDPHS_EPT_4) UDPHS Endpoint Clear Status Register
// ========== Register definition for UDPHS_EPT_5 peripheral ========== 
#define AT91C_UDPHS_EPT_5_EPTCFG ((AT91_REG *) 	0x400A41A0) // (UDPHS_EPT_5) UDPHS Endpoint Config Register
#define AT91C_UDPHS_EPT_5_EPTCTL ((AT91_REG *) 	0x400A41AC) // (UDPHS_EPT_5) UDPHS Endpoint Control Register
#define AT91C_UDPHS_EPT_5_EPTCTLENB ((AT91_REG *) 	0x400A41A4) // (UDPHS_EPT_5) UDPHS Endpoint Control Enable Register
#define AT91C_UDPHS_EPT_5_EPTSTA ((AT91_REG *) 	0x400A41BC) // (UDPHS_EPT_5) UDPHS Endpoint Status Register
#define AT91C_UDPHS_EPT_5_EPTSETSTA ((AT91_REG *) 	0x400A41B4) // (UDPHS_EPT_5) UDPHS Endpoint Set Status Register
#define AT91C_UDPHS_EPT_5_EPTCTLDIS ((AT91_REG *) 	0x400A41A8) // (UDPHS_EPT_5) UDPHS Endpoint Control Disable Register
#define AT91C_UDPHS_EPT_5_EPTCLRSTA ((AT91_REG *) 	0x400A41B8) // (UDPHS_EPT_5) UDPHS Endpoint Clear Status Register
// ========== Register definition for UDPHS_EPT_6 peripheral ========== 
#define AT91C_UDPHS_EPT_6_EPTCLRSTA ((AT91_REG *) 	0x400A41D8) // (UDPHS_EPT_6) UDPHS Endpoint Clear Status Register
#define AT91C_UDPHS_EPT_6_EPTCTL ((AT91_REG *) 	0x400A41CC) // (UDPHS_EPT_6) UDPHS Endpoint Control Register
#define AT91C_UDPHS_EPT_6_EPTCFG ((AT91_REG *) 	0x400A41C0) // (UDPHS_EPT_6) UDPHS Endpoint Config Register
#define AT91C_UDPHS_EPT_6_EPTCTLDIS ((AT91_REG *) 	0x400A41C8) // (UDPHS_EPT_6) UDPHS Endpoint Control Disable Register
#define AT91C_UDPHS_EPT_6_EPTSTA ((AT91_REG *) 	0x400A41DC) // (UDPHS_EPT_6) UDPHS Endpoint Status Register
#define AT91C_UDPHS_EPT_6_EPTCTLENB ((AT91_REG *) 	0x400A41C4) // (UDPHS_EPT_6) UDPHS Endpoint Control Enable Register
#define AT91C_UDPHS_EPT_6_EPTSETSTA ((AT91_REG *) 	0x400A41D4) // (UDPHS_EPT_6) UDPHS Endpoint Set Status Register
// ========== Register definition for UDPHS_DMA_1 peripheral ========== 
#define AT91C_UDPHS_DMA_1_DMASTATUS ((AT91_REG *) 	0x400A431C) // (UDPHS_DMA_1) UDPHS DMA Channel Status Register
#define AT91C_UDPHS_DMA_1_DMACONTROL ((AT91_REG *) 	0x400A4318) // (UDPHS_DMA_1) UDPHS DMA Channel Control Register
#define AT91C_UDPHS_DMA_1_DMANXTDSC ((AT91_REG *) 	0x400A4310) // (UDPHS_DMA_1) UDPHS DMA Channel Next Descriptor Address
#define AT91C_UDPHS_DMA_1_DMAADDRESS ((AT91_REG *) 	0x400A4314) // (UDPHS_DMA_1) UDPHS DMA Channel Address Register
// ========== Register definition for UDPHS_DMA_2 peripheral ========== 
#define AT91C_UDPHS_DMA_2_DMASTATUS ((AT91_REG *) 	0x400A432C) // (UDPHS_DMA_2) UDPHS DMA Channel Status Register
#define AT91C_UDPHS_DMA_2_DMANXTDSC ((AT91_REG *) 	0x400A4320) // (UDPHS_DMA_2) UDPHS DMA Channel Next Descriptor Address
#define AT91C_UDPHS_DMA_2_DMACONTROL ((AT91_REG *) 	0x400A4328) // (UDPHS_DMA_2) UDPHS DMA Channel Control Register
#define AT91C_UDPHS_DMA_2_DMAADDRESS ((AT91_REG *) 	0x400A4324) // (UDPHS_DMA_2) UDPHS DMA Channel Address Register
// ========== Register definition for UDPHS_DMA_3 peripheral ========== 
#define AT91C_UDPHS_DMA_3_DMACONTROL ((AT91_REG *) 	0x400A4338) // (UDPHS_DMA_3) UDPHS DMA Channel Control Register
#define AT91C_UDPHS_DMA_3_DMANXTDSC ((AT91_REG *) 	0x400A4330) // (UDPHS_DMA_3) UDPHS DMA Channel Next Descriptor Address
#define AT91C_UDPHS_DMA_3_DMASTATUS ((AT91_REG *) 	0x400A433C) // (UDPHS_DMA_3) UDPHS DMA Channel Status Register
#define AT91C_UDPHS_DMA_3_DMAADDRESS ((AT91_REG *) 	0x400A4334) // (UDPHS_DMA_3) UDPHS DMA Channel Address Register
// ========== Register definition for UDPHS_DMA_4 peripheral ========== 
#define AT91C_UDPHS_DMA_4_DMAADDRESS ((AT91_REG *) 	0x400A4344) // (UDPHS_DMA_4) UDPHS DMA Channel Address Register
#define AT91C_UDPHS_DMA_4_DMANXTDSC ((AT91_REG *) 	0x400A4340) // (UDPHS_DMA_4) UDPHS DMA Channel Next Descriptor Address
#define AT91C_UDPHS_DMA_4_DMASTATUS ((AT91_REG *) 	0x400A434C) // (UDPHS_DMA_4) UDPHS DMA Channel Status Register
#define AT91C_UDPHS_DMA_4_DMACONTROL ((AT91_REG *) 	0x400A4348) // (UDPHS_DMA_4) UDPHS DMA Channel Control Register
// ========== Register definition for UDPHS_DMA_5 peripheral ========== 
#define AT91C_UDPHS_DMA_5_DMACONTROL ((AT91_REG *) 	0x400A4358) // (UDPHS_DMA_5) UDPHS DMA Channel Control Register
#define AT91C_UDPHS_DMA_5_DMAADDRESS ((AT91_REG *) 	0x400A4354) // (UDPHS_DMA_5) UDPHS DMA Channel Address Register
#define AT91C_UDPHS_DMA_5_DMANXTDSC ((AT91_REG *) 	0x400A4350) // (UDPHS_DMA_5) UDPHS DMA Channel Next Descriptor Address
#define AT91C_UDPHS_DMA_5_DMASTATUS ((AT91_REG *) 	0x400A435C) // (UDPHS_DMA_5) UDPHS DMA Channel Status Register
// ========== Register definition for UDPHS_DMA_6 peripheral ========== 
#define AT91C_UDPHS_DMA_6_DMASTATUS ((AT91_REG *) 	0x400A436C) // (UDPHS_DMA_6) UDPHS DMA Channel Status Register
#define AT91C_UDPHS_DMA_6_DMACONTROL ((AT91_REG *) 	0x400A4368) // (UDPHS_DMA_6) UDPHS DMA Channel Control Register
#define AT91C_UDPHS_DMA_6_DMANXTDSC ((AT91_REG *) 	0x400A4360) // (UDPHS_DMA_6) UDPHS DMA Channel Next Descriptor Address
#define AT91C_UDPHS_DMA_6_DMAADDRESS ((AT91_REG *) 	0x400A4364) // (UDPHS_DMA_6) UDPHS DMA Channel Address Register
// ========== Register definition for UDPHS peripheral ========== 
#define AT91C_UDPHS_EPTRST ((AT91_REG *) 	0x400A401C) // (UDPHS) UDPHS Endpoints Reset Register
#define AT91C_UDPHS_IEN ((AT91_REG *) 	0x400A4010) // (UDPHS) UDPHS Interrupt Enable Register
#define AT91C_UDPHS_TSTCNTB ((AT91_REG *) 	0x400A40D8) // (UDPHS) UDPHS Test B Counter Register
#define AT91C_UDPHS_RIPNAME2 ((AT91_REG *) 	0x400A40F4) // (UDPHS) UDPHS Name2 Register
#define AT91C_UDPHS_RIPPADDRSIZE ((AT91_REG *) 	0x400A40EC) // (UDPHS) UDPHS PADDRSIZE Register
#define AT91C_UDPHS_TSTMODREG ((AT91_REG *) 	0x400A40DC) // (UDPHS) UDPHS Test Mode Register
#define AT91C_UDPHS_TST ((AT91_REG *) 	0x400A40E0) // (UDPHS) UDPHS Test Register
#define AT91C_UDPHS_TSTSOFCNT ((AT91_REG *) 	0x400A40D0) // (UDPHS) UDPHS Test SOF Counter Register
#define AT91C_UDPHS_FNUM ((AT91_REG *) 	0x400A4004) // (UDPHS) UDPHS Frame Number Register
#define AT91C_UDPHS_TSTCNTA ((AT91_REG *) 	0x400A40D4) // (UDPHS) UDPHS Test A Counter Register
#define AT91C_UDPHS_INTSTA ((AT91_REG *) 	0x400A4014) // (UDPHS) UDPHS Interrupt Status Register
#define AT91C_UDPHS_IPFEATURES ((AT91_REG *) 	0x400A40F8) // (UDPHS) UDPHS Features Register
#define AT91C_UDPHS_CLRINT ((AT91_REG *) 	0x400A4018) // (UDPHS) UDPHS Clear Interrupt Register
#define AT91C_UDPHS_RIPNAME1 ((AT91_REG *) 	0x400A40F0) // (UDPHS) UDPHS Name1 Register
#define AT91C_UDPHS_CTRL ((AT91_REG *) 	0x400A4000) // (UDPHS) UDPHS Control Register
#define AT91C_UDPHS_IPVERSION ((AT91_REG *) 	0x400A40FC) // (UDPHS) UDPHS Version Register
// ========== Register definition for HDMA_CH_0 peripheral ========== 
#define AT91C_HDMA_CH_0_SADDR ((AT91_REG *) 	0x400B003C) // (HDMA_CH_0) HDMA Channel Source Address Register
#define AT91C_HDMA_CH_0_DADDR ((AT91_REG *) 	0x400B0040) // (HDMA_CH_0) HDMA Channel Destination Address Register
#define AT91C_HDMA_CH_0_CFG ((AT91_REG *) 	0x400B0050) // (HDMA_CH_0) HDMA Channel Configuration Register
#define AT91C_HDMA_CH_0_CTRLB ((AT91_REG *) 	0x400B004C) // (HDMA_CH_0) HDMA Channel Control B Register
#define AT91C_HDMA_CH_0_CTRLA ((AT91_REG *) 	0x400B0048) // (HDMA_CH_0) HDMA Channel Control A Register
#define AT91C_HDMA_CH_0_DSCR ((AT91_REG *) 	0x400B0044) // (HDMA_CH_0) HDMA Channel Descriptor Address Register
// ========== Register definition for HDMA_CH_1 peripheral ========== 
#define AT91C_HDMA_CH_1_DSCR ((AT91_REG *) 	0x400B006C) // (HDMA_CH_1) HDMA Channel Descriptor Address Register
#define AT91C_HDMA_CH_1_CTRLB ((AT91_REG *) 	0x400B0074) // (HDMA_CH_1) HDMA Channel Control B Register
#define AT91C_HDMA_CH_1_SADDR ((AT91_REG *) 	0x400B0064) // (HDMA_CH_1) HDMA Channel Source Address Register
#define AT91C_HDMA_CH_1_CFG ((AT91_REG *) 	0x400B0078) // (HDMA_CH_1) HDMA Channel Configuration Register
#define AT91C_HDMA_CH_1_DADDR ((AT91_REG *) 	0x400B0068) // (HDMA_CH_1) HDMA Channel Destination Address Register
#define AT91C_HDMA_CH_1_CTRLA ((AT91_REG *) 	0x400B0070) // (HDMA_CH_1) HDMA Channel Control A Register
// ========== Register definition for HDMA_CH_2 peripheral ========== 
#define AT91C_HDMA_CH_2_CTRLA ((AT91_REG *) 	0x400B0098) // (HDMA_CH_2) HDMA Channel Control A Register
#define AT91C_HDMA_CH_2_SADDR ((AT91_REG *) 	0x400B008C) // (HDMA_CH_2) HDMA Channel Source Address Register
#define AT91C_HDMA_CH_2_CTRLB ((AT91_REG *) 	0x400B009C) // (HDMA_CH_2) HDMA Channel Control B Register
#define AT91C_HDMA_CH_2_DADDR ((AT91_REG *) 	0x400B0090) // (HDMA_CH_2) HDMA Channel Destination Address Register
#define AT91C_HDMA_CH_2_CFG ((AT91_REG *) 	0x400B00A0) // (HDMA_CH_2) HDMA Channel Configuration Register
