una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u4.h
#define AT91C_HDMA_CH_2_DSCR ((AT91_REG *) 	0x400B0094) // (HDMA_CH_2) HDMA Channel Descriptor Address Register
// ========== Register definition for HDMA_CH_3 peripheral ========== 
#define AT91C_HDMA_CH_3_DSCR ((AT91_REG *) 	0x400B00BC) // (HDMA_CH_3) HDMA Channel Descriptor Address Register
#define AT91C_HDMA_CH_3_SADDR ((AT91_REG *) 	0x400B00B4) // (HDMA_CH_3) HDMA Channel Source Address Register
#define AT91C_HDMA_CH_3_CTRLB ((AT91_REG *) 	0x400B00C4) // (HDMA_CH_3) HDMA Channel Control B Register
#define AT91C_HDMA_CH_3_CFG ((AT91_REG *) 	0x400B00C8) // (HDMA_CH_3) HDMA Channel Configuration Register
#define AT91C_HDMA_CH_3_DADDR ((AT91_REG *) 	0x400B00B8) // (HDMA_CH_3) HDMA Channel Destination Address Register
#define AT91C_HDMA_CH_3_CTRLA ((AT91_REG *) 	0x400B00C0) // (HDMA_CH_3) HDMA Channel Control A Register
// ========== Register definition for HDMA peripheral ========== 
#define AT91C_HDMA_VER  ((AT91_REG *) 	0x400B01FC) // (HDMA) HDMA VERSION REGISTER 
#define AT91C_HDMA_CHSR ((AT91_REG *) 	0x400B0030) // (HDMA) HDMA Channel Handler Status Register
#define AT91C_HDMA_IPNAME2 ((AT91_REG *) 	0x400B01F4) // (HDMA) HDMA IPNAME2 REGISTER 
#define AT91C_HDMA_EBCIMR ((AT91_REG *) 	0x400B0020) // (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register
#define AT91C_HDMA_CHDR ((AT91_REG *) 	0x400B002C) // (HDMA) HDMA Channel Handler Disable Register
#define AT91C_HDMA_EN   ((AT91_REG *) 	0x400B0004) // (HDMA) HDMA Controller Enable Register
#define AT91C_HDMA_GCFG ((AT91_REG *) 	0x400B0000) // (HDMA) HDMA Global Configuration Register
#define AT91C_HDMA_IPNAME1 ((AT91_REG *) 	0x400B01F0) // (HDMA) HDMA IPNAME1 REGISTER 
#define AT91C_HDMA_LAST ((AT91_REG *) 	0x400B0010) // (HDMA) HDMA Software Last Transfer Flag Register
#define AT91C_HDMA_FEATURES ((AT91_REG *) 	0x400B01F8) // (HDMA) HDMA FEATURES REGISTER 
#define AT91C_HDMA_CREQ ((AT91_REG *) 	0x400B000C) // (HDMA) HDMA Software Chunk Transfer Request Register
#define AT91C_HDMA_EBCIER ((AT91_REG *) 	0x400B0018) // (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register
#define AT91C_HDMA_CHER ((AT91_REG *) 	0x400B0028) // (HDMA) HDMA Channel Handler Enable Register
#define AT91C_HDMA_ADDRSIZE ((AT91_REG *) 	0x400B01EC) // (HDMA) HDMA ADDRSIZE REGISTER 
#define AT91C_HDMA_EBCISR ((AT91_REG *) 	0x400B0024) // (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register
#define AT91C_HDMA_SREQ ((AT91_REG *) 	0x400B0008) // (HDMA) HDMA Software Single Request Register
#define AT91C_HDMA_EBCIDR ((AT91_REG *) 	0x400B001C) // (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register

// *****************************************************************************
//               PIO DEFINITIONS FOR AT91SAM3U4
// *****************************************************************************
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) // Pin Controlled by PA0
#define AT91C_PA0_TIOB0    ((unsigned int) AT91C_PIO_PA0) //  
#define AT91C_PA0_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA0) //  
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) // Pin Controlled by PA1
#define AT91C_PA1_TIOA0    ((unsigned int) AT91C_PIO_PA1) //  
#define AT91C_PA1_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PA1) //  
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) // Pin Controlled by PA10
#define AT91C_PA10_TWCK0    ((unsigned int) AT91C_PIO_PA10) //  
#define AT91C_PA10_PWML3    ((unsigned int) AT91C_PIO_PA10) //  
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) // Pin Controlled by PA11
#define AT91C_PA11_DRXD     ((unsigned int) AT91C_PIO_PA11) //  
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) // Pin Controlled by PA12
#define AT91C_PA12_DTXD     ((unsigned int) AT91C_PIO_PA12) //  
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) // Pin Controlled by PA13
#define AT91C_PA13_SPI0_MISO ((unsigned int) AT91C_PIO_PA13) //  
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) // Pin Controlled by PA14
#define AT91C_PA14_SPI0_MOSI ((unsigned int) AT91C_PIO_PA14) //  
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) // Pin Controlled by PA15
#define AT91C_PA15_SPI0_SPCK ((unsigned int) AT91C_PIO_PA15) //  
#define AT91C_PA15_PWMH2    ((unsigned int) AT91C_PIO_PA15) //  
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) // Pin Controlled by PA16
#define AT91C_PA16_SPI0_NPCS0 ((unsigned int) AT91C_PIO_PA16) //  
#define AT91C_PA16_NCS1     ((unsigned int) AT91C_PIO_PA16) //  
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) // Pin Controlled by PA17
#define AT91C_PA17_SCK0     ((unsigned int) AT91C_PIO_PA17) //  
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) // Pin Controlled by PA18
#define AT91C_PA18_TXD0     ((unsigned int) AT91C_PIO_PA18) //  
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) // Pin Controlled by PA19
#define AT91C_PA19_RXD0     ((unsigned int) AT91C_PIO_PA19) //  
#define AT91C_PA19_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PA19) //  
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) // Pin Controlled by PA2
#define AT91C_PA2_TCLK0    ((unsigned int) AT91C_PIO_PA2) //  
#define AT91C_PA2_ADTRG1   ((unsigned int) AT91C_PIO_PA2) //  
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) // Pin Controlled by PA20
#define AT91C_PA20_TXD1     ((unsigned int) AT91C_PIO_PA20) //  
#define AT91C_PA20_PWMH3    ((unsigned int) AT91C_PIO_PA20) //  
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) // Pin Controlled by PA21
#define AT91C_PA21_RXD1     ((unsigned int) AT91C_PIO_PA21) //  
#define AT91C_PA21_PCK0     ((unsigned int) AT91C_PIO_PA21) //  
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) // Pin Controlled by PA22
#define AT91C_PA22_TXD2     ((unsigned int) AT91C_PIO_PA22) //  
#define AT91C_PA22_RTS1     ((unsigned int) AT91C_PIO_PA22) //  
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) // Pin Controlled by PA23
#define AT91C_PA23_RXD2     ((unsigned int) AT91C_PIO_PA23) //  
#define AT91C_PA23_CTS1     ((unsigned int) AT91C_PIO_PA23) //  
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) // Pin Controlled by PA24
#define AT91C_PA24_TWD1     ((unsigned int) AT91C_PIO_PA24) //  
#define AT91C_PA24_SCK1     ((unsigned int) AT91C_PIO_PA24) //  
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) // Pin Controlled by PA25
#define AT91C_PA25_TWCK1    ((unsigned int) AT91C_PIO_PA25) //  
#define AT91C_PA25_SCK2     ((unsigned int) AT91C_PIO_PA25) //  
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) // Pin Controlled by PA26
#define AT91C_PA26_TD0      ((unsigned int) AT91C_PIO_PA26) //  
#define AT91C_PA26_TCLK2    ((unsigned int) AT91C_PIO_PA26) //  
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) // Pin Controlled by PA27
#define AT91C_PA27_RD0      ((unsigned int) AT91C_PIO_PA27) //  
#define AT91C_PA27_PCK0     ((unsigned int) AT91C_PIO_PA27) //  
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) // Pin Controlled by PA28
#define AT91C_PA28_TK0      ((unsigned int) AT91C_PIO_PA28) //  
#define AT91C_PA28_PWMH0    ((unsigned int) AT91C_PIO_PA28) //  
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) // Pin Controlled by PA29
#define AT91C_PA29_RK0      ((unsigned int) AT91C_PIO_PA29) //  
#define AT91C_PA29_PWMH1    ((unsigned int) AT91C_PIO_PA29) //  
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) // Pin Controlled by PA3
#define AT91C_PA3_MCI0_CK  ((unsigned int) AT91C_PIO_PA3) //  
#define AT91C_PA3_PCK1     ((unsigned int) AT91C_PIO_PA3) //  
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) // Pin Controlled by PA30
#define AT91C_PA30_TF0      ((unsigned int) AT91C_PIO_PA30) //  
#define AT91C_PA30_TIOA2    ((unsigned int) AT91C_PIO_PA30) //  
#define AT91C_PIO_PA31       ((unsigned int) 1 << 31) // Pin Controlled by PA31
#define AT91C_PA31_RF0      ((unsigned int) AT91C_PIO_PA31) //  
#define AT91C_PA31_TIOB2    ((unsigned int) AT91C_PIO_PA31) //  
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) // Pin Controlled by PA4
#define AT91C_PA4_MCI0_CDA ((unsigned int) AT91C_PIO_PA4) //  
#define AT91C_PA4_PWMH0    ((unsigned int) AT91C_PIO_PA4) //  
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) // Pin Controlled by PA5
#define AT91C_PA5_MCI0_DA0 ((unsigned int) AT91C_PIO_PA5) //  
#define AT91C_PA5_PWMH1    ((unsigned int) AT91C_PIO_PA5) //  
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) // Pin Controlled by PA6
#define AT91C_PA6_MCI0_DA1 ((unsigned int) AT91C_PIO_PA6) //  
#define AT91C_PA6_PWMH2    ((unsigned int) AT91C_PIO_PA6) //  
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) // Pin Controlled by PA7
#define AT91C_PA7_MCI0_DA2 ((unsigned int) AT91C_PIO_PA7) //  
#define AT91C_PA7_PWML0    ((unsigned int) AT91C_PIO_PA7) //  
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) // Pin Controlled by PA8
#define AT91C_PA8_MCI0_DA3 ((unsigned int) AT91C_PIO_PA8) //  
#define AT91C_PA8_PWML1    ((unsigned int) AT91C_PIO_PA8) //  
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) // Pin Controlled by PA9
#define AT91C_PA9_TWD0     ((unsigned int) AT91C_PIO_PA9) //  
#define AT91C_PA9_PWML2    ((unsigned int) AT91C_PIO_PA9) //  
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) // Pin Controlled by PB0
#define AT91C_PB0_PWMH0    ((unsigned int) AT91C_PIO_PB0) //  
#define AT91C_PB0_A2       ((unsigned int) AT91C_PIO_PB0) //  
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) // Pin Controlled by PB1
#define AT91C_PB1_PWMH1    ((unsigned int) AT91C_PIO_PB1) //  
#define AT91C_PB1_A3       ((unsigned int) AT91C_PIO_PB1) //  
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) // Pin Controlled by PB10
#define AT91C_PB10_D1       ((unsigned int) AT91C_PIO_PB10) //  
#define AT91C_PB10_DSR0     ((unsigned int) AT91C_PIO_PB10) //  
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) // Pin Controlled by PB11
#define AT91C_PB11_D2       ((unsigned int) AT91C_PIO_PB11) //  
#define AT91C_PB11_DCD0     ((unsigned int) AT91C_PIO_PB11) //  
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) // Pin Controlled by PB12
#define AT91C_PB12_D3       ((unsigned int) AT91C_PIO_PB12) //  
#define AT91C_PB12_RI0      ((unsigned int) AT91C_PIO_PB12) //  
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) // Pin Controlled by PB13
#define AT91C_PB13_D4       ((unsigned int) AT91C_PIO_PB13) //  
#define AT91C_PB13_PWMH0    ((unsigned int) AT91C_PIO_PB13) //  
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) // Pin Controlled by PB14
#define AT91C_PB14_D5       ((unsigned int) AT91C_PIO_PB14) //  
#define AT91C_PB14_PWMH1    ((unsigned int) AT91C_PIO_PB14) //  
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) // Pin Controlled by PB15
#define AT91C_PB15_D6       ((unsigned int) AT91C_PIO_PB15) //  
#define AT91C_PB15_PWMH2    ((unsigned int) AT91C_PIO_PB15) //  
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) // Pin Controlled by PB16
#define AT91C_PB16_D7       ((unsigned int) AT91C_PIO_PB16) //  
#define AT91C_PB16_PWMH3    ((unsigned int) AT91C_PIO_PB16) //  
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) // Pin Controlled by PB17
#define AT91C_PB17_NANDOE   ((unsigned int) AT91C_PIO_PB17) //  
#define AT91C_PB17_PWML0    ((unsigned int) AT91C_PIO_PB17) //  
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) // Pin Controlled by PB18
#define AT91C_PB18_NANDWE   ((unsigned int) AT91C_PIO_PB18) //  
#define AT91C_PB18_PWML1    ((unsigned int) AT91C_PIO_PB18) //  
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) // Pin Controlled by PB19
#define AT91C_PB19_NRD      ((unsigned int) AT91C_PIO_PB19) //  
#define AT91C_PB19_PWML2    ((unsigned int) AT91C_PIO_PB19) //  
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) // Pin Controlled by PB2
#define AT91C_PB2_PWMH2    ((unsigned int) AT91C_PIO_PB2) //  
#define AT91C_PB2_A4       ((unsigned int) AT91C_PIO_PB2) //  
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) // Pin Controlled by PB20
#define AT91C_PB20_NCS0     ((unsigned int) AT91C_PIO_PB20) //  
#define AT91C_PB20_PWML3    ((unsigned int) AT91C_PIO_PB20) //  
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) // Pin Controlled by PB21
#define AT91C_PB21_A21_NANDALE ((unsigned int) AT91C_PIO_PB21) //  
#define AT91C_PB21_RTS2     ((unsigned int) AT91C_PIO_PB21) //  
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) // Pin Controlled by PB22
#define AT91C_PB22_A22_NANDCLE ((unsigned int) AT91C_PIO_PB22) //  
#define AT91C_PB22_CTS2     ((unsigned int) AT91C_PIO_PB22) //  
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) // Pin Controlled by PB23
#define AT91C_PB23_NWR0_NWE ((unsigned int) AT91C_PIO_PB23) //  
#define AT91C_PB23_PCK2     ((unsigned int) AT91C_PIO_PB23) //  
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) // Pin Controlled by PB24
#define AT91C_PB24_NANDRDY  ((unsigned int) AT91C_PIO_PB24) //  
#define AT91C_PB24_PCK1     ((unsigned int) AT91C_PIO_PB24) //  
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) // Pin Controlled by PB25
#define AT91C_PB25_D8       ((unsigned int) AT91C_PIO_PB25) //  
#define AT91C_PB25_PWML0    ((unsigned int) AT91C_PIO_PB25) //  
#define AT91C_PIO_PB26       ((unsigned int) 1 << 26) // Pin Controlled by PB26
#define AT91C_PB26_D9       ((unsigned int) AT91C_PIO_PB26) //  
#define AT91C_PB26_PWML1    ((unsigned int) AT91C_PIO_PB26) //  
#define AT91C_PIO_PB27       ((unsigned int) 1 << 27) // Pin Controlled by PB27
#define AT91C_PB27_D10      ((unsigned int) AT91C_PIO_PB27) //  
#define AT91C_PB27_PWML2    ((unsigned int) AT91C_PIO_PB27) //  
#define AT91C_PIO_PB28       ((unsigned int) 1 << 28) // Pin Controlled by PB28
#define AT91C_PB28_D11      ((unsigned int) AT91C_PIO_PB28) //  
#define AT91C_PB28_PWML3    ((unsigned int) AT91C_PIO_PB28) //  
#define AT91C_PIO_PB29       ((unsigned int) 1 << 29) // Pin Controlled by PB29
#define AT91C_PB29_D12      ((unsigned int) AT91C_PIO_PB29) //  
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) // Pin Controlled by PB3
#define AT91C_PB3_PWMH3    ((unsigned int) AT91C_PIO_PB3) //  
#define AT91C_PB3_A5       ((unsigned int) AT91C_PIO_PB3) //  
#define AT91C_PIO_PB30       ((unsigned int) 1 << 30) // Pin Controlled by PB30
#define AT91C_PB30_D13      ((unsigned int) AT91C_PIO_PB30) //  
#define AT91C_PIO_PB31       ((unsigned int) 1 << 31) // Pin Controlled by PB31
#define AT91C_PB31_D14      ((unsigned int) AT91C_PIO_PB31) //  
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) // Pin Controlled by PB4
#define AT91C_PB4_TCLK1    ((unsigned int) AT91C_PIO_PB4) //  
#define AT91C_PB4_A6       ((unsigned int) AT91C_PIO_PB4) //  
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) // Pin Controlled by PB5
#define AT91C_PB5_TIOA1    ((unsigned int) AT91C_PIO_PB5) //  
#define AT91C_PB5_A7       ((unsigned int) AT91C_PIO_PB5) //  
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) // Pin Controlled by PB6
#define AT91C_PB6_TIOB1    ((unsigned int) AT91C_PIO_PB6) //  
#define AT91C_PB6_D15      ((unsigned int) AT91C_PIO_PB6) //  
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) // Pin Controlled by PB7
#define AT91C_PB7_RTS0     ((unsigned int) AT91C_PIO_PB7) //  
#define AT91C_PB7_A0_NBS0  ((unsigned int) AT91C_PIO_PB7) //  
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) // Pin Controlled by PB8
#define AT91C_PB8_CTS0     ((unsigned int) AT91C_PIO_PB8) //  
#define AT91C_PB8_A1       ((unsigned int) AT91C_PIO_PB8) //  
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) // Pin Controlled by PB9
#define AT91C_PB9_D0       ((unsigned int) AT91C_PIO_PB9) //  
#define AT91C_PB9_DTR0     ((unsigned int) AT91C_PIO_PB9) //  
#define AT91C_PIO_PC0        ((unsigned int) 1 <<  0) // Pin Controlled by PC0
#define AT91C_PC0_A2       ((unsigned int) AT91C_PIO_PC0) //  
#define AT91C_PIO_PC1        ((unsigned int) 1 <<  1) // Pin Controlled by PC1
#define AT91C_PC1_A3       ((unsigned int) AT91C_PIO_PC1) //  
#define AT91C_PIO_PC10       ((unsigned int) 1 << 10) // Pin Controlled by PC10
#define AT91C_PC10_A12      ((unsigned int) AT91C_PIO_PC10) //  
#define AT91C_PC10_CTS3     ((unsigned int) AT91C_PIO_PC10) //  
#define AT91C_PIO_PC11       ((unsigned int) 1 << 11) // Pin Controlled by PC11
#define AT91C_PC11_A13      ((unsigned int) AT91C_PIO_PC11) //  
#define AT91C_PC11_RTS3     ((unsigned int) AT91C_PIO_PC11) //  
#define AT91C_PIO_PC12       ((unsigned int) 1 << 12) // Pin Controlled by PC12
#define AT91C_PC12_NCS1     ((unsigned int) AT91C_PIO_PC12) //  
#define AT91C_PC12_TXD3     ((unsigned int) AT91C_PIO_PC12) //  
#define AT91C_PIO_PC13       ((unsigned int) 1 << 13) // Pin Controlled by PC13
#define AT91C_PC13_A2       ((unsigned int) AT91C_PIO_PC13) //  
#define AT91C_PC13_RXD3     ((unsigned int) AT91C_PIO_PC13) //  
#define AT91C_PIO_PC14       ((unsigned int) 1 << 14) // Pin Controlled by PC14
#define AT91C_PC14_A3       ((unsigned int) AT91C_PIO_PC14) //  
#define AT91C_PC14_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PC14) //  
#define AT91C_PIO_PC15       ((unsigned int) 1 << 15) // Pin Controlled by PC15
#define AT91C_PC15_NWR1_NBS1 ((unsigned int) AT91C_PIO_PC15) //  
#define AT91C_PIO_PC16       ((unsigned int) 1 << 16) // Pin Controlled by PC16
#define AT91C_PC16_NCS2     ((unsigned int) AT91C_PIO_PC16) //  
#define AT91C_PC16_PWML3    ((unsigned int) AT91C_PIO_PC16) //  
#define AT91C_PIO_PC17       ((unsigned int) 1 << 17) // Pin Controlled by PC17
#define AT91C_PC17_NCS3     ((unsigned int) AT91C_PIO_PC17) //  
#define AT91C_PC17_A24      ((unsigned int) AT91C_PIO_PC17) //  
#define AT91C_PIO_PC18       ((unsigned int) 1 << 18) // Pin Controlled by PC18
#define AT91C_PC18_NWAIT    ((unsigned int) AT91C_PIO_PC18) //  
#define AT91C_PIO_PC19       ((unsigned int) 1 << 19) // Pin Controlled by PC19
#define AT91C_PC19_SCK3     ((unsigned int) AT91C_PIO_PC19) //  
#define AT91C_PC19_NPCS1    ((unsigned int) AT91C_PIO_PC19) //  
#define AT91C_PIO_PC2        ((unsigned int) 1 <<  2) // Pin Controlled by PC2
#define AT91C_PC2_A4       ((unsigned int) AT91C_PIO_PC2) //  
#define AT91C_PIO_PC20       ((unsigned int) 1 << 20) // Pin Controlled by PC20
#define AT91C_PC20_A14      ((unsigned int) AT91C_PIO_PC20) //  
#define AT91C_PIO_PC21       ((unsigned int) 1 << 21) // Pin Controlled by PC21
#define AT91C_PC21_A15      ((unsigned int) AT91C_PIO_PC21) //  
#define AT91C_PIO_PC22       ((unsigned int) 1 << 22) // Pin Controlled by PC22
#define AT91C_PC22_A16      ((unsigned int) AT91C_PIO_PC22) //  
#define AT91C_PIO_PC23       ((unsigned int) 1 << 23) // Pin Controlled by PC23
#define AT91C_PC23_A17      ((unsigned int) AT91C_PIO_PC23) //  
#define AT91C_PIO_PC24       ((unsigned int) 1 << 24) // Pin Controlled by PC24
#define AT91C_PC24_A18      ((unsigned int) AT91C_PIO_PC24) //  
#define AT91C_PC24_PWMH0    ((unsigned int) AT91C_PIO_PC24) //  
#define AT91C_PIO_PC25       ((unsigned int) 1 << 25) // Pin Controlled by PC25
#define AT91C_PC25_A19      ((unsigned int) AT91C_PIO_PC25) //  
#define AT91C_PC25_PWMH1    ((unsigned int) AT91C_PIO_PC25) //  
#define AT91C_PIO_PC26       ((unsigned int) 1 << 26) // Pin Controlled by PC26
#define AT91C_PC26_A20      ((unsigned int) AT91C_PIO_PC26) //  
#define AT91C_PC26_PWMH2    ((unsigned int) AT91C_PIO_PC26) //  
#define AT91C_PIO_PC27       ((unsigned int) 1 << 27) // Pin Controlled by PC27
#define AT91C_PC27_A23      ((unsigned int) AT91C_PIO_PC27) //  
#define AT91C_PC27_PWMH3    ((unsigned int) AT91C_PIO_PC27) //  
#define AT91C_PIO_PC28       ((unsigned int) 1 << 28) // Pin Controlled by PC28
#define AT91C_PC28_A24      ((unsigned int) AT91C_PIO_PC28) //  
#define AT91C_PC28_MCI0_DA4 ((unsigned int) AT91C_PIO_PC28) //  
#define AT91C_PIO_PC29       ((unsigned int) 1 << 29) // Pin Controlled by PC29
#define AT91C_PC29_PWML0    ((unsigned int) AT91C_PIO_PC29) //  
#define AT91C_PC29_MCI0_DA5 ((unsigned int) AT91C_PIO_PC29) //  
#define AT91C_PIO_PC3        ((unsigned int) 1 <<  3) // Pin Controlled by PC3
#define AT91C_PC3_A5       ((unsigned int) AT91C_PIO_PC3) //  
#define AT91C_PC3_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PC3) //  
#define AT91C_PIO_PC30       ((unsigned int) 1 << 30) // Pin Controlled by PC30
#define AT91C_PC30_PWML1    ((unsigned int) AT91C_PIO_PC30) //  
#define AT91C_PC30_MCI0_DA6 ((unsigned int) AT91C_PIO_PC30) //  
#define AT91C_PIO_PC31       ((unsigned int) 1 << 31) // Pin Controlled by PC31
#define AT91C_PC31_PWML2    ((unsigned int) AT91C_PIO_PC31) //  
#define AT91C_PC31_MCI0_DA7 ((unsigned int) AT91C_PIO_PC31) //  
#define AT91C_PIO_PC4        ((unsigned int) 1 <<  4) // Pin Controlled by PC4
#define AT91C_PC4_A6       ((unsigned int) AT91C_PIO_PC4) //  
#define AT91C_PC4_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PC4) //  
#define AT91C_PIO_PC5        ((unsigned int) 1 <<  5) // Pin Controlled by PC5
#define AT91C_PC5_A7       ((unsigned int) AT91C_PIO_PC5) //  
#define AT91C_PC5_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PC5) //  
#define AT91C_PIO_PC6        ((unsigned int) 1 <<  6) // Pin Controlled by PC6
#define AT91C_PC6_A8       ((unsigned int) AT91C_PIO_PC6) //  
#define AT91C_PC6_PWML0    ((unsigned int) AT91C_PIO_PC6) //  
#define AT91C_PIO_PC7        ((unsigned int) 1 <<  7) // Pin Controlled by PC7
#define AT91C_PC7_A9       ((unsigned int) AT91C_PIO_PC7) //  
#define AT91C_PC7_PWML1    ((unsigned int) AT91C_PIO_PC7) //  
#define AT91C_PIO_PC8        ((unsigned int) 1 <<  8) // Pin Controlled by PC8
#define AT91C_PC8_A10      ((unsigned int) AT91C_PIO_PC8) //  
#define AT91C_PC8_PWML2    ((unsigned int) AT91C_PIO_PC8) //  
#define AT91C_PIO_PC9        ((unsigned int) 1 <<  9) // Pin Controlled by PC9
#define AT91C_PC9_A11      ((unsigned int) AT91C_PIO_PC9) //  
#define AT91C_PC9_PWML3    ((unsigned int) AT91C_PIO_PC9) //  

