una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u4.h
// *****************************************************************************
//               PERIPHERAL ID DEFINITIONS FOR AT91SAM3U4
// *****************************************************************************
#define AT91C_ID_SUPC   ((unsigned int)  0) // SUPPLY CONTROLLER
#define AT91C_ID_RSTC   ((unsigned int)  1) // RESET CONTROLLER
#define AT91C_ID_RTC    ((unsigned int)  2) // REAL TIME CLOCK
#define AT91C_ID_RTT    ((unsigned int)  3) // REAL TIME TIMER
#define AT91C_ID_WDG    ((unsigned int)  4) // WATCHDOG TIMER
#define AT91C_ID_PMC    ((unsigned int)  5) // PMC
#define AT91C_ID_EFC0   ((unsigned int)  6) // EFC0
#define AT91C_ID_EFC1   ((unsigned int)  7) // EFC1
#define AT91C_ID_DBGU   ((unsigned int)  8) // DBGU
#define AT91C_ID_HSMC4  ((unsigned int)  9) // HSMC4
#define AT91C_ID_PIOA   ((unsigned int) 10) // Parallel IO Controller A
#define AT91C_ID_PIOB   ((unsigned int) 11) // Parallel IO Controller B
#define AT91C_ID_PIOC   ((unsigned int) 12) // Parallel IO Controller C
#define AT91C_ID_US0    ((unsigned int) 13) // USART 0
#define AT91C_ID_US1    ((unsigned int) 14) // USART 1
#define AT91C_ID_US2    ((unsigned int) 15) // USART 2
#define AT91C_ID_US3    ((unsigned int) 16) // USART 3
#define AT91C_ID_MCI0   ((unsigned int) 17) // Multimedia Card Interface
#define AT91C_ID_TWI0   ((unsigned int) 18) // TWI 0
#define AT91C_ID_TWI1   ((unsigned int) 19) // TWI 1
#define AT91C_ID_SPI0   ((unsigned int) 20) // Serial Peripheral Interface
#define AT91C_ID_SSC0   ((unsigned int) 21) // Serial Synchronous Controller 0
#define AT91C_ID_TC0    ((unsigned int) 22) // Timer Counter 0
#define AT91C_ID_TC1    ((unsigned int) 23) // Timer Counter 1
#define AT91C_ID_TC2    ((unsigned int) 24) // Timer Counter 2
#define AT91C_ID_PWMC   ((unsigned int) 25) // Pulse Width Modulation Controller
#define AT91C_ID_ADC    ((unsigned int) 27) // ADC controller
#define AT91C_ID_HDMA   ((unsigned int) 28) // HDMA
#define AT91C_ID_UDPHS  ((unsigned int) 29) // USB Device High Speed
#define AT91C_ALL_INT   ((unsigned int) 0x3BFFFFFF) // ALL VALID INTERRUPTS

// *****************************************************************************
//               BASE ADDRESS DEFINITIONS FOR AT91SAM3U4
// *****************************************************************************
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0x400E0000) // (SYS) Base Address
#define AT91C_BASE_HSMC4_CS0 ((AT91PS_HSMC4_CS) 	0x400E0070) // (HSMC4_CS0) Base Address
#define AT91C_BASE_HSMC4_CS1 ((AT91PS_HSMC4_CS) 	0x400E0084) // (HSMC4_CS1) Base Address
#define AT91C_BASE_HSMC4_CS2 ((AT91PS_HSMC4_CS) 	0x400E0098) // (HSMC4_CS2) Base Address
#define AT91C_BASE_HSMC4_CS3 ((AT91PS_HSMC4_CS) 	0x400E00AC) // (HSMC4_CS3) Base Address
#define AT91C_BASE_HSMC4_NFC ((AT91PS_HSMC4_CS) 	0x400E00FC) // (HSMC4_NFC) Base Address
#define AT91C_BASE_HSMC4     ((AT91PS_HSMC4) 	0x400E0000) // (HSMC4) Base Address
#define AT91C_BASE_MATRIX    ((AT91PS_HMATRIX2) 	0x400E0200) // (MATRIX) Base Address
#define AT91C_BASE_NVIC      ((AT91PS_NVIC) 	0xE000E000) // (NVIC) Base Address
#define AT91C_BASE_MPU       ((AT91PS_MPU) 	0xE000ED90) // (MPU) Base Address
#define AT91C_BASE_CM3       ((AT91PS_CM3) 	0xE000ED00) // (CM3) Base Address
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0x400E0700) // (PDC_DBGU) Base Address
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0x400E0600) // (DBGU) Base Address
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0x400E0C00) // (PIOA) Base Address
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0x400E0E00) // (PIOB) Base Address
#define AT91C_BASE_PIOC      ((AT91PS_PIO) 	0x400E1000) // (PIOC) Base Address
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0x400E0400) // (PMC) Base Address
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0x400E041C) // (CKGR) Base Address
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0x400E1200) // (RSTC) Base Address
#define AT91C_BASE_SUPC      ((AT91PS_SUPC) 	0x400E1210) // (SUPC) Base Address
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0x400E1230) // (RTTC) Base Address
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0x400E1250) // (WDTC) Base Address
#define AT91C_BASE_RTC       ((AT91PS_RTC) 	0x400E1260) // (RTC) Base Address
#define AT91C_BASE_ADC0      ((AT91PS_ADC) 	0x400AC000) // (ADC0) Base Address
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0x40080000) // (TC0) Base Address
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0x40080040) // (TC1) Base Address
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0x40080080) // (TC2) Base Address
#define AT91C_BASE_TCB0      ((AT91PS_TCB) 	0x40080000) // (TCB0) Base Address
#define AT91C_BASE_TCB1      ((AT91PS_TCB) 	0x40080040) // (TCB1) Base Address
#define AT91C_BASE_TCB2      ((AT91PS_TCB) 	0x40080080) // (TCB2) Base Address
#define AT91C_BASE_EFC0      ((AT91PS_EFC) 	0x400E0800) // (EFC0) Base Address
#define AT91C_BASE_EFC1      ((AT91PS_EFC) 	0x400E0A00) // (EFC1) Base Address
#define AT91C_BASE_MCI0      ((AT91PS_MCI) 	0x40000000) // (MCI0) Base Address
#define AT91C_BASE_PDC_TWI0  ((AT91PS_PDC) 	0x40084100) // (PDC_TWI0) Base Address
#define AT91C_BASE_PDC_TWI1  ((AT91PS_PDC) 	0x40088100) // (PDC_TWI1) Base Address
#define AT91C_BASE_TWI0      ((AT91PS_TWI) 	0x40084000) // (TWI0) Base Address
#define AT91C_BASE_TWI1      ((AT91PS_TWI) 	0x40088000) // (TWI1) Base Address
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0x40090100) // (PDC_US0) Base Address
#define AT91C_BASE_US0       ((AT91PS_USART) 	0x40090000) // (US0) Base Address
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0x40094100) // (PDC_US1) Base Address
#define AT91C_BASE_US1       ((AT91PS_USART) 	0x40094000) // (US1) Base Address
#define AT91C_BASE_PDC_US2   ((AT91PS_PDC) 	0x40098100) // (PDC_US2) Base Address
#define AT91C_BASE_US2       ((AT91PS_USART) 	0x40098000) // (US2) Base Address
#define AT91C_BASE_PDC_US3   ((AT91PS_PDC) 	0x4009C100) // (PDC_US3) Base Address
#define AT91C_BASE_US3       ((AT91PS_USART) 	0x4009C000) // (US3) Base Address
#define AT91C_BASE_PDC_SSC0  ((AT91PS_PDC) 	0x40004100) // (PDC_SSC0) Base Address
#define AT91C_BASE_SSC0      ((AT91PS_SSC) 	0x40004000) // (SSC0) Base Address
#define AT91C_BASE_PDC_PWMC  ((AT91PS_PDC) 	0x4008C100) // (PDC_PWMC) Base Address
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0x4008C200) // (PWMC_CH0) Base Address
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0x4008C220) // (PWMC_CH1) Base Address
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0x4008C240) // (PWMC_CH2) Base Address
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0x4008C260) // (PWMC_CH3) Base Address
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0x4008C000) // (PWMC) Base Address
#define AT91C_BASE_SPI0      ((AT91PS_SPI) 	0x40008000) // (SPI0) Base Address
#define AT91C_BASE_UDPHS_EPTFIFO ((AT91PS_UDPHS_EPTFIFO) 	0x20180000) // (UDPHS_EPTFIFO) Base Address
#define AT91C_BASE_UDPHS_EPT_0 ((AT91PS_UDPHS_EPT) 	0x400A4100) // (UDPHS_EPT_0) Base Address
#define AT91C_BASE_UDPHS_EPT_1 ((AT91PS_UDPHS_EPT) 	0x400A4120) // (UDPHS_EPT_1) Base Address
#define AT91C_BASE_UDPHS_EPT_2 ((AT91PS_UDPHS_EPT) 	0x400A4140) // (UDPHS_EPT_2) Base Address
#define AT91C_BASE_UDPHS_EPT_3 ((AT91PS_UDPHS_EPT) 	0x400A4160) // (UDPHS_EPT_3) Base Address
#define AT91C_BASE_UDPHS_EPT_4 ((AT91PS_UDPHS_EPT) 	0x400A4180) // (UDPHS_EPT_4) Base Address
#define AT91C_BASE_UDPHS_EPT_5 ((AT91PS_UDPHS_EPT) 	0x400A41A0) // (UDPHS_EPT_5) Base Address
#define AT91C_BASE_UDPHS_EPT_6 ((AT91PS_UDPHS_EPT) 	0x400A41C0) // (UDPHS_EPT_6) Base Address
#define AT91C_BASE_UDPHS_DMA_1 ((AT91PS_UDPHS_DMA) 	0x400A4310) // (UDPHS_DMA_1) Base Address
#define AT91C_BASE_UDPHS_DMA_2 ((AT91PS_UDPHS_DMA) 	0x400A4320) // (UDPHS_DMA_2) Base Address
#define AT91C_BASE_UDPHS_DMA_3 ((AT91PS_UDPHS_DMA) 	0x400A4330) // (UDPHS_DMA_3) Base Address
#define AT91C_BASE_UDPHS_DMA_4 ((AT91PS_UDPHS_DMA) 	0x400A4340) // (UDPHS_DMA_4) Base Address
#define AT91C_BASE_UDPHS_DMA_5 ((AT91PS_UDPHS_DMA) 	0x400A4350) // (UDPHS_DMA_5) Base Address
#define AT91C_BASE_UDPHS_DMA_6 ((AT91PS_UDPHS_DMA) 	0x400A4360) // (UDPHS_DMA_6) Base Address
#define AT91C_BASE_UDPHS     ((AT91PS_UDPHS) 	0x400A4000) // (UDPHS) Base Address
#define AT91C_BASE_HDMA_CH_0 ((AT91PS_HDMA_CH) 	0x400B003C) // (HDMA_CH_0) Base Address
#define AT91C_BASE_HDMA_CH_1 ((AT91PS_HDMA_CH) 	0x400B0064) // (HDMA_CH_1) Base Address
#define AT91C_BASE_HDMA_CH_2 ((AT91PS_HDMA_CH) 	0x400B008C) // (HDMA_CH_2) Base Address
#define AT91C_BASE_HDMA_CH_3 ((AT91PS_HDMA_CH) 	0x400B00B4) // (HDMA_CH_3) Base Address
#define AT91C_BASE_HDMA      ((AT91PS_HDMA) 	0x400B0000) // (HDMA) Base Address

// *****************************************************************************
//               MEMORY MAPPING DEFINITIONS FOR AT91SAM3U4
// *****************************************************************************
// ITCM
#define AT91C_ITCM 	 ((char *) 	0x00100000) // Maximum ITCM Area base address
#define AT91C_ITCM_SIZE	 ((unsigned int) 0x00010000) // Maximum ITCM Area size in byte (64 Kbytes)
// DTCM
#define AT91C_DTCM 	 ((char *) 	0x00200000) // Maximum DTCM Area base address
#define AT91C_DTCM_SIZE	 ((unsigned int) 0x00010000) // Maximum DTCM Area size in byte (64 Kbytes)
// IRAM
#define AT91C_IRAM 	 ((char *) 	0x20000000) // Maximum Internal SRAM base address
#define AT91C_IRAM_SIZE	 ((unsigned int) 0x00008000) // Maximum Internal SRAM size in byte (32 Kbytes)
// IRAM_MIN
#define AT91C_IRAM_MIN	 ((char *) 	0x00300000) // Minimum Internal RAM base address
#define AT91C_IRAM_MIN_SIZE	 ((unsigned int) 0x00004000) // Minimum Internal RAM size in byte (16 Kbytes)
// IROM
#define AT91C_IROM 	 ((char *) 	0x00180000) // Internal ROM base address
#define AT91C_IROM_SIZE	 ((unsigned int) 0x00008000) // Internal ROM size in byte (32 Kbytes)
// IFLASH0
#define AT91C_IFLASH0	 ((char *) 	0x00080000) // Maximum IFLASH Area : 128Kbyte base address
#define AT91C_IFLASH0_SIZE	 ((unsigned int) 0x00020000) // Maximum IFLASH Area : 128Kbyte size in byte (128 Kbytes)
#define AT91C_IFLASH0_PAGE_SIZE	 ((unsigned int) 256) // Maximum IFLASH Area : 128Kbyte Page Size: 256 bytes
#define AT91C_IFLASH0_LOCK_REGION_SIZE	 ((unsigned int) 8192) // Maximum IFLASH Area : 128Kbyte Lock Region Size: 8 Kbytes
#define AT91C_IFLASH0_NB_OF_PAGES	 ((unsigned int) 512) // Maximum IFLASH Area : 128Kbyte Number of Pages: 512 bytes
#define AT91C_IFLASH0_NB_OF_LOCK_BITS	 ((unsigned int) 16) // Maximum IFLASH Area : 128Kbyte Number of Lock Bits: 16 bytes
// IFLASH1
#define AT91C_IFLASH1	 ((char *) 	0x00100000) // Maximum IFLASH Area : 128Kbyte base address
#define AT91C_IFLASH1_SIZE	 ((unsigned int) 0x00020000) // Maximum IFLASH Area : 128Kbyte size in byte (128 Kbytes)
#define AT91C_IFLASH1_PAGE_SIZE	 ((unsigned int) 256) // Maximum IFLASH Area : 128Kbyte Page Size: 256 bytes
#define AT91C_IFLASH1_LOCK_REGION_SIZE	 ((unsigned int) 8192) // Maximum IFLASH Area : 128Kbyte Lock Region Size: 8 Kbytes
#define AT91C_IFLASH1_NB_OF_PAGES	 ((unsigned int) 512) // Maximum IFLASH Area : 128Kbyte Number of Pages: 512 bytes
#define AT91C_IFLASH1_NB_OF_LOCK_BITS	 ((unsigned int) 16) // Maximum IFLASH Area : 128Kbyte Number of Lock Bits: 16 bytes
// EBI_CS0
#define AT91C_EBI_CS0	 ((char *) 	0x10000000) // EBI Chip Select 0 base address
#define AT91C_EBI_CS0_SIZE	 ((unsigned int) 0x10000000) // EBI Chip Select 0 size in byte (262144 Kbytes)
// EBI_CS1
#define AT91C_EBI_CS1	 ((char *) 	0x20000000) // EBI Chip Select 1 base address
#define AT91C_EBI_CS1_SIZE	 ((unsigned int) 0x10000000) // EBI Chip Select 1 size in byte (262144 Kbytes)
// EBI_SDRAM
#define AT91C_EBI_SDRAM	 ((char *) 	0x20000000) // SDRAM on EBI Chip Select 1 base address
#define AT91C_EBI_SDRAM_SIZE	 ((unsigned int) 0x10000000) // SDRAM on EBI Chip Select 1 size in byte (262144 Kbytes)
// EBI_SDRAM_16BIT
#define AT91C_EBI_SDRAM_16BIT	 ((char *) 	0x20000000) // SDRAM on EBI Chip Select 1 base address
#define AT91C_EBI_SDRAM_16BIT_SIZE	 ((unsigned int) 0x02000000) // SDRAM on EBI Chip Select 1 size in byte (32768 Kbytes)
// EBI_SDRAM_32BIT
#define AT91C_EBI_SDRAM_32BIT	 ((char *) 	0x20000000) // SDRAM on EBI Chip Select 1 base address
#define AT91C_EBI_SDRAM_32BIT_SIZE	 ((unsigned int) 0x04000000) // SDRAM on EBI Chip Select 1 size in byte (65536 Kbytes)
// EBI_CS2
#define AT91C_EBI_CS2	 ((char *) 	0x30000000) // EBI Chip Select 2 base address
#define AT91C_EBI_CS2_SIZE	 ((unsigned int) 0x10000000) // EBI Chip Select 2 size in byte (262144 Kbytes)
// EBI_CS3
#define AT91C_EBI_CS3	 ((char *) 	0x40000000) // EBI Chip Select 3 base address
#define AT91C_EBI_CS3_SIZE	 ((unsigned int) 0x10000000) // EBI Chip Select 3 size in byte (262144 Kbytes)
// EBI_SM
#define AT91C_EBI_SM	 ((char *) 	0x40000000) // NANDFLASH on EBI Chip Select 3 base address
#define AT91C_EBI_SM_SIZE	 ((unsigned int) 0x10000000) // NANDFLASH on EBI Chip Select 3 size in byte (262144 Kbytes)
// EBI_CS4
#define AT91C_EBI_CS4	 ((char *) 	0x50000000) // EBI Chip Select 4 base address
#define AT91C_EBI_CS4_SIZE	 ((unsigned int) 0x10000000) // EBI Chip Select 4 size in byte (262144 Kbytes)
// EBI_CF0
#define AT91C_EBI_CF0	 ((char *) 	0x50000000) // CompactFlash 0 on EBI Chip Select 4 base address
#define AT91C_EBI_CF0_SIZE	 ((unsigned int) 0x10000000) // CompactFlash 0 on EBI Chip Select 4 size in byte (262144 Kbytes)
// EBI_CS5
#define AT91C_EBI_CS5	 ((char *) 	0x60000000) // EBI Chip Select 5 base address
#define AT91C_EBI_CS5_SIZE	 ((unsigned int) 0x10000000) // EBI Chip Select 5 size in byte (262144 Kbytes)
// EBI_CF1
#define AT91C_EBI_CF1	 ((char *) 	0x60000000) // CompactFlash 1 on EBIChip Select 5 base address
#define AT91C_EBI_CF1_SIZE	 ((unsigned int) 0x10000000) // CompactFlash 1 on EBIChip Select 5 size in byte (262144 Kbytes)
#endif /* __IAR_SYSTEMS_ICC__ */

