una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u4.h
#ifdef __IAR_SYSTEMS_ASM__

// - Hardware register definition

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR System Peripherals
// - *****************************************************************************
// - -------- GPBR : (SYS Offset: 0x1290) GPBR General Purpose Register -------- 
AT91C_GPBR_GPRV           EQU (0x0 <<  0) ;- (SYS) General Purpose Register Value

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR HSMC4 Chip Select interface
// - *****************************************************************************
// - -------- HSMC4_SETUP : (HSMC4_CS Offset: 0x0) HSMC4 SETUP -------- 
AT91C_HSMC4_NWE_SETUP     EQU (0x3F <<  0) ;- (HSMC4_CS) NWE Setup length
AT91C_HSMC4_NCS_WR_SETUP  EQU (0x3F <<  8) ;- (HSMC4_CS) NCS Setup length in Write access
AT91C_HSMC4_NRD_SETUP     EQU (0x3F << 16) ;- (HSMC4_CS) NRD Setup length
AT91C_HSMC4_NCS_RD_SETUP  EQU (0x3F << 24) ;- (HSMC4_CS) NCS Setup legnth in Read access
// - -------- HSMC4_PULSE : (HSMC4_CS Offset: 0x4) HSMC4 PULSE -------- 
AT91C_HSMC4_NWE_PULSE     EQU (0x3F <<  0) ;- (HSMC4_CS) NWE Pulse Length
AT91C_HSMC4_NCS_WR_PULSE  EQU (0x3F <<  8) ;- (HSMC4_CS) NCS Pulse length in WRITE access
AT91C_HSMC4_NRD_PULSE     EQU (0x3F << 16) ;- (HSMC4_CS) NRD Pulse length
AT91C_HSMC4_NCS_RD_PULSE  EQU (0x3F << 24) ;- (HSMC4_CS) NCS Pulse length in READ access
// - -------- HSMC4_CYCLE : (HSMC4_CS Offset: 0x8) HSMC4 CYCLE -------- 
AT91C_HSMC4_NWE_CYCLE     EQU (0x1FF <<  0) ;- (HSMC4_CS) Total Write Cycle Length
AT91C_HSMC4_NRD_CYCLE     EQU (0x1FF << 16) ;- (HSMC4_CS) Total Read Cycle Length
// - -------- HSMC4_TIMINGS : (HSMC4_CS Offset: 0xc) HSMC4 TIMINGS -------- 
AT91C_HSMC4_TCLR          EQU (0xF <<  0) ;- (HSMC4_CS) CLE to REN low delay
AT91C_HSMC4_TADL          EQU (0xF <<  4) ;- (HSMC4_CS) ALE to data start
AT91C_HSMC4_TAR           EQU (0xF <<  8) ;- (HSMC4_CS) ALE to REN low delay
AT91C_HSMC4_OCMSEN        EQU (0x1 << 12) ;- (HSMC4_CS) Off Chip Memory Scrambling Enable
AT91C_HSMC4_TRR           EQU (0xF << 16) ;- (HSMC4_CS) Ready to REN low delay
AT91C_HSMC4_TWB           EQU (0xF << 24) ;- (HSMC4_CS) WEN high to REN to busy
AT91C_HSMC4_RBNSEL        EQU (0x7 << 28) ;- (HSMC4_CS) Ready/Busy Line Selection
AT91C_HSMC4_NFSEL         EQU (0x1 << 31) ;- (HSMC4_CS) Nand Flash Selection
// - -------- HSMC4_MODE : (HSMC4_CS Offset: 0x10) HSMC4 MODE -------- 
AT91C_HSMC4_READ_MODE     EQU (0x1 <<  0) ;- (HSMC4_CS) Read Mode
AT91C_HSMC4_WRITE_MODE    EQU (0x1 <<  1) ;- (HSMC4_CS) Write Mode
AT91C_HSMC4_EXNW_MODE     EQU (0x3 <<  4) ;- (HSMC4_CS) NWAIT Mode
AT91C_HSMC4_EXNW_MODE_NWAIT_DISABLE EQU (0x0 <<  4) ;- (HSMC4_CS) External NWAIT disabled.
AT91C_HSMC4_EXNW_MODE_NWAIT_ENABLE_FROZEN EQU (0x2 <<  4) ;- (HSMC4_CS) External NWAIT enabled in frozen mode.
AT91C_HSMC4_EXNW_MODE_NWAIT_ENABLE_READY EQU (0x3 <<  4) ;- (HSMC4_CS) External NWAIT enabled in ready mode.
AT91C_HSMC4_BAT           EQU (0x1 <<  8) ;- (HSMC4_CS) Byte Access Type
AT91C_HSMC4_BAT_BYTE_SELECT EQU (0x0 <<  8) ;- (HSMC4_CS) Write controled by ncs, nbs0, nbs1, nbs2, nbs3. Read controled by ncs, nrd, nbs0, nbs1, nbs2, nbs3.
AT91C_HSMC4_BAT_BYTE_WRITE EQU (0x1 <<  8) ;- (HSMC4_CS) Write controled by ncs, nwe0, nwe1, nwe2, nwe3. Read controled by ncs and nrd.
AT91C_HSMC4_DBW           EQU (0x3 << 12) ;- (HSMC4_CS) Data Bus Width
AT91C_HSMC4_DBW_WIDTH_EIGTH_BITS EQU (0x0 << 12) ;- (HSMC4_CS) 8 bits.
AT91C_HSMC4_DBW_WIDTH_SIXTEEN_BITS EQU (0x1 << 12) ;- (HSMC4_CS) 16 bits.
AT91C_HSMC4_DBW_WIDTH_THIRTY_TWO_BITS EQU (0x2 << 12) ;- (HSMC4_CS) 32 bits.
AT91C_HSMC4_TDF_CYCLES    EQU (0xF << 16) ;- (HSMC4_CS) Data Float Time.
AT91C_HSMC4_TDF_MODE      EQU (0x1 << 20) ;- (HSMC4_CS) TDF Enabled.
AT91C_HSMC4_PMEN          EQU (0x1 << 24) ;- (HSMC4_CS) Page Mode Enabled.
AT91C_HSMC4_PS            EQU (0x3 << 28) ;- (HSMC4_CS) Page Size
AT91C_HSMC4_PS_SIZE_FOUR_BYTES EQU (0x0 << 28) ;- (HSMC4_CS) 4 bytes.
AT91C_HSMC4_PS_SIZE_EIGHT_BYTES EQU (0x1 << 28) ;- (HSMC4_CS) 8 bytes.
AT91C_HSMC4_PS_SIZE_SIXTEEN_BYTES EQU (0x2 << 28) ;- (HSMC4_CS) 16 bytes.
AT91C_HSMC4_PS_SIZE_THIRTY_TWO_BYTES EQU (0x3 << 28) ;- (HSMC4_CS) 32 bytes.

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR AHB Static Memory Controller 4 Interface
// - *****************************************************************************
// - -------- HSMC4_CFG : (HSMC4 Offset: 0x0) Configuration Register -------- 
AT91C_HSMC4_PAGESIZE      EQU (0x3 <<  0) ;- (HSMC4) PAGESIZE field description
AT91C_HSMC4_PAGESIZE_528_Bytes EQU (0x0) ;- (HSMC4) 512 bytes plus 16 bytes page size
AT91C_HSMC4_PAGESIZE_1056_Bytes EQU (0x1) ;- (HSMC4) 1024 bytes plus 32 bytes page size
AT91C_HSMC4_PAGESIZE_2112_Bytes EQU (0x2) ;- (HSMC4) 2048 bytes plus 64 bytes page size
AT91C_HSMC4_PAGESIZE_4224_Bytes EQU (0x3) ;- (HSMC4) 4096 bytes plus 128 bytes page size
AT91C_HSMC4_WSPARE        EQU (0x1 <<  8) ;- (HSMC4) Spare area access in Write Mode
AT91C_HSMC4_RSPARE        EQU (0x1 <<  9) ;- (HSMC4) Spare area access in Read Mode
AT91C_HSMC4_EDGECTRL      EQU (0x1 << 12) ;- (HSMC4) Rising/Falling Edge Detection Control
AT91C_HSMC4_RBEDGE        EQU (0x1 << 13) ;- (HSMC4) Ready/Busy Signal edge Detection
AT91C_HSMC4_DTOCYC        EQU (0xF << 16) ;- (HSMC4) Data Timeout Cycle Number
AT91C_HSMC4_DTOMUL        EQU (0x7 << 20) ;- (HSMC4) Data Timeout Multiplier
AT91C_HSMC4_DTOMUL_1      EQU (0x0 << 20) ;- (HSMC4) DTOCYC x 1
AT91C_HSMC4_DTOMUL_16     EQU (0x1 << 20) ;- (HSMC4) DTOCYC x 16
AT91C_HSMC4_DTOMUL_128    EQU (0x2 << 20) ;- (HSMC4) DTOCYC x 128
AT91C_HSMC4_DTOMUL_256    EQU (0x3 << 20) ;- (HSMC4) DTOCYC x 256
AT91C_HSMC4_DTOMUL_1024   EQU (0x4 << 20) ;- (HSMC4) DTOCYC x 1024
AT91C_HSMC4_DTOMUL_4096   EQU (0x5 << 20) ;- (HSMC4) DTOCYC x 4096
AT91C_HSMC4_DTOMUL_65536  EQU (0x6 << 20) ;- (HSMC4) DTOCYC x 65536
AT91C_HSMC4_DTOMUL_1048576 EQU (0x7 << 20) ;- (HSMC4) DTOCYC x 1048576
// - -------- HSMC4_CTRL : (HSMC4 Offset: 0x4) Control Register -------- 
AT91C_HSMC4_NFCEN         EQU (0x1 <<  0) ;- (HSMC4) Nand Flash Controller Host Enable
AT91C_HSMC4_NFCDIS        EQU (0x1 <<  1) ;- (HSMC4) Nand Flash Controller Host Disable
AT91C_HSMC4_HOSTEN        EQU (0x1 <<  8) ;- (HSMC4) If set to one, the Host controller is activated and perform a data transfer phase.
AT91C_HSMC4_HOSTWR        EQU (0x1 << 11) ;- (HSMC4) If this field is set to one, the host transfers data from the internal SRAM to the Memory Device.
AT91C_HSMC4_HOSTCSID      EQU (0x7 << 12) ;- (HSMC4) Host Controller Chip select Id
AT91C_HSMC4_HOSTCSID_0    EQU (0x0 << 12) ;- (HSMC4) CS0
AT91C_HSMC4_HOSTCSID_1    EQU (0x1 << 12) ;- (HSMC4) CS1
AT91C_HSMC4_HOSTCSID_2    EQU (0x2 << 12) ;- (HSMC4) CS2
AT91C_HSMC4_HOSTCSID_3    EQU (0x3 << 12) ;- (HSMC4) CS3
AT91C_HSMC4_HOSTCSID_4    EQU (0x4 << 12) ;- (HSMC4) CS4
AT91C_HSMC4_HOSTCSID_5    EQU (0x5 << 12) ;- (HSMC4) CS5
AT91C_HSMC4_HOSTCSID_6    EQU (0x6 << 12) ;- (HSMC4) CS6
AT91C_HSMC4_HOSTCSID_7    EQU (0x7 << 12) ;- (HSMC4) CS7
AT91C_HSMC4_VALID         EQU (0x1 << 15) ;- (HSMC4) When set to 1, a write operation modifies both HOSTCSID and HOSTWR fields.
// - -------- HSMC4_SR : (HSMC4 Offset: 0x8) HSMC4 Status Register -------- 
AT91C_HSMC4_NFCSTS        EQU (0x1 <<  0) ;- (HSMC4) Nand Flash Controller status
AT91C_HSMC4_RBRISE        EQU (0x1 <<  4) ;- (HSMC4) Selected Ready Busy Rising Edge Detected flag
AT91C_HSMC4_RBFALL        EQU (0x1 <<  5) ;- (HSMC4) Selected Ready Busy Falling Edge Detected flag
AT91C_HSMC4_HOSTBUSY      EQU (0x1 <<  8) ;- (HSMC4) Host Busy
AT91C_HSMC4_HOSTW         EQU (0x1 << 11) ;- (HSMC4) Host Write/Read Operation
AT91C_HSMC4_HOSTCS        EQU (0x7 << 12) ;- (HSMC4) Host Controller Chip select Id
AT91C_HSMC4_HOSTCS_0      EQU (0x0 << 12) ;- (HSMC4) CS0
AT91C_HSMC4_HOSTCS_1      EQU (0x1 << 12) ;- (HSMC4) CS1
AT91C_HSMC4_HOSTCS_2      EQU (0x2 << 12) ;- (HSMC4) CS2
AT91C_HSMC4_HOSTCS_3      EQU (0x3 << 12) ;- (HSMC4) CS3
AT91C_HSMC4_HOSTCS_4      EQU (0x4 << 12) ;- (HSMC4) CS4
AT91C_HSMC4_HOSTCS_5      EQU (0x5 << 12) ;- (HSMC4) CS5
AT91C_HSMC4_HOSTCS_6      EQU (0x6 << 12) ;- (HSMC4) CS6
AT91C_HSMC4_HOSTCS_7      EQU (0x7 << 12) ;- (HSMC4) CS7
AT91C_HSMC4_XFRDONE       EQU (0x1 << 16) ;- (HSMC4) Host Data Transfer Terminated
AT91C_HSMC4_CMDDONE       EQU (0x1 << 17) ;- (HSMC4) Command Done
AT91C_HSMC4_ECCRDY        EQU (0x1 << 18) ;- (HSMC4) ECC ready
AT91C_HSMC4_DTOE          EQU (0x1 << 20) ;- (HSMC4) Data timeout Error
AT91C_HSMC4_UNDEF         EQU (0x1 << 21) ;- (HSMC4) Undefined Area Error
AT91C_HSMC4_AWB           EQU (0x1 << 22) ;- (HSMC4) Accessing While Busy Error
AT91C_HSMC4_HASE          EQU (0x1 << 23) ;- (HSMC4) Host Controller Access Size Error
AT91C_HSMC4_RBEDGE0       EQU (0x1 << 24) ;- (HSMC4) Ready Busy line 0 Edge detected
AT91C_HSMC4_RBEDGE1       EQU (0x1 << 25) ;- (HSMC4) Ready Busy line 1 Edge detected
AT91C_HSMC4_RBEDGE2       EQU (0x1 << 26) ;- (HSMC4) Ready Busy line 2 Edge detected
AT91C_HSMC4_RBEDGE3       EQU (0x1 << 27) ;- (HSMC4) Ready Busy line 3 Edge detected
AT91C_HSMC4_RBEDGE4       EQU (0x1 << 28) ;- (HSMC4) Ready Busy line 4 Edge detected
AT91C_HSMC4_RBEDGE5       EQU (0x1 << 29) ;- (HSMC4) Ready Busy line 5 Edge detected
AT91C_HSMC4_RBEDGE6       EQU (0x1 << 30) ;- (HSMC4) Ready Busy line 6 Edge detected
AT91C_HSMC4_RBEDGE7       EQU (0x1 << 31) ;- (HSMC4) Ready Busy line 7 Edge detected
// - -------- HSMC4_IER : (HSMC4 Offset: 0xc) HSMC4 Interrupt Enable Register -------- 
// - -------- HSMC4_IDR : (HSMC4 Offset: 0x10) HSMC4 Interrupt Disable Register -------- 
// - -------- HSMC4_IMR : (HSMC4 Offset: 0x14) HSMC4 Interrupt Mask Register -------- 
// - -------- HSMC4_ADDR : (HSMC4 Offset: 0x18) Address Cycle Zero Register -------- 
AT91C_HSMC4_ADDRCYCLE0    EQU (0xFF <<  0) ;- (HSMC4) Nand Flash Array Address cycle 0
// - -------- HSMC4_BANK : (HSMC4 Offset: 0x1c) Bank Register -------- 
AT91C_BANK                EQU (0x7 <<  0) ;- (HSMC4) Bank identifier
AT91C_BANK_0              EQU (0x0) ;- (HSMC4) BANK0
AT91C_BANK_1              EQU (0x1) ;- (HSMC4) BANK1
AT91C_BANK_2              EQU (0x2) ;- (HSMC4) BANK2
AT91C_BANK_3              EQU (0x3) ;- (HSMC4) BANK3
AT91C_BANK_4              EQU (0x4) ;- (HSMC4) BANK4
AT91C_BANK_5              EQU (0x5) ;- (HSMC4) BANK5
AT91C_BANK_6              EQU (0x6) ;- (HSMC4) BANK6
AT91C_BANK_7              EQU (0x7) ;- (HSMC4) BANK7
// - -------- HSMC4_ECCCR : (HSMC4 Offset: 0x20) ECC Control Register -------- 
AT91C_HSMC4_ECCRESET      EQU (0x1 <<  0) ;- (HSMC4) Reset ECC
// - -------- HSMC4_ECCCMD : (HSMC4 Offset: 0x24) ECC mode register -------- 
AT91C_ECC_PAGE_SIZE       EQU (0x3 <<  0) ;- (HSMC4) Nand Flash page size
AT91C_ECC_PAGE_SIZE_528_Bytes EQU (0x0) ;- (HSMC4) 512 bytes plus 16 bytes page size
AT91C_ECC_PAGE_SIZE_1056_Bytes EQU (0x1) ;- (HSMC4) 1024 bytes plus 32 bytes page size
AT91C_ECC_PAGE_SIZE_2112_Bytes EQU (0x2) ;- (HSMC4) 2048 bytes plus 64 bytes page size
AT91C_ECC_PAGE_SIZE_4224_Bytes EQU (0x3) ;- (HSMC4) 4096 bytes plus 128 bytes page size
AT91C_ECC_TYPCORRECT      EQU (0x3 <<  4) ;- (HSMC4) Nand Flash page size
AT91C_ECC_TYPCORRECT_ONE_PER_PAGE EQU (0x0 <<  4) ;- (HSMC4) 
AT91C_ECC_TYPCORRECT_ONE_EVERY_256_BYTES EQU (0x1 <<  4) ;- (HSMC4) 
AT91C_ECC_TYPCORRECT_ONE_EVERY_512_BYTES EQU (0x2 <<  4) ;- (HSMC4) 
// - -------- HSMC4_ECCSR1 : (HSMC4 Offset: 0x28) ECC Status Register 1 -------- 
AT91C_HSMC4_ECC_RECERR0   EQU (0x1 <<  0) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR0   EQU (0x1 <<  1) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR0   EQU (0x1 <<  2) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR1   EQU (0x1 <<  4) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR1   EQU (0x1 <<  5) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR1   EQU (0x1 <<  6) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR2   EQU (0x1 <<  8) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR2   EQU (0x1 <<  9) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR2   EQU (0x1 << 10) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR3   EQU (0x1 << 12) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR3   EQU (0x1 << 13) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR3   EQU (0x1 << 14) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR4   EQU (0x1 << 16) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR4   EQU (0x1 << 17) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR4   EQU (0x1 << 18) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR5   EQU (0x1 << 20) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR5   EQU (0x1 << 21) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR5   EQU (0x1 << 22) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR6   EQU (0x1 << 24) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR6   EQU (0x1 << 25) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR6   EQU (0x1 << 26) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR7   EQU (0x1 << 28) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR7   EQU (0x1 << 29) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR7   EQU (0x1 << 30) ;- (HSMC4) Multiple Error
// - -------- HSMC4_ECCPR0 : (HSMC4 Offset: 0x2c) HSMC4 ECC parity Register 0 -------- 
AT91C_HSMC4_ECC_BITADDR   EQU (0x7 <<  0) ;- (HSMC4) Corrupted Bit Address in the page
AT91C_HSMC4_ECC_WORDADDR  EQU (0xFF <<  3) ;- (HSMC4) Corrupted Word Address in the page
AT91C_HSMC4_ECC_NPARITY   EQU (0x7FF << 12) ;- (HSMC4) Parity N
// - -------- HSMC4_ECCPR1 : (HSMC4 Offset: 0x30) HSMC4 ECC parity Register 1 -------- 
// - -------- HSMC4_ECCSR2 : (HSMC4 Offset: 0x34) ECC Status Register 2 -------- 
AT91C_HSMC4_ECC_RECERR8   EQU (0x1 <<  0) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR8   EQU (0x1 <<  1) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR8   EQU (0x1 <<  2) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR9   EQU (0x1 <<  4) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR9   EQU (0x1 <<  5) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR9   EQU (0x1 <<  6) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR10  EQU (0x1 <<  8) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR10  EQU (0x1 <<  9) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR10  EQU (0x1 << 10) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR11  EQU (0x1 << 12) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR11  EQU (0x1 << 13) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR11  EQU (0x1 << 14) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR12  EQU (0x1 << 16) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR12  EQU (0x1 << 17) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR12  EQU (0x1 << 18) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR13  EQU (0x1 << 20) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR13  EQU (0x1 << 21) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR13  EQU (0x1 << 22) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR14  EQU (0x1 << 24) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR14  EQU (0x1 << 25) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR14  EQU (0x1 << 26) ;- (HSMC4) Multiple Error
AT91C_HSMC4_ECC_RECERR15  EQU (0x1 << 28) ;- (HSMC4) Recoverable Error
AT91C_HSMC4_ECC_ECCERR15  EQU (0x1 << 29) ;- (HSMC4) ECC Error
AT91C_HSMC4_ECC_MULERR15  EQU (0x1 << 30) ;- (HSMC4) Multiple Error
// - -------- HSMC4_ECCPR2 : (HSMC4 Offset: 0x38) HSMC4 ECC parity Register 2 -------- 
// - -------- HSMC4_ECCPR3 : (HSMC4 Offset: 0x3c) HSMC4 ECC parity Register 3 -------- 
// - -------- HSMC4_ECCPR4 : (HSMC4 Offset: 0x40) HSMC4 ECC parity Register 4 -------- 
// - -------- HSMC4_ECCPR5 : (HSMC4 Offset: 0x44) HSMC4 ECC parity Register 5 -------- 
// - -------- HSMC4_ECCPR6 : (HSMC4 Offset: 0x48) HSMC4 ECC parity Register 6 -------- 
// - -------- HSMC4_ECCPR7 : (HSMC4 Offset: 0x4c) HSMC4 ECC parity Register 7 -------- 
// - -------- HSMC4_ECCPR8 : (HSMC4 Offset: 0x50) HSMC4 ECC parity Register 8 -------- 
// - -------- HSMC4_ECCPR9 : (HSMC4 Offset: 0x54) HSMC4 ECC parity Register 9 -------- 
// - -------- HSMC4_ECCPR10 : (HSMC4 Offset: 0x58) HSMC4 ECC parity Register 10 -------- 
// - -------- HSMC4_ECCPR11 : (HSMC4 Offset: 0x5c) HSMC4 ECC parity Register 11 -------- 
// - -------- HSMC4_ECCPR12 : (HSMC4 Offset: 0x60) HSMC4 ECC parity Register 12 -------- 
// - -------- HSMC4_ECCPR13 : (HSMC4 Offset: 0x64) HSMC4 ECC parity Register 13 -------- 
// - -------- HSMC4_ECCPR14 : (HSMC4 Offset: 0x68) HSMC4 ECC parity Register 14 -------- 
// - -------- HSMC4_ECCPR15 : (HSMC4 Offset: 0x6c) HSMC4 ECC parity Register 15 -------- 
// - -------- HSMC4_OCMS : (HSMC4 Offset: 0x110) HSMC4 OCMS Register -------- 
AT91C_HSMC4_OCMS_SRSE     EQU (0x1 <<  0) ;- (HSMC4) Static Memory Controller Scrambling Enable
AT91C_HSMC4_OCMS_SMSE     EQU (0x1 <<  1) ;- (HSMC4) SRAM Scramling Enable
// - -------- HSMC4_KEY1 : (HSMC4 Offset: 0x114) HSMC4 OCMS KEY1 Register -------- 
AT91C_HSMC4_OCMS_KEY1     EQU (0x0 <<  0) ;- (HSMC4) OCMS Key 2
// - -------- HSMC4_OCMS_KEY2 : (HSMC4 Offset: 0x118) HSMC4 OCMS KEY2 Register -------- 
AT91C_HSMC4_OCMS_KEY2     EQU (0x0 <<  0) ;- (HSMC4) OCMS Key 2
// - -------- HSMC4_WPCR : (HSMC4 Offset: 0x1e4) HSMC4 Witre Protection Control Register -------- 
AT91C_HSMC4_WP_EN         EQU (0x1 <<  0) ;- (HSMC4) Write Protection Enable
AT91C_HSMC4_WP_KEY        EQU (0xFFFFFF <<  8) ;- (HSMC4) Protection Password
// - -------- HSMC4_WPSR : (HSMC4 Offset: 0x1e8) HSMC4 WPSR Register -------- 
AT91C_HSMC4_WP_VS         EQU (0xF <<  0) ;- (HSMC4) Write Protection Violation Status
AT91C_HSMC4_WP_VS_WP_VS0  EQU (0x0) ;- (HSMC4) No write protection violation since the last read of this register
AT91C_HSMC4_WP_VS_WP_VS1  EQU (0x1) ;- (HSMC4) write protection detected unauthorized attempt to write a control register had occured (since the last read)
AT91C_HSMC4_WP_VS_WP_VS2  EQU (0x2) ;- (HSMC4) Software reset had been performed while write protection was enabled (since the last read)
AT91C_HSMC4_WP_VS_WP_VS3  EQU (0x3) ;- (HSMC4) Both write protection violation and software reset with write protection enabled had occured since the last read
AT91C_                    EQU (0x0 <<  8) ;- (HSMC4) 
// - -------- HSMC4_VER : (HSMC4 Offset: 0x1fc) HSMC4 VERSION Register -------- 
// - -------- HSMC4_DUMMY : (HSMC4 Offset: 0x200) HSMC4 DUMMY REGISTER -------- 
AT91C_HSMC4_CMD1          EQU (0xFF <<  2) ;- (HSMC4) Command Register Value for Cycle 1
AT91C_HSMC4_CMD2          EQU (0xFF << 10) ;- (HSMC4) Command Register Value for Cycle 2
AT91C_HSMC4_VCMD2         EQU (0x1 << 18) ;- (HSMC4) Valid Cycle 2 Command
AT91C_HSMC4_ACYCLE        EQU (0x7 << 19) ;- (HSMC4) Number of Address required for the current command
AT91C_HSMC4_ACYCLE_HSMC4_ACYCLE_NONE EQU (0x0 << 19) ;- (HSMC4) No address cycle
AT91C_HSMC4_ACYCLE_HSMC4_ACYCLE_ONE EQU (0x1 << 19) ;- (HSMC4) One address cycle
AT91C_HSMC4_ACYCLE_HSMC4_ACYCLE_TWO EQU (0x2 << 19) ;- (HSMC4) Two address cycles
AT91C_HSMC4_ACYCLE_HSMC4_ACYCLE_THREE EQU (0x3 << 19) ;- (HSMC4) Three address cycles
AT91C_HSMC4_ACYCLE_HSMC4_ACYCLE_FOUR EQU (0x4 << 19) ;- (HSMC4) Four address cycles
AT91C_HSMC4_ACYCLE_HSMC4_ACYCLE_FIVE EQU (0x5 << 19) ;- (HSMC4) Five address cycles
AT91C_HSMC4_CSID          EQU (0x7 << 22) ;- (HSMC4) Chip Select Identifier
AT91C_HSMC4_CSID_0        EQU (0x0 << 22) ;- (HSMC4) CS0
AT91C_HSMC4_CSID_1        EQU (0x1 << 22) ;- (HSMC4) CS1
AT91C_HSMC4_CSID_2        EQU (0x2 << 22) ;- (HSMC4) CS2
AT91C_HSMC4_CSID_3        EQU (0x3 << 22) ;- (HSMC4) CS3
AT91C_HSMC4_CSID_4        EQU (0x4 << 22) ;- (HSMC4) CS4
AT91C_HSMC4_CSID_5        EQU (0x5 << 22) ;- (HSMC4) CS5
AT91C_HSMC4_CSID_6        EQU (0x6 << 22) ;- (HSMC4) CS6
AT91C_HSMC4_CSID_7        EQU (0x7 << 22) ;- (HSMC4) CS7
AT91C_HSMC4_HOST_EN       EQU (0x1 << 25) ;- (HSMC4) Host Main Controller Enable
AT91C_HSMC4_HOST_WR       EQU (0x1 << 26) ;- (HSMC4) HOSTWR : Host Main Controller Write Enable
AT91C_HSMC4_HOSTCMD       EQU (0x1 << 27) ;- (HSMC4) Host Command Enable

