una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u4.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR AHB Matrix2 Interface
// - *****************************************************************************
// - -------- MATRIX_MCFG0 : (HMATRIX2 Offset: 0x0) Master Configuration Register ARM bus I and D -------- 
AT91C_MATRIX_ULBT         EQU (0x7 <<  0) ;- (HMATRIX2) Undefined Length Burst Type
AT91C_MATRIX_ULBT_INFINIT_LENGTH EQU (0x0) ;- (HMATRIX2) infinite length burst
AT91C_MATRIX_ULBT_SINGLE_ACCESS EQU (0x1) ;- (HMATRIX2) Single Access
AT91C_MATRIX_ULBT_4_BEAT  EQU (0x2) ;- (HMATRIX2) 4 Beat Burst
AT91C_MATRIX_ULBT_8_BEAT  EQU (0x3) ;- (HMATRIX2) 8 Beat Burst
AT91C_MATRIX_ULBT_16_BEAT EQU (0x4) ;- (HMATRIX2) 16 Beat Burst
AT91C_MATRIX_ULBT_32_BEAT EQU (0x5) ;- (HMATRIX2) 32 Beat Burst
AT91C_MATRIX_ULBT_64_BEAT EQU (0x6) ;- (HMATRIX2) 64 Beat Burst
AT91C_MATRIX_ULBT_128_BEAT EQU (0x7) ;- (HMATRIX2) 128 Beat Burst
// - -------- MATRIX_MCFG1 : (HMATRIX2 Offset: 0x4) Master Configuration Register ARM bus S -------- 
// - -------- MATRIX_MCFG2 : (HMATRIX2 Offset: 0x8) Master Configuration Register -------- 
// - -------- MATRIX_MCFG3 : (HMATRIX2 Offset: 0xc) Master Configuration Register -------- 
// - -------- MATRIX_MCFG4 : (HMATRIX2 Offset: 0x10) Master Configuration Register -------- 
// - -------- MATRIX_MCFG5 : (HMATRIX2 Offset: 0x14) Master Configuration Register -------- 
// - -------- MATRIX_MCFG6 : (HMATRIX2 Offset: 0x18) Master Configuration Register -------- 
// - -------- MATRIX_MCFG7 : (HMATRIX2 Offset: 0x1c) Master Configuration Register -------- 
// - -------- MATRIX_SCFG0 : (HMATRIX2 Offset: 0x40) Slave Configuration Register 0 -------- 
AT91C_MATRIX_SLOT_CYCLE   EQU (0xFF <<  0) ;- (HMATRIX2) Maximum Number of Allowed Cycles for a Burst
AT91C_MATRIX_DEFMSTR_TYPE EQU (0x3 << 16) ;- (HMATRIX2) Default Master Type
AT91C_MATRIX_DEFMSTR_TYPE_NO_DEFMSTR EQU (0x0 << 16) ;- (HMATRIX2) No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This results in having a one cycle latency for the first transfer of a burst.
AT91C_MATRIX_DEFMSTR_TYPE_LAST_DEFMSTR EQU (0x1 << 16) ;- (HMATRIX2) Last Default Master. At the end of current slave access, if no other master request is pending, the slave stay connected with the last master having accessed it. This results in not having the one cycle latency when the last master re-trying access on the slave.
AT91C_MATRIX_DEFMSTR_TYPE_FIXED_DEFMSTR EQU (0x2 << 16) ;- (HMATRIX2) Fixed Default Master. At the end of current slave access, if no other master request is pending, the slave connects with fixed which number is in FIXED_DEFMSTR field. This results in not having the one cycle latency when the fixed master re-trying access on the slave.
AT91C_MATRIX_FIXED_DEFMSTR_SCFG0 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG0_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG1 : (HMATRIX2 Offset: 0x44) Slave Configuration Register 1 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG1 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG1_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG2 : (HMATRIX2 Offset: 0x48) Slave Configuration Register 2 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG2 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG2_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG3 : (HMATRIX2 Offset: 0x4c) Slave Configuration Register 3 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG3 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG3_ARMC EQU (0x0 << 18) ;- (HMATRIX2) ARMC is Default Master
// - -------- MATRIX_SCFG4 : (HMATRIX2 Offset: 0x50) Slave Configuration Register 4 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG4 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG4_ARMC EQU (0x0 << 18) ;- (HMATRIX2) ARMC is Default Master
// - -------- MATRIX_SCFG5 : (HMATRIX2 Offset: 0x54) Slave Configuration Register 5 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG5 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG5_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG6 : (HMATRIX2 Offset: 0x58) Slave Configuration Register 6 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG6 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG6_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG7 : (HMATRIX2 Offset: 0x5c) Slave Configuration Register 7 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG7 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG7_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG8 : (HMATRIX2 Offset: 0x60) Slave Configuration Register 8 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG8 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG8_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG8_HDMA EQU (0x4 << 18) ;- (HMATRIX2) HDMA is Default Master
// - -------- MATRIX_SCFG9 : (HMATRIX2 Offset: 0x64) Slave Configuration Register 9 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG9 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG9_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG9_HDMA EQU (0x4 << 18) ;- (HMATRIX2) HDMA is Default Master
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x110) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x114) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x118) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x11c) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x120) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x124) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x128) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x12c) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x130) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x134) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x138) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x13c) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x140) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x144) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x148) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x14c) Special Function Register 0 -------- 
// - -------- HMATRIX2_VER : (HMATRIX2 Offset: 0x1fc)  VERSION  Register -------- 
AT91C_HMATRIX2_VER        EQU (0xF <<  0) ;- (HMATRIX2)  VERSION  Register

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR NESTED vector Interrupt Controller
// - *****************************************************************************
// - -------- NVIC_ICTR : (NVIC Offset: 0x4) Interrupt Controller Type Register -------- 
AT91C_NVIC_INTLINESNUM    EQU (0xF <<  0) ;- (NVIC) Total number of interrupt lines
AT91C_NVIC_INTLINESNUM_32 EQU (0x0) ;- (NVIC) up to 32 interrupt lines supported
AT91C_NVIC_INTLINESNUM_64 EQU (0x1) ;- (NVIC) up to 64 interrupt lines supported
AT91C_NVIC_INTLINESNUM_96 EQU (0x2) ;- (NVIC) up to 96 interrupt lines supported
AT91C_NVIC_INTLINESNUM_128 EQU (0x3) ;- (NVIC) up to 128 interrupt lines supported
AT91C_NVIC_INTLINESNUM_160 EQU (0x4) ;- (NVIC) up to 160 interrupt lines supported
AT91C_NVIC_INTLINESNUM_192 EQU (0x5) ;- (NVIC) up to 192 interrupt lines supported
AT91C_NVIC_INTLINESNUM_224 EQU (0x6) ;- (NVIC) up to 224 interrupt lines supported
AT91C_NVIC_INTLINESNUM_256 EQU (0x7) ;- (NVIC) up to 256 interrupt lines supported
AT91C_NVIC_INTLINESNUM_288 EQU (0x8) ;- (NVIC) up to 288 interrupt lines supported
AT91C_NVIC_INTLINESNUM_320 EQU (0x9) ;- (NVIC) up to 320 interrupt lines supported
AT91C_NVIC_INTLINESNUM_352 EQU (0xA) ;- (NVIC) up to 352 interrupt lines supported
AT91C_NVIC_INTLINESNUM_384 EQU (0xB) ;- (NVIC) up to 384 interrupt lines supported
AT91C_NVIC_INTLINESNUM_416 EQU (0xC) ;- (NVIC) up to 416 interrupt lines supported
AT91C_NVIC_INTLINESNUM_448 EQU (0xD) ;- (NVIC) up to 448 interrupt lines supported
AT91C_NVIC_INTLINESNUM_480 EQU (0xE) ;- (NVIC) up to 480 interrupt lines supported
AT91C_NVIC_INTLINESNUM_496 EQU (0xF) ;- (NVIC) up to 496 interrupt lines supported)
// - -------- NVIC_STICKCSR : (NVIC Offset: 0x10) SysTick Control and Status Register -------- 
AT91C_NVIC_STICKENABLE    EQU (0x1 <<  0) ;- (NVIC) SysTick counter enable.
AT91C_NVIC_STICKINT       EQU (0x1 <<  1) ;- (NVIC) SysTick interrupt enable.
AT91C_NVIC_STICKCLKSOURCE EQU (0x1 <<  2) ;- (NVIC) Reference clock selection.
AT91C_NVIC_STICKCOUNTFLAG EQU (0x1 << 16) ;- (NVIC) Return 1 if timer counted to 0 since last read.
// - -------- NVIC_STICKRVR : (NVIC Offset: 0x14) SysTick Reload Value Register -------- 
AT91C_NVIC_STICKRELOAD    EQU (0xFFFFFF <<  0) ;- (NVIC) SysTick reload value.
// - -------- NVIC_STICKCVR : (NVIC Offset: 0x18) SysTick Current Value Register -------- 
AT91C_NVIC_STICKCURRENT   EQU (0x7FFFFFFF <<  0) ;- (NVIC) SysTick current value.
// - -------- NVIC_STICKCALVR : (NVIC Offset: 0x1c) SysTick Calibration Value Register -------- 
AT91C_NVIC_STICKTENMS     EQU (0xFFFFFF <<  0) ;- (NVIC) Reload value to use for 10ms timing.
AT91C_NVIC_STICKSKEW      EQU (0x1 << 30) ;- (NVIC) Read as 1 if the calibration value is not exactly 10ms because of clock frequency.
AT91C_NVIC_STICKNOREF     EQU (0x1 << 31) ;- (NVIC) Read as 1 if the reference clock is not provided.
// - -------- NVIC_IPR : (NVIC Offset: 0x400) Interrupt Priority Registers -------- 
AT91C_NVIC_PRI_N          EQU (0xFF <<  0) ;- (NVIC) Priority of interrupt N (0, 4, 8, etc)
AT91C_NVIC_PRI_N1         EQU (0xFF <<  8) ;- (NVIC) Priority of interrupt N+1 (1, 5, 9, etc)
AT91C_NVIC_PRI_N2         EQU (0xFF << 16) ;- (NVIC) Priority of interrupt N+2 (2, 6, 10, etc)
AT91C_NVIC_PRI_N3         EQU (0xFF << 24) ;- (NVIC) Priority of interrupt N+3 (3, 7, 11, etc)
// - -------- NVIC_CPUID : (NVIC Offset: 0xd00) CPU ID Base Register -------- 
AT91C_NVIC_REVISION       EQU (0xF <<  0) ;- (NVIC) Implementation defined revision number.
AT91C_NVIC_PARTNO         EQU (0xFFF <<  4) ;- (NVIC) Number of processor within family
AT91C_NVIC_CONSTANT       EQU (0xF << 16) ;- (NVIC) Reads as 0xF
AT91C_NVIC_VARIANT        EQU (0xF << 20) ;- (NVIC) Implementation defined variant number.
AT91C_NVIC_IMPLEMENTER    EQU (0xFF << 24) ;- (NVIC) Implementer code. ARM is 0x41
// - -------- NVIC_ICSR : (NVIC Offset: 0xd04) Interrupt Control State Register -------- 
AT91C_NVIC_VECTACTIVE     EQU (0x1FF <<  0) ;- (NVIC) Read-only Active ISR number field
AT91C_NVIC_RETTOBASE      EQU (0x1 << 11) ;- (NVIC) Read-only
AT91C_NVIC_VECTPENDING    EQU (0x1FF << 12) ;- (NVIC) Read-only Pending ISR number field
AT91C_NVIC_ISRPENDING     EQU (0x1 << 22) ;- (NVIC) Read-only Interrupt pending flag.
AT91C_NVIC_ISRPREEMPT     EQU (0x1 << 23) ;- (NVIC) Read-only You must only use this at debug time
AT91C_NVIC_PENDSTCLR      EQU (0x1 << 25) ;- (NVIC) Write-only Clear pending SysTick bit
AT91C_NVIC_PENDSTSET      EQU (0x1 << 26) ;- (NVIC) Read/write Set a pending SysTick bit
AT91C_NVIC_PENDSVCLR      EQU (0x1 << 27) ;- (NVIC) Write-only Clear pending pendSV bit
AT91C_NVIC_PENDSVSET      EQU (0x1 << 28) ;- (NVIC) Read/write Set pending pendSV bit
AT91C_NVIC_NMIPENDSET     EQU (0x1 << 31) ;- (NVIC) Read/write Set pending NMI
// - -------- NVIC_VTOFFR : (NVIC Offset: 0xd08) Vector Table Offset Register -------- 
AT91C_NVIC_TBLOFF         EQU (0x3FFFFF <<  7) ;- (NVIC) Vector table base offset field
AT91C_NVIC_TBLBASE        EQU (0x1 << 29) ;- (NVIC) Table base is in Code (0) or RAM (1)
AT91C_NVIC_TBLBASE_CODE   EQU (0x0 << 29) ;- (NVIC) Table base is in CODE
AT91C_NVIC_TBLBASE_RAM    EQU (0x1 << 29) ;- (NVIC) Table base is in RAM
// - -------- NVIC_AIRCR : (NVIC Offset: 0xd0c) Application Interrupt and Reset Control Register -------- 
AT91C_NVIC_VECTRESET      EQU (0x1 <<  0) ;- (NVIC) System Reset bit
AT91C_NVIC_VECTCLRACTIVE  EQU (0x1 <<  1) ;- (NVIC) Clear active vector bit
AT91C_NVIC_SYSRESETREQ    EQU (0x1 <<  2) ;- (NVIC) Causes a signal to be asserted to the outer system that indicates a reset is requested
AT91C_NVIC_PRIGROUP       EQU (0x7 <<  8) ;- (NVIC) Interrupt priority grouping field
AT91C_NVIC_PRIGROUP_3     EQU (0x3 <<  8) ;- (NVIC) indicates four bits of pre-emption priority, none bit of subpriority
AT91C_NVIC_PRIGROUP_4     EQU (0x4 <<  8) ;- (NVIC) indicates three bits of pre-emption priority, one bit of subpriority
AT91C_NVIC_PRIGROUP_5     EQU (0x5 <<  8) ;- (NVIC) indicates two bits of pre-emption priority, two bits of subpriority
AT91C_NVIC_PRIGROUP_6     EQU (0x6 <<  8) ;- (NVIC) indicates one bit of pre-emption priority, three bits of subpriority
AT91C_NVIC_PRIGROUP_7     EQU (0x7 <<  8) ;- (NVIC) indicates no pre-emption priority, four bits of subpriority
AT91C_NVIC_ENDIANESS      EQU (0x1 << 15) ;- (NVIC) Data endianness bit
AT91C_NVIC_VECTKEY        EQU (0xFFFF << 16) ;- (NVIC) Register key
// - -------- NVIC_SCR : (NVIC Offset: 0xd10) System Control Register -------- 
AT91C_NVIC_SLEEPONEXIT    EQU (0x1 <<  1) ;- (NVIC) Sleep on exit when returning from Handler mode to Thread mode
AT91C_NVIC_SLEEPDEEP      EQU (0x1 <<  2) ;- (NVIC) Sleep deep bit
AT91C_NVIC_SEVONPEND      EQU (0x1 <<  4) ;- (NVIC) When enabled, this causes WFE to wake up when an interrupt moves from inactive to pended
// - -------- NVIC_CCR : (NVIC Offset: 0xd14) Configuration Control Register -------- 
AT91C_NVIC_NONEBASETHRDENA EQU (0x1 <<  0) ;- (NVIC) When 0, default, It is only possible to enter Thread mode when returning from the last exception
AT91C_NVIC_USERSETMPEND   EQU (0x1 <<  1) ;- (NVIC) 
AT91C_NVIC_UNALIGN_TRP    EQU (0x1 <<  3) ;- (NVIC) Trap for unaligned access
AT91C_NVIC_DIV_0_TRP      EQU (0x1 <<  4) ;- (NVIC) Trap on Divide by 0
AT91C_NVIC_BFHFNMIGN      EQU (0x1 <<  8) ;- (NVIC) 
AT91C_NVIC_STKALIGN       EQU (0x1 <<  9) ;- (NVIC) 
// - -------- NVIC_HAND4PR : (NVIC Offset: 0xd18) System Handlers 4-7 Priority Register -------- 
AT91C_NVIC_PRI_4          EQU (0xFF <<  0) ;- (NVIC) 
AT91C_NVIC_PRI_5          EQU (0xFF <<  8) ;- (NVIC) 
AT91C_NVIC_PRI_6          EQU (0xFF << 16) ;- (NVIC) 
AT91C_NVIC_PRI_7          EQU (0xFF << 24) ;- (NVIC) 
// - -------- NVIC_HAND8PR : (NVIC Offset: 0xd1c) System Handlers 8-11 Priority Register -------- 
AT91C_NVIC_PRI_8          EQU (0xFF <<  0) ;- (NVIC) 
AT91C_NVIC_PRI_9          EQU (0xFF <<  8) ;- (NVIC) 
AT91C_NVIC_PRI_10         EQU (0xFF << 16) ;- (NVIC) 
AT91C_NVIC_PRI_11         EQU (0xFF << 24) ;- (NVIC) 
// - -------- NVIC_HAND12PR : (NVIC Offset: 0xd20) System Handlers 12-15 Priority Register -------- 
AT91C_NVIC_PRI_12         EQU (0xFF <<  0) ;- (NVIC) 
AT91C_NVIC_PRI_13         EQU (0xFF <<  8) ;- (NVIC) 
AT91C_NVIC_PRI_14         EQU (0xFF << 16) ;- (NVIC) 
AT91C_NVIC_PRI_15         EQU (0xFF << 24) ;- (NVIC) 
// - -------- NVIC_HANDCSR : (NVIC Offset: 0xd24) System Handler Control and State Register -------- 
AT91C_NVIC_MEMFAULTACT    EQU (0x1 <<  0) ;- (NVIC) 
AT91C_NVIC_BUSFAULTACT    EQU (0x1 <<  1) ;- (NVIC) 
AT91C_NVIC_USGFAULTACT    EQU (0x1 <<  3) ;- (NVIC) 
AT91C_NVIC_SVCALLACT      EQU (0x1 <<  7) ;- (NVIC) 
AT91C_NVIC_MONITORACT     EQU (0x1 <<  8) ;- (NVIC) 
AT91C_NVIC_PENDSVACT      EQU (0x1 << 10) ;- (NVIC) 
AT91C_NVIC_SYSTICKACT     EQU (0x1 << 11) ;- (NVIC) 
AT91C_NVIC_USGFAULTPENDED EQU (0x1 << 12) ;- (NVIC) 
AT91C_NVIC_MEMFAULTPENDED EQU (0x1 << 13) ;- (NVIC) 
AT91C_NVIC_BUSFAULTPENDED EQU (0x1 << 14) ;- (NVIC) 
AT91C_NVIC_SVCALLPENDED   EQU (0x1 << 15) ;- (NVIC) 
AT91C_NVIC_MEMFAULTENA    EQU (0x1 << 16) ;- (NVIC) 
AT91C_NVIC_BUSFAULTENA    EQU (0x1 << 17) ;- (NVIC) 
AT91C_NVIC_USGFAULTENA    EQU (0x1 << 18) ;- (NVIC) 
// - -------- NVIC_CFSR : (NVIC Offset: 0xd28) Configurable Fault Status Registers -------- 
AT91C_NVIC_MEMMANAGE      EQU (0xFF <<  0) ;- (NVIC) 
AT91C_NVIC_BUSFAULT       EQU (0xFF <<  8) ;- (NVIC) 
AT91C_NVIC_USAGEFAULT     EQU (0xFF << 16) ;- (NVIC) 
// - -------- NVIC_BFAR : (NVIC Offset: 0xd38) Bus Fault Address Register -------- 
AT91C_NVIC_IBUSERR        EQU (0x1 <<  0) ;- (NVIC) This bit indicates a bus fault on an instruction prefetch
AT91C_NVIC_PRECISERR      EQU (0x1 <<  1) ;- (NVIC) Precise data access error. The BFAR is written with the faulting address
AT91C_NVIC_IMPRECISERR    EQU (0x1 <<  2) ;- (NVIC) Imprecise data access error
AT91C_NVIC_UNSTKERR       EQU (0x1 <<  3) ;- (NVIC) This bit indicates a derived bus fault has occurred on exception return
AT91C_NVIC_STKERR         EQU (0x1 <<  4) ;- (NVIC) This bit indicates a derived bus fault has occurred on exception entry
AT91C_NVIC_BFARVALID      EQU (0x1 <<  7) ;- (NVIC) This bit is set if the BFAR register has valid contents
// - -------- NVIC_PFR0 : (NVIC Offset: 0xd40) Processor Feature register0 (ID_PFR0) -------- 
AT91C_NVIC_ID_PFR0_0      EQU (0xF <<  0) ;- (NVIC) State0 (T-bit == 0)
AT91C_NVIC_ID_PRF0_1      EQU (0xF <<  4) ;- (NVIC) State1 (T-bit == 1)
// - -------- NVIC_PFR1 : (NVIC Offset: 0xd44) Processor Feature register1 (ID_PFR1) -------- 
AT91C_NVIC_ID_PRF1_MODEL  EQU (0xF <<  8) ;- (NVIC) Microcontroller programmer’s model
// - -------- NVIC_DFR0 : (NVIC Offset: 0xd48) Debug Feature register0 (ID_DFR0) -------- 
AT91C_NVIC_ID_DFR0_MODEL  EQU (0xF << 20) ;- (NVIC) Microcontroller Debug Model – memory mapped
// - -------- NVIC_MMFR0 : (NVIC Offset: 0xd50) Memory Model Feature register0 (ID_MMFR0) -------- 
AT91C_NVIC_ID_MMFR0_PMSA  EQU (0xF <<  4) ;- (NVIC) Microcontroller Debug Model – memory mapped
AT91C_NVIC_ID_MMFR0_CACHE EQU (0xF <<  8) ;- (NVIC) Microcontroller Debug Model – memory mapped

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR NESTED vector Interrupt Controller
// - *****************************************************************************
// - -------- MPU_TYPE : (MPU Offset: 0x0)  -------- 
AT91C_MPU_SEPARATE        EQU (0x1 <<  0) ;- (MPU) 
AT91C_MPU_DREGION         EQU (0xFF <<  8) ;- (MPU) 
AT91C_MPU_IREGION         EQU (0xFF << 16) ;- (MPU) 
// - -------- MPU_CTRL : (MPU Offset: 0x4)  -------- 
AT91C_MPU_ENABLE          EQU (0x1 <<  0) ;- (MPU) 
AT91C_MPU_HFNMIENA        EQU (0x1 <<  1) ;- (MPU) 
AT91C_MPU_PRIVDEFENA      EQU (0x1 <<  2) ;- (MPU) 
// - -------- MPU_REG_NB : (MPU Offset: 0x8)  -------- 
AT91C_MPU_REGION          EQU (0xFF <<  0) ;- (MPU) 
// - -------- MPU_REG_BASE_ADDR : (MPU Offset: 0xc)  -------- 
AT91C_MPU_REG             EQU (0xF <<  0) ;- (MPU) 
AT91C_MPU_VALID           EQU (0x1 <<  4) ;- (MPU) 
AT91C_MPU_ADDR            EQU (0x3FFFFFF <<  5) ;- (MPU) 
// - -------- MPU_ATTR_SIZE : (MPU Offset: 0x10)  -------- 
AT91C_MPU_ENA             EQU (0x1 <<  0) ;- (MPU) 
AT91C_MPU_SIZE            EQU (0xF <<  1) ;- (MPU) 
AT91C_MPU_SRD             EQU (0xFF <<  8) ;- (MPU) 
AT91C_MPU_B               EQU (0x1 << 16) ;- (MPU) 
AT91C_MPU_C               EQU (0x1 << 17) ;- (MPU) 
AT91C_MPU_S               EQU (0x1 << 18) ;- (MPU) 
AT91C_MPU_TEX             EQU (0x7 << 19) ;- (MPU) 
AT91C_MPU_AP              EQU (0x7 << 24) ;- (MPU) 
AT91C_MPU_XN              EQU (0x7 << 28) ;- (MPU) 

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR CORTEX_M3 Registers
// - *****************************************************************************
// - -------- CM3_CPUID : (CM3 Offset: 0x0)  -------- 
// - -------- CM3_AIRCR : (CM3 Offset: 0xc)  -------- 
AT91C_CM3_SYSRESETREQ     EQU (0x1 <<  2) ;- (CM3) A reset is requested by the processor.
// - -------- CM3_SCR : (CM3 Offset: 0x10)  -------- 
AT91C_CM3_SLEEPONEXIT     EQU (0x1 <<  1) ;- (CM3) Sleep on exit when returning from Handler mode to Thread mode. Enables interrupt driven applications to avoid returning to empty main application.
AT91C_CM3_SLEEPDEEP       EQU (0x1 <<  2) ;- (CM3) Sleep deep bit.
AT91C_CM3_SEVONPEND       EQU (0x1 <<  4) ;- (CM3) When enabled, this causes WFE to wake up when an interrupt moves from inactive to pended.
// - -------- CM3_SHCSR : (CM3 Offset: 0x24)  -------- 
AT91C_CM3_SYSTICKACT      EQU (0x1 << 11) ;- (CM3) Reads as 1 if SysTick is active.

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Peripheral DMA Controller
// - *****************************************************************************
// - -------- PDC_PTCR : (PDC Offset: 0x20) PDC Transfer Control Register -------- 
AT91C_PDC_RXTEN           EQU (0x1 <<  0) ;- (PDC) Receiver Transfer Enable
AT91C_PDC_RXTDIS          EQU (0x1 <<  1) ;- (PDC) Receiver Transfer Disable
AT91C_PDC_TXTEN           EQU (0x1 <<  8) ;- (PDC) Transmitter Transfer Enable
AT91C_PDC_TXTDIS          EQU (0x1 <<  9) ;- (PDC) Transmitter Transfer Disable
// - -------- PDC_PTSR : (PDC Offset: 0x24) PDC Transfer Status Register -------- 

