una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u4.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Debug Unit
// - *****************************************************************************
// - -------- DBGU_CR : (DBGU Offset: 0x0) Debug Unit Control Register -------- 
AT91C_DBGU_RSTRX          EQU (0x1 <<  2) ;- (DBGU) Reset Receiver
AT91C_DBGU_RSTTX          EQU (0x1 <<  3) ;- (DBGU) Reset Transmitter
AT91C_DBGU_RXEN           EQU (0x1 <<  4) ;- (DBGU) Receiver Enable
AT91C_DBGU_RXDIS          EQU (0x1 <<  5) ;- (DBGU) Receiver Disable
AT91C_DBGU_TXEN           EQU (0x1 <<  6) ;- (DBGU) Transmitter Enable
AT91C_DBGU_TXDIS          EQU (0x1 <<  7) ;- (DBGU) Transmitter Disable
AT91C_DBGU_RSTSTA         EQU (0x1 <<  8) ;- (DBGU) Reset Status Bits
// - -------- DBGU_MR : (DBGU Offset: 0x4) Debug Unit Mode Register -------- 
AT91C_DBGU_PAR            EQU (0x7 <<  9) ;- (DBGU) Parity type
AT91C_DBGU_PAR_EVEN       EQU (0x0 <<  9) ;- (DBGU) Even Parity
AT91C_DBGU_PAR_ODD        EQU (0x1 <<  9) ;- (DBGU) Odd Parity
AT91C_DBGU_PAR_SPACE      EQU (0x2 <<  9) ;- (DBGU) Parity forced to 0 (Space)
AT91C_DBGU_PAR_MARK       EQU (0x3 <<  9) ;- (DBGU) Parity forced to 1 (Mark)
AT91C_DBGU_PAR_NONE       EQU (0x4 <<  9) ;- (DBGU) No Parity
AT91C_DBGU_CHMODE         EQU (0x3 << 14) ;- (DBGU) Channel Mode
AT91C_DBGU_CHMODE_NORMAL  EQU (0x0 << 14) ;- (DBGU) Normal Mode: The debug unit channel operates as an RX/TX debug unit.
AT91C_DBGU_CHMODE_AUTO    EQU (0x1 << 14) ;- (DBGU) Automatic Echo: Receiver Data Input is connected to the TXD pin.
AT91C_DBGU_CHMODE_LOCAL   EQU (0x2 << 14) ;- (DBGU) Local Loopback: Transmitter Output Signal is connected to Receiver Input Signal.
AT91C_DBGU_CHMODE_REMOTE  EQU (0x3 << 14) ;- (DBGU) Remote Loopback: RXD pin is internally connected to TXD pin.
// - -------- DBGU_IER : (DBGU Offset: 0x8) Debug Unit Interrupt Enable Register -------- 
AT91C_DBGU_RXRDY          EQU (0x1 <<  0) ;- (DBGU) RXRDY Interrupt
AT91C_DBGU_TXRDY          EQU (0x1 <<  1) ;- (DBGU) TXRDY Interrupt
AT91C_DBGU_ENDRX          EQU (0x1 <<  3) ;- (DBGU) End of Receive Transfer Interrupt
AT91C_DBGU_ENDTX          EQU (0x1 <<  4) ;- (DBGU) End of Transmit Interrupt
AT91C_DBGU_OVRE           EQU (0x1 <<  5) ;- (DBGU) Overrun Interrupt
AT91C_DBGU_FRAME          EQU (0x1 <<  6) ;- (DBGU) Framing Error Interrupt
AT91C_DBGU_PARE           EQU (0x1 <<  7) ;- (DBGU) Parity Error Interrupt
AT91C_DBGU_TXEMPTY        EQU (0x1 <<  9) ;- (DBGU) TXEMPTY Interrupt
AT91C_DBGU_TXBUFE         EQU (0x1 << 11) ;- (DBGU) TXBUFE Interrupt
AT91C_DBGU_RXBUFF         EQU (0x1 << 12) ;- (DBGU) RXBUFF Interrupt
AT91C_DBGU_COMM_TX        EQU (0x1 << 30) ;- (DBGU) COMM_TX Interrupt
AT91C_DBGU_COMM_RX        EQU (0x1 << 31) ;- (DBGU) COMM_RX Interrupt
// - -------- DBGU_IDR : (DBGU Offset: 0xc) Debug Unit Interrupt Disable Register -------- 
// - -------- DBGU_IMR : (DBGU Offset: 0x10) Debug Unit Interrupt Mask Register -------- 
// - -------- DBGU_CSR : (DBGU Offset: 0x14) Debug Unit Channel Status Register -------- 
// - -------- DBGU_FNTR : (DBGU Offset: 0x48) Debug Unit FORCE_NTRST Register -------- 
AT91C_DBGU_FORCE_NTRST    EQU (0x1 <<  0) ;- (DBGU) Force NTRST in JTAG

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Parallel Input Output Controler
// - *****************************************************************************
// - -------- PIO_KER : (PIO Offset: 0x120) Keypad Controller Enable Register -------- 
AT91C_PIO_KCE             EQU (0x1 <<  0) ;- (PIO) Keypad Controller Enable
// - -------- PIO_KRCR : (PIO Offset: 0x124) Keypad Controller Row Column Register -------- 
AT91C_PIO_NBR             EQU (0x7 <<  0) ;- (PIO) Number of Columns of the Keypad Matrix
AT91C_PIO_NBC             EQU (0x7 <<  8) ;- (PIO) Number of Rows of the Keypad Matrix
// - -------- PIO_KDR : (PIO Offset: 0x128) Keypad Controller Debouncing Register -------- 
AT91C_PIO_DBC             EQU (0x3FF <<  0) ;- (PIO) Debouncing Value
// - -------- PIO_KIER : (PIO Offset: 0x130) Keypad Controller Interrupt Enable Register -------- 
AT91C_PIO_KPR             EQU (0x1 <<  0) ;- (PIO) Key Press Interrupt Enable
AT91C_PIO_KRL             EQU (0x1 <<  1) ;- (PIO) Key Release Interrupt Enable
// - -------- PIO_KIDR : (PIO Offset: 0x134) Keypad Controller Interrupt Disable Register -------- 
// - -------- PIO_KIMR : (PIO Offset: 0x138) Keypad Controller Interrupt Mask Register -------- 
// - -------- PIO_KSR : (PIO Offset: 0x13c) Keypad Controller Status Register -------- 
AT91C_PIO_NBKPR           EQU (0x3 <<  8) ;- (PIO) Number of Simultaneous Key Presses
AT91C_PIO_NBKRL           EQU (0x3 << 16) ;- (PIO) Number of Simultaneous Key Releases
// - -------- PIO_KKPR : (PIO Offset: 0x140) Keypad Controller Key Press Register -------- 
AT91C_KEY0ROW             EQU (0x7 <<  0) ;- (PIO) Row index of the first detected Key Press
AT91C_KEY0COL             EQU (0x7 <<  4) ;- (PIO) Column index of the first detected Key Press
AT91C_KEY1ROW             EQU (0x7 <<  8) ;- (PIO) Row index of the second detected Key Press
AT91C_KEY1COL             EQU (0x7 << 12) ;- (PIO) Column index of the second detected Key Press
AT91C_KEY2ROW             EQU (0x7 << 16) ;- (PIO) Row index of the third detected Key Press
AT91C_KEY2COL             EQU (0x7 << 20) ;- (PIO) Column index of the third detected Key Press
AT91C_KEY3ROW             EQU (0x7 << 24) ;- (PIO) Row index of the fourth detected Key Press
AT91C_KEY3COL             EQU (0x7 << 28) ;- (PIO) Column index of the fourth detected Key Press
// - -------- PIO_KKRR : (PIO Offset: 0x144) Keypad Controller Key Release Register -------- 

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Power Management Controler
// - *****************************************************************************
// - -------- PMC_SCER : (PMC Offset: 0x0) System Clock Enable Register -------- 
AT91C_PMC_PCK             EQU (0x1 <<  0) ;- (PMC) Processor Clock
AT91C_PMC_PCK0            EQU (0x1 <<  8) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK1            EQU (0x1 <<  9) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK2            EQU (0x1 << 10) ;- (PMC) Programmable Clock Output
// - -------- PMC_SCDR : (PMC Offset: 0x4) System Clock Disable Register -------- 
// - -------- PMC_SCSR : (PMC Offset: 0x8) System Clock Status Register -------- 
// - -------- CKGR_UCKR : (PMC Offset: 0x1c) UTMI Clock Configuration Register -------- 
AT91C_CKGR_UPLLEN         EQU (0x1 << 16) ;- (PMC) UTMI PLL Enable
AT91C_CKGR_UPLLEN_DISABLED EQU (0x0 << 16) ;- (PMC) The UTMI PLL is disabled
AT91C_CKGR_UPLLEN_ENABLED EQU (0x1 << 16) ;- (PMC) The UTMI PLL is enabled
AT91C_CKGR_UPLLCOUNT      EQU (0xF << 20) ;- (PMC) UTMI Oscillator Start-up Time
AT91C_CKGR_BIASEN         EQU (0x1 << 24) ;- (PMC) UTMI BIAS Enable
AT91C_CKGR_BIASEN_DISABLED EQU (0x0 << 24) ;- (PMC) The UTMI BIAS is disabled
AT91C_CKGR_BIASEN_ENABLED EQU (0x1 << 24) ;- (PMC) The UTMI BIAS is enabled
AT91C_CKGR_BIASCOUNT      EQU (0xF << 28) ;- (PMC) UTMI BIAS Start-up Time
// - -------- CKGR_MOR : (PMC Offset: 0x20) Main Oscillator Register -------- 
AT91C_CKGR_MOSCXTEN       EQU (0x1 <<  0) ;- (PMC) Main Crystal Oscillator Enable
AT91C_CKGR_MOSCXTBY       EQU (0x1 <<  1) ;- (PMC) Main Crystal Oscillator Bypass
AT91C_CKGR_WAITMODE       EQU (0x1 <<  2) ;- (PMC) Main Crystal Oscillator Bypass
AT91C_CKGR_MOSCRCEN       EQU (0x1 <<  3) ;- (PMC) Main On-Chip RC Oscillator Enable
AT91C_CKGR_MOSCRCF        EQU (0x7 <<  4) ;- (PMC) Main On-Chip RC Oscillator Frequency Selection
AT91C_CKGR_MOSCXTST       EQU (0xFF <<  8) ;- (PMC) Main Crystal Oscillator Start-up Time
AT91C_CKGR_KEY            EQU (0xFF << 16) ;- (PMC) Clock Generator Controller Writing Protection Key
AT91C_CKGR_MOSCSEL        EQU (0x1 << 24) ;- (PMC) Main Oscillator Selection
AT91C_CKGR_CFDEN          EQU (0x1 << 25) ;- (PMC) Clock Failure Detector Enable
// - -------- CKGR_MCFR : (PMC Offset: 0x24) Main Clock Frequency Register -------- 
AT91C_CKGR_MAINF          EQU (0xFFFF <<  0) ;- (PMC) Main Clock Frequency
AT91C_CKGR_MAINRDY        EQU (0x1 << 16) ;- (PMC) Main Clock Ready
// - -------- CKGR_PLLAR : (PMC Offset: 0x28) PLL A Register -------- 
AT91C_CKGR_DIVA           EQU (0xFF <<  0) ;- (PMC) Divider Selected
AT91C_CKGR_DIVA_0         EQU (0x0) ;- (PMC) Divider output is 0
AT91C_CKGR_DIVA_BYPASS    EQU (0x1) ;- (PMC) Divider is bypassed
AT91C_CKGR_PLLACOUNT      EQU (0x3F <<  8) ;- (PMC) PLLA Counter
AT91C_CKGR_STMODE         EQU (0x3 << 14) ;- (PMC) Start Mode
AT91C_CKGR_STMODE_0       EQU (0x0 << 14) ;- (PMC) Fast startup
AT91C_CKGR_STMODE_1       EQU (0x1 << 14) ;- (PMC) Reserved
AT91C_CKGR_STMODE_2       EQU (0x2 << 14) ;- (PMC) Normal startup
AT91C_CKGR_STMODE_3       EQU (0x3 << 14) ;- (PMC) Reserved
AT91C_CKGR_MULA           EQU (0x7FF << 16) ;- (PMC) PLL Multiplier
AT91C_CKGR_SRC            EQU (0x1 << 29) ;- (PMC) 
// - -------- PMC_MCKR : (PMC Offset: 0x30) Master Clock Register -------- 
AT91C_PMC_CSS             EQU (0x7 <<  0) ;- (PMC) Programmable Clock Selection
AT91C_PMC_CSS_SLOW_CLK    EQU (0x0) ;- (PMC) Slow Clock is selected
AT91C_PMC_CSS_MAIN_CLK    EQU (0x1) ;- (PMC) Main Clock is selected
AT91C_PMC_CSS_PLLA_CLK    EQU (0x2) ;- (PMC) Clock from PLL A is selected
AT91C_PMC_CSS_UPLL_CLK    EQU (0x3) ;- (PMC) Clock from UPLL is selected
AT91C_PMC_CSS_SYS_CLK     EQU (0x4) ;- (PMC) System clock is selected
AT91C_PMC_PRES            EQU (0x7 <<  4) ;- (PMC) Programmable Clock Prescaler
AT91C_PMC_PRES_CLK        EQU (0x0 <<  4) ;- (PMC) Selected clock
AT91C_PMC_PRES_CLK_2      EQU (0x1 <<  4) ;- (PMC) Selected clock divided by 2
AT91C_PMC_PRES_CLK_4      EQU (0x2 <<  4) ;- (PMC) Selected clock divided by 4
AT91C_PMC_PRES_CLK_8      EQU (0x3 <<  4) ;- (PMC) Selected clock divided by 8
AT91C_PMC_PRES_CLK_16     EQU (0x4 <<  4) ;- (PMC) Selected clock divided by 16
AT91C_PMC_PRES_CLK_32     EQU (0x5 <<  4) ;- (PMC) Selected clock divided by 32
AT91C_PMC_PRES_CLK_64     EQU (0x6 <<  4) ;- (PMC) Selected clock divided by 64
AT91C_PMC_PRES_CLK_3      EQU (0x7 <<  4) ;- (PMC) Selected clock divided by 3
// - -------- PMC_PCKR : (PMC Offset: 0x40) Programmable Clock Register -------- 
// - -------- PMC_IER : (PMC Offset: 0x60) PMC Interrupt Enable Register -------- 
AT91C_PMC_MOSCXTS         EQU (0x1 <<  0) ;- (PMC) Main Crystal Oscillator Status/Enable/Disable/Mask
AT91C_PMC_LOCKA           EQU (0x1 <<  1) ;- (PMC) PLL A Status/Enable/Disable/Mask
AT91C_PMC_MCKRDY          EQU (0x1 <<  3) ;- (PMC) Master Clock Status/Enable/Disable/Mask
AT91C_PMC_LOCKU           EQU (0x1 <<  6) ;- (PMC) PLL UTMI Status/Enable/Disable/Mask
AT91C_PMC_PCKRDY0         EQU (0x1 <<  8) ;- (PMC) PCK0_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCKRDY1         EQU (0x1 <<  9) ;- (PMC) PCK1_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCKRDY2         EQU (0x1 << 10) ;- (PMC) PCK2_RDY Status/Enable/Disable/Mask
AT91C_PMC_MOSCSELS        EQU (0x1 << 16) ;- (PMC) Main Oscillator Selection Status
AT91C_PMC_MOSCRCS         EQU (0x1 << 17) ;- (PMC) Main On-Chip RC Oscillator Status
AT91C_PMC_CFDEV           EQU (0x1 << 18) ;- (PMC) Clock Failure Detector Event
// - -------- PMC_IDR : (PMC Offset: 0x64) PMC Interrupt Disable Register -------- 
// - -------- PMC_SR : (PMC Offset: 0x68) PMC Status Register -------- 
AT91C_PMC_OSCSELS         EQU (0x1 <<  7) ;- (PMC) Slow Clock Oscillator Selection
AT91C_PMC_CFDS            EQU (0x1 << 19) ;- (PMC) Clock Failure Detector Status
AT91C_PMC_FOS             EQU (0x1 << 20) ;- (PMC) Clock Failure Detector Fault Output Status
// - -------- PMC_IMR : (PMC Offset: 0x6c) PMC Interrupt Mask Register -------- 
// - -------- PMC_FSMR : (PMC Offset: 0x70) Fast Startup Mode Register -------- 
AT91C_PMC_FSTT            EQU (0xFFFF <<  0) ;- (PMC) Fast Start-up Input Enable 0 to 15
AT91C_PMC_RTTAL           EQU (0x1 << 16) ;- (PMC) RTT Alarm Enable
AT91C_PMC_RTCAL           EQU (0x1 << 17) ;- (PMC) RTC Alarm Enable
AT91C_PMC_USBAL           EQU (0x1 << 18) ;- (PMC) USB Alarm Enable
AT91C_PMC_LPM             EQU (0x1 << 20) ;- (PMC) Low Power Mode
// - -------- PMC_FSPR : (PMC Offset: 0x74) Fast Startup Polarity Register -------- 
AT91C_PMC_FSTP            EQU (0xFFFF <<  0) ;- (PMC) Fast Start-up Input Polarity 0 to 15
// - -------- PMC_FOCR : (PMC Offset: 0x78) Fault Output Clear Register -------- 
AT91C_PMC_FOCLR           EQU (0x1 <<  0) ;- (PMC) Fault Output Clear

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Clock Generator Controler
// - *****************************************************************************
// - -------- CKGR_UCKR : (CKGR Offset: 0x0) UTMI Clock Configuration Register -------- 
// - -------- CKGR_MOR : (CKGR Offset: 0x4) Main Oscillator Register -------- 
// - -------- CKGR_MCFR : (CKGR Offset: 0x8) Main Clock Frequency Register -------- 
// - -------- CKGR_PLLAR : (CKGR Offset: 0xc) PLL A Register -------- 

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Reset Controller Interface
// - *****************************************************************************
// - -------- RSTC_RCR : (RSTC Offset: 0x0) Reset Control Register -------- 
AT91C_RSTC_PROCRST        EQU (0x1 <<  0) ;- (RSTC) Processor Reset
AT91C_RSTC_ICERST         EQU (0x1 <<  1) ;- (RSTC) ICE Interface Reset
AT91C_RSTC_PERRST         EQU (0x1 <<  2) ;- (RSTC) Peripheral Reset
AT91C_RSTC_EXTRST         EQU (0x1 <<  3) ;- (RSTC) External Reset
AT91C_RSTC_KEY            EQU (0xFF << 24) ;- (RSTC) Password
// - -------- RSTC_RSR : (RSTC Offset: 0x4) Reset Status Register -------- 
AT91C_RSTC_URSTS          EQU (0x1 <<  0) ;- (RSTC) User Reset Status
AT91C_RSTC_RSTTYP         EQU (0x7 <<  8) ;- (RSTC) Reset Type
AT91C_RSTC_RSTTYP_GENERAL EQU (0x0 <<  8) ;- (RSTC) General reset. Both VDDCORE and VDDBU rising.
AT91C_RSTC_RSTTYP_WAKEUP  EQU (0x1 <<  8) ;- (RSTC) WakeUp Reset. VDDCORE rising.
AT91C_RSTC_RSTTYP_WATCHDOG EQU (0x2 <<  8) ;- (RSTC) Watchdog Reset. Watchdog overflow occured.
AT91C_RSTC_RSTTYP_SOFTWARE EQU (0x3 <<  8) ;- (RSTC) Software Reset. Processor reset required by the software.
AT91C_RSTC_RSTTYP_USER    EQU (0x4 <<  8) ;- (RSTC) User Reset. NRST pin detected low.
AT91C_RSTC_NRSTL          EQU (0x1 << 16) ;- (RSTC) NRST pin level
AT91C_RSTC_SRCMP          EQU (0x1 << 17) ;- (RSTC) Software Reset Command in Progress.
// - -------- RSTC_RMR : (RSTC Offset: 0x8) Reset Mode Register -------- 
AT91C_RSTC_URSTEN         EQU (0x1 <<  0) ;- (RSTC) User Reset Enable
AT91C_RSTC_URSTIEN        EQU (0x1 <<  4) ;- (RSTC) User Reset Interrupt Enable
AT91C_RSTC_ERSTL          EQU (0xF <<  8) ;- (RSTC) User Reset Enable

