una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u4.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Pulse Width Modulation Controller Interface
// - *****************************************************************************
// - -------- PWMC_MR : (PWMC Offset: 0x0) PWMC Mode Register -------- 
AT91C_PWMC_DIVA           EQU (0xFF <<  0) ;- (PWMC) CLKA divide factor.
AT91C_PWMC_PREA           EQU (0xF <<  8) ;- (PWMC) Divider Input Clock Prescaler A
AT91C_PWMC_PREA_MCK       EQU (0x0 <<  8) ;- (PWMC) 
AT91C_PWMC_PREA_MCK_DIV_2 EQU (0x1 <<  8) ;- (PWMC) 
AT91C_PWMC_PREA_MCK_DIV_4 EQU (0x2 <<  8) ;- (PWMC) 
AT91C_PWMC_PREA_MCK_DIV_8 EQU (0x3 <<  8) ;- (PWMC) 
AT91C_PWMC_PREA_MCK_DIV_16 EQU (0x4 <<  8) ;- (PWMC) 
AT91C_PWMC_PREA_MCK_DIV_32 EQU (0x5 <<  8) ;- (PWMC) 
AT91C_PWMC_PREA_MCK_DIV_64 EQU (0x6 <<  8) ;- (PWMC) 
AT91C_PWMC_PREA_MCK_DIV_128 EQU (0x7 <<  8) ;- (PWMC) 
AT91C_PWMC_PREA_MCK_DIV_256 EQU (0x8 <<  8) ;- (PWMC) 
AT91C_PWMC_DIVB           EQU (0xFF << 16) ;- (PWMC) CLKB divide factor.
AT91C_PWMC_PREB           EQU (0xF << 24) ;- (PWMC) Divider Input Clock Prescaler B
AT91C_PWMC_PREB_MCK       EQU (0x0 << 24) ;- (PWMC) 
AT91C_PWMC_PREB_MCK_DIV_2 EQU (0x1 << 24) ;- (PWMC) 
AT91C_PWMC_PREB_MCK_DIV_4 EQU (0x2 << 24) ;- (PWMC) 
AT91C_PWMC_PREB_MCK_DIV_8 EQU (0x3 << 24) ;- (PWMC) 
AT91C_PWMC_PREB_MCK_DIV_16 EQU (0x4 << 24) ;- (PWMC) 
AT91C_PWMC_PREB_MCK_DIV_32 EQU (0x5 << 24) ;- (PWMC) 
AT91C_PWMC_PREB_MCK_DIV_64 EQU (0x6 << 24) ;- (PWMC) 
AT91C_PWMC_PREB_MCK_DIV_128 EQU (0x7 << 24) ;- (PWMC) 
AT91C_PWMC_PREB_MCK_DIV_256 EQU (0x8 << 24) ;- (PWMC) 
AT91C_PWMC_CLKSEL         EQU (0x1 << 31) ;- (PWMC) CCK Source Clock Selection
// - -------- PWMC_ENA : (PWMC Offset: 0x4) PWMC Enable Register -------- 
AT91C_PWMC_CHID0          EQU (0x1 <<  0) ;- (PWMC) Channel ID 0
AT91C_PWMC_CHID1          EQU (0x1 <<  1) ;- (PWMC) Channel ID 1
AT91C_PWMC_CHID2          EQU (0x1 <<  2) ;- (PWMC) Channel ID 2
AT91C_PWMC_CHID3          EQU (0x1 <<  3) ;- (PWMC) Channel ID 3
AT91C_PWMC_CHID4          EQU (0x1 <<  4) ;- (PWMC) Channel ID 4
AT91C_PWMC_CHID5          EQU (0x1 <<  5) ;- (PWMC) Channel ID 5
AT91C_PWMC_CHID6          EQU (0x1 <<  6) ;- (PWMC) Channel ID 6
AT91C_PWMC_CHID7          EQU (0x1 <<  7) ;- (PWMC) Channel ID 7
AT91C_PWMC_CHID8          EQU (0x1 <<  8) ;- (PWMC) Channel ID 8
AT91C_PWMC_CHID9          EQU (0x1 <<  9) ;- (PWMC) Channel ID 9
AT91C_PWMC_CHID10         EQU (0x1 << 10) ;- (PWMC) Channel ID 10
AT91C_PWMC_CHID11         EQU (0x1 << 11) ;- (PWMC) Channel ID 11
AT91C_PWMC_CHID12         EQU (0x1 << 12) ;- (PWMC) Channel ID 12
AT91C_PWMC_CHID13         EQU (0x1 << 13) ;- (PWMC) Channel ID 13
AT91C_PWMC_CHID14         EQU (0x1 << 14) ;- (PWMC) Channel ID 14
AT91C_PWMC_CHID15         EQU (0x1 << 15) ;- (PWMC) Channel ID 15
// - -------- PWMC_DIS : (PWMC Offset: 0x8) PWMC Disable Register -------- 
// - -------- PWMC_SR : (PWMC Offset: 0xc) PWMC Status Register -------- 
// - -------- PWMC_IER1 : (PWMC Offset: 0x10) PWMC Interrupt Enable Register -------- 
AT91C_PWMC_FCHID0         EQU (0x1 << 16) ;- (PWMC) Fault Event Channel ID 0
AT91C_PWMC_FCHID1         EQU (0x1 << 17) ;- (PWMC) Fault Event Channel ID 1
AT91C_PWMC_FCHID2         EQU (0x1 << 18) ;- (PWMC) Fault Event Channel ID 2
AT91C_PWMC_FCHID3         EQU (0x1 << 19) ;- (PWMC) Fault Event Channel ID 3
AT91C_PWMC_FCHID4         EQU (0x1 << 20) ;- (PWMC) Fault Event Channel ID 4
AT91C_PWMC_FCHID5         EQU (0x1 << 21) ;- (PWMC) Fault Event Channel ID 5
AT91C_PWMC_FCHID6         EQU (0x1 << 22) ;- (PWMC) Fault Event Channel ID 6
AT91C_PWMC_FCHID7         EQU (0x1 << 23) ;- (PWMC) Fault Event Channel ID 7
AT91C_PWMC_FCHID8         EQU (0x1 << 24) ;- (PWMC) Fault Event Channel ID 8
AT91C_PWMC_FCHID9         EQU (0x1 << 25) ;- (PWMC) Fault Event Channel ID 9
AT91C_PWMC_FCHID10        EQU (0x1 << 26) ;- (PWMC) Fault Event Channel ID 10
AT91C_PWMC_FCHID11        EQU (0x1 << 27) ;- (PWMC) Fault Event Channel ID 11
AT91C_PWMC_FCHID12        EQU (0x1 << 28) ;- (PWMC) Fault Event Channel ID 12
AT91C_PWMC_FCHID13        EQU (0x1 << 29) ;- (PWMC) Fault Event Channel ID 13
AT91C_PWMC_FCHID14        EQU (0x1 << 30) ;- (PWMC) Fault Event Channel ID 14
AT91C_PWMC_FCHID15        EQU (0x1 << 31) ;- (PWMC) Fault Event Channel ID 15
// - -------- PWMC_IDR1 : (PWMC Offset: 0x14) PWMC Interrupt Disable Register -------- 
// - -------- PWMC_IMR1 : (PWMC Offset: 0x18) PWMC Interrupt Mask Register -------- 
// - -------- PWMC_ISR1 : (PWMC Offset: 0x1c) PWMC Interrupt Status Register -------- 
// - -------- PWMC_SYNC : (PWMC Offset: 0x20) PWMC Synchronous Channels Register -------- 
AT91C_PWMC_SYNC0          EQU (0x1 <<  0) ;- (PWMC) Synchronous Channel ID 0
AT91C_PWMC_SYNC1          EQU (0x1 <<  1) ;- (PWMC) Synchronous Channel ID 1
AT91C_PWMC_SYNC2          EQU (0x1 <<  2) ;- (PWMC) Synchronous Channel ID 2
AT91C_PWMC_SYNC3          EQU (0x1 <<  3) ;- (PWMC) Synchronous Channel ID 3
AT91C_PWMC_SYNC4          EQU (0x1 <<  4) ;- (PWMC) Synchronous Channel ID 4
AT91C_PWMC_SYNC5          EQU (0x1 <<  5) ;- (PWMC) Synchronous Channel ID 5
AT91C_PWMC_SYNC6          EQU (0x1 <<  6) ;- (PWMC) Synchronous Channel ID 6
AT91C_PWMC_SYNC7          EQU (0x1 <<  7) ;- (PWMC) Synchronous Channel ID 7
AT91C_PWMC_SYNC8          EQU (0x1 <<  8) ;- (PWMC) Synchronous Channel ID 8
AT91C_PWMC_SYNC9          EQU (0x1 <<  9) ;- (PWMC) Synchronous Channel ID 9
AT91C_PWMC_SYNC10         EQU (0x1 << 10) ;- (PWMC) Synchronous Channel ID 10
AT91C_PWMC_SYNC11         EQU (0x1 << 11) ;- (PWMC) Synchronous Channel ID 11
AT91C_PWMC_SYNC12         EQU (0x1 << 12) ;- (PWMC) Synchronous Channel ID 12
AT91C_PWMC_SYNC13         EQU (0x1 << 13) ;- (PWMC) Synchronous Channel ID 13
AT91C_PWMC_SYNC14         EQU (0x1 << 14) ;- (PWMC) Synchronous Channel ID 14
AT91C_PWMC_SYNC15         EQU (0x1 << 15) ;- (PWMC) Synchronous Channel ID 15
AT91C_PWMC_UPDM           EQU (0x3 << 16) ;- (PWMC) Synchronous Channels Update mode
AT91C_PWMC_UPDM_MODE0     EQU (0x0 << 16) ;- (PWMC) Manual write of data and manual trigger of the update
AT91C_PWMC_UPDM_MODE1     EQU (0x1 << 16) ;- (PWMC) Manual write of data and automatic trigger of the update
AT91C_PWMC_UPDM_MODE2     EQU (0x2 << 16) ;- (PWMC) Automatic write of data and automatic trigger of the update
// - -------- PWMC_UPCR : (PWMC Offset: 0x28) PWMC Update Control Register -------- 
AT91C_PWMC_UPDULOCK       EQU (0x1 <<  0) ;- (PWMC) Synchronized Channels Duty Cycle Update Unlock
// - -------- PWMC_SCUP : (PWMC Offset: 0x2c) PWM Update Period Register -------- 
AT91C_PWMC_UPR            EQU (0xF <<  0) ;- (PWMC) PWM Update Period.
AT91C_PWMC_UPRCNT         EQU (0xF <<  4) ;- (PWMC) PWM Update Period Counter.
// - -------- PWMC_SCUPUPD : (PWMC Offset: 0x30) PWM Update Period Update Register -------- 
AT91C_PWMC_UPVUPDAL       EQU (0xF <<  0) ;- (PWMC) PWM Update Period Update.
// - -------- PWMC_IER2 : (PWMC Offset: 0x34) PWMC Interrupt Enable Register -------- 
AT91C_PWMC_WRDY           EQU (0x1 <<  0) ;- (PWMC) PDC Write Ready
AT91C_PWMC_ENDTX          EQU (0x1 <<  1) ;- (PWMC) PDC End of TX Buffer
AT91C_PWMC_TXBUFE         EQU (0x1 <<  2) ;- (PWMC) PDC End of TX Buffer
AT91C_PWMC_UNRE           EQU (0x1 <<  3) ;- (PWMC) PDC End of TX Buffer
// - -------- PWMC_IDR2 : (PWMC Offset: 0x38) PWMC Interrupt Disable Register -------- 
// - -------- PWMC_IMR2 : (PWMC Offset: 0x3c) PWMC Interrupt Mask Register -------- 
// - -------- PWMC_ISR2 : (PWMC Offset: 0x40) PWMC Interrupt Status Register -------- 
AT91C_PWMC_CMPM0          EQU (0x1 <<  8) ;- (PWMC) Comparison x Match
AT91C_PWMC_CMPM1          EQU (0x1 <<  9) ;- (PWMC) Comparison x Match
AT91C_PWMC_CMPM2          EQU (0x1 << 10) ;- (PWMC) Comparison x Match
AT91C_PWMC_CMPM3          EQU (0x1 << 11) ;- (PWMC) Comparison x Match
AT91C_PWMC_CMPM4          EQU (0x1 << 12) ;- (PWMC) Comparison x Match
AT91C_PWMC_CMPM5          EQU (0x1 << 13) ;- (PWMC) Comparison x Match
AT91C_PWMC_CMPM6          EQU (0x1 << 14) ;- (PWMC) Comparison x Match
AT91C_PWMC_CMPM7          EQU (0x1 << 15) ;- (PWMC) Comparison x Match
AT91C_PWMC_CMPU0          EQU (0x1 << 16) ;- (PWMC) Comparison x Update
AT91C_PWMC_CMPU1          EQU (0x1 << 17) ;- (PWMC) Comparison x Update
AT91C_PWMC_CMPU2          EQU (0x1 << 18) ;- (PWMC) Comparison x Update
AT91C_PWMC_CMPU3          EQU (0x1 << 19) ;- (PWMC) Comparison x Update
AT91C_PWMC_CMPU4          EQU (0x1 << 20) ;- (PWMC) Comparison x Update
AT91C_PWMC_CMPU5          EQU (0x1 << 21) ;- (PWMC) Comparison x Update
AT91C_PWMC_CMPU6          EQU (0x1 << 22) ;- (PWMC) Comparison x Update
AT91C_PWMC_CMPU7          EQU (0x1 << 23) ;- (PWMC) Comparison x Update
// - -------- PWMC_OOV : (PWMC Offset: 0x44) PWM Output Override Value Register -------- 
AT91C_PWMC_OOVH0          EQU (0x1 <<  0) ;- (PWMC) Output Override Value for PWMH output of the channel 0
AT91C_PWMC_OOVH1          EQU (0x1 <<  1) ;- (PWMC) Output Override Value for PWMH output of the channel 1
AT91C_PWMC_OOVH2          EQU (0x1 <<  2) ;- (PWMC) Output Override Value for PWMH output of the channel 2
AT91C_PWMC_OOVH3          EQU (0x1 <<  3) ;- (PWMC) Output Override Value for PWMH output of the channel 3
AT91C_PWMC_OOVH4          EQU (0x1 <<  4) ;- (PWMC) Output Override Value for PWMH output of the channel 4
AT91C_PWMC_OOVH5          EQU (0x1 <<  5) ;- (PWMC) Output Override Value for PWMH output of the channel 5
AT91C_PWMC_OOVH6          EQU (0x1 <<  6) ;- (PWMC) Output Override Value for PWMH output of the channel 6
AT91C_PWMC_OOVH7          EQU (0x1 <<  7) ;- (PWMC) Output Override Value for PWMH output of the channel 7
AT91C_PWMC_OOVH8          EQU (0x1 <<  8) ;- (PWMC) Output Override Value for PWMH output of the channel 8
AT91C_PWMC_OOVH9          EQU (0x1 <<  9) ;- (PWMC) Output Override Value for PWMH output of the channel 9
AT91C_PWMC_OOVH10         EQU (0x1 << 10) ;- (PWMC) Output Override Value for PWMH output of the channel 10
AT91C_PWMC_OOVH11         EQU (0x1 << 11) ;- (PWMC) Output Override Value for PWMH output of the channel 11
AT91C_PWMC_OOVH12         EQU (0x1 << 12) ;- (PWMC) Output Override Value for PWMH output of the channel 12
AT91C_PWMC_OOVH13         EQU (0x1 << 13) ;- (PWMC) Output Override Value for PWMH output of the channel 13
AT91C_PWMC_OOVH14         EQU (0x1 << 14) ;- (PWMC) Output Override Value for PWMH output of the channel 14
AT91C_PWMC_OOVH15         EQU (0x1 << 15) ;- (PWMC) Output Override Value for PWMH output of the channel 15
AT91C_PWMC_OOVL0          EQU (0x1 << 16) ;- (PWMC) Output Override Value for PWML output of the channel 0
AT91C_PWMC_OOVL1          EQU (0x1 << 17) ;- (PWMC) Output Override Value for PWML output of the channel 1
AT91C_PWMC_OOVL2          EQU (0x1 << 18) ;- (PWMC) Output Override Value for PWML output of the channel 2
AT91C_PWMC_OOVL3          EQU (0x1 << 19) ;- (PWMC) Output Override Value for PWML output of the channel 3
AT91C_PWMC_OOVL4          EQU (0x1 << 20) ;- (PWMC) Output Override Value for PWML output of the channel 4
AT91C_PWMC_OOVL5          EQU (0x1 << 21) ;- (PWMC) Output Override Value for PWML output of the channel 5
AT91C_PWMC_OOVL6          EQU (0x1 << 22) ;- (PWMC) Output Override Value for PWML output of the channel 6
AT91C_PWMC_OOVL7          EQU (0x1 << 23) ;- (PWMC) Output Override Value for PWML output of the channel 7
AT91C_PWMC_OOVL8          EQU (0x1 << 24) ;- (PWMC) Output Override Value for PWML output of the channel 8
AT91C_PWMC_OOVL9          EQU (0x1 << 25) ;- (PWMC) Output Override Value for PWML output of the channel 9
AT91C_PWMC_OOVL10         EQU (0x1 << 26) ;- (PWMC) Output Override Value for PWML output of the channel 10
AT91C_PWMC_OOVL11         EQU (0x1 << 27) ;- (PWMC) Output Override Value for PWML output of the channel 11
AT91C_PWMC_OOVL12         EQU (0x1 << 28) ;- (PWMC) Output Override Value for PWML output of the channel 12
AT91C_PWMC_OOVL13         EQU (0x1 << 29) ;- (PWMC) Output Override Value for PWML output of the channel 13
AT91C_PWMC_OOVL14         EQU (0x1 << 30) ;- (PWMC) Output Override Value for PWML output of the channel 14
AT91C_PWMC_OOVL15         EQU (0x1 << 31) ;- (PWMC) Output Override Value for PWML output of the channel 15
// - -------- PWMC_OS : (PWMC Offset: 0x48) PWM Output Selection Register -------- 
AT91C_PWMC_OSH0           EQU (0x1 <<  0) ;- (PWMC) Output Selection for PWMH output of the channel 0
AT91C_PWMC_OSH1           EQU (0x1 <<  1) ;- (PWMC) Output Selection for PWMH output of the channel 1
AT91C_PWMC_OSH2           EQU (0x1 <<  2) ;- (PWMC) Output Selection for PWMH output of the channel 2
AT91C_PWMC_OSH3           EQU (0x1 <<  3) ;- (PWMC) Output Selection for PWMH output of the channel 3
AT91C_PWMC_OSH4           EQU (0x1 <<  4) ;- (PWMC) Output Selection for PWMH output of the channel 4
AT91C_PWMC_OSH5           EQU (0x1 <<  5) ;- (PWMC) Output Selection for PWMH output of the channel 5
AT91C_PWMC_OSH6           EQU (0x1 <<  6) ;- (PWMC) Output Selection for PWMH output of the channel 6
AT91C_PWMC_OSH7           EQU (0x1 <<  7) ;- (PWMC) Output Selection for PWMH output of the channel 7
AT91C_PWMC_OSH8           EQU (0x1 <<  8) ;- (PWMC) Output Selection for PWMH output of the channel 8
AT91C_PWMC_OSH9           EQU (0x1 <<  9) ;- (PWMC) Output Selection for PWMH output of the channel 9
AT91C_PWMC_OSH10          EQU (0x1 << 10) ;- (PWMC) Output Selection for PWMH output of the channel 10
AT91C_PWMC_OSH11          EQU (0x1 << 11) ;- (PWMC) Output Selection for PWMH output of the channel 11
AT91C_PWMC_OSH12          EQU (0x1 << 12) ;- (PWMC) Output Selection for PWMH output of the channel 12
AT91C_PWMC_OSH13          EQU (0x1 << 13) ;- (PWMC) Output Selection for PWMH output of the channel 13
AT91C_PWMC_OSH14          EQU (0x1 << 14) ;- (PWMC) Output Selection for PWMH output of the channel 14
AT91C_PWMC_OSH15          EQU (0x1 << 15) ;- (PWMC) Output Selection for PWMH output of the channel 15
AT91C_PWMC_OSL0           EQU (0x1 << 16) ;- (PWMC) Output Selection for PWML output of the channel 0
AT91C_PWMC_OSL1           EQU (0x1 << 17) ;- (PWMC) Output Selection for PWML output of the channel 1
AT91C_PWMC_OSL2           EQU (0x1 << 18) ;- (PWMC) Output Selection for PWML output of the channel 2
AT91C_PWMC_OSL3           EQU (0x1 << 19) ;- (PWMC) Output Selection for PWML output of the channel 3
AT91C_PWMC_OSL4           EQU (0x1 << 20) ;- (PWMC) Output Selection for PWML output of the channel 4
AT91C_PWMC_OSL5           EQU (0x1 << 21) ;- (PWMC) Output Selection for PWML output of the channel 5
AT91C_PWMC_OSL6           EQU (0x1 << 22) ;- (PWMC) Output Selection for PWML output of the channel 6
AT91C_PWMC_OSL7           EQU (0x1 << 23) ;- (PWMC) Output Selection for PWML output of the channel 7
AT91C_PWMC_OSL8           EQU (0x1 << 24) ;- (PWMC) Output Selection for PWML output of the channel 8
AT91C_PWMC_OSL9           EQU (0x1 << 25) ;- (PWMC) Output Selection for PWML output of the channel 9
AT91C_PWMC_OSL10          EQU (0x1 << 26) ;- (PWMC) Output Selection for PWML output of the channel 10
AT91C_PWMC_OSL11          EQU (0x1 << 27) ;- (PWMC) Output Selection for PWML output of the channel 11
AT91C_PWMC_OSL12          EQU (0x1 << 28) ;- (PWMC) Output Selection for PWML output of the channel 12
AT91C_PWMC_OSL13          EQU (0x1 << 29) ;- (PWMC) Output Selection for PWML output of the channel 13
AT91C_PWMC_OSL14          EQU (0x1 << 30) ;- (PWMC) Output Selection for PWML output of the channel 14
AT91C_PWMC_OSL15          EQU (0x1 << 31) ;- (PWMC) Output Selection for PWML output of the channel 15
// - -------- PWMC_OSS : (PWMC Offset: 0x4c) PWM Output Selection Set Register -------- 
AT91C_PWMC_OSSH0          EQU (0x1 <<  0) ;- (PWMC) Output Selection Set for PWMH output of the channel 0
AT91C_PWMC_OSSH1          EQU (0x1 <<  1) ;- (PWMC) Output Selection Set for PWMH output of the channel 1
AT91C_PWMC_OSSH2          EQU (0x1 <<  2) ;- (PWMC) Output Selection Set for PWMH output of the channel 2
AT91C_PWMC_OSSH3          EQU (0x1 <<  3) ;- (PWMC) Output Selection Set for PWMH output of the channel 3
AT91C_PWMC_OSSH4          EQU (0x1 <<  4) ;- (PWMC) Output Selection Set for PWMH output of the channel 4
AT91C_PWMC_OSSH5          EQU (0x1 <<  5) ;- (PWMC) Output Selection Set for PWMH output of the channel 5
AT91C_PWMC_OSSH6          EQU (0x1 <<  6) ;- (PWMC) Output Selection Set for PWMH output of the channel 6
AT91C_PWMC_OSSH7          EQU (0x1 <<  7) ;- (PWMC) Output Selection Set for PWMH output of the channel 7
AT91C_PWMC_OSSH8          EQU (0x1 <<  8) ;- (PWMC) Output Selection Set for PWMH output of the channel 8
AT91C_PWMC_OSSH9          EQU (0x1 <<  9) ;- (PWMC) Output Selection Set for PWMH output of the channel 9
AT91C_PWMC_OSSH10         EQU (0x1 << 10) ;- (PWMC) Output Selection Set for PWMH output of the channel 10
AT91C_PWMC_OSSH11         EQU (0x1 << 11) ;- (PWMC) Output Selection Set for PWMH output of the channel 11
AT91C_PWMC_OSSH12         EQU (0x1 << 12) ;- (PWMC) Output Selection Set for PWMH output of the channel 12
AT91C_PWMC_OSSH13         EQU (0x1 << 13) ;- (PWMC) Output Selection Set for PWMH output of the channel 13
AT91C_PWMC_OSSH14         EQU (0x1 << 14) ;- (PWMC) Output Selection Set for PWMH output of the channel 14
AT91C_PWMC_OSSH15         EQU (0x1 << 15) ;- (PWMC) Output Selection Set for PWMH output of the channel 15
AT91C_PWMC_OSSL0          EQU (0x1 << 16) ;- (PWMC) Output Selection Set for PWML output of the channel 0
AT91C_PWMC_OSSL1          EQU (0x1 << 17) ;- (PWMC) Output Selection Set for PWML output of the channel 1
AT91C_PWMC_OSSL2          EQU (0x1 << 18) ;- (PWMC) Output Selection Set for PWML output of the channel 2
AT91C_PWMC_OSSL3          EQU (0x1 << 19) ;- (PWMC) Output Selection Set for PWML output of the channel 3
AT91C_PWMC_OSSL4          EQU (0x1 << 20) ;- (PWMC) Output Selection Set for PWML output of the channel 4
AT91C_PWMC_OSSL5          EQU (0x1 << 21) ;- (PWMC) Output Selection Set for PWML output of the channel 5
AT91C_PWMC_OSSL6          EQU (0x1 << 22) ;- (PWMC) Output Selection Set for PWML output of the channel 6
AT91C_PWMC_OSSL7          EQU (0x1 << 23) ;- (PWMC) Output Selection Set for PWML output of the channel 7
AT91C_PWMC_OSSL8          EQU (0x1 << 24) ;- (PWMC) Output Selection Set for PWML output of the channel 8
AT91C_PWMC_OSSL9          EQU (0x1 << 25) ;- (PWMC) Output Selection Set for PWML output of the channel 9
AT91C_PWMC_OSSL10         EQU (0x1 << 26) ;- (PWMC) Output Selection Set for PWML output of the channel 10
AT91C_PWMC_OSSL11         EQU (0x1 << 27) ;- (PWMC) Output Selection Set for PWML output of the channel 11
AT91C_PWMC_OSSL12         EQU (0x1 << 28) ;- (PWMC) Output Selection Set for PWML output of the channel 12
AT91C_PWMC_OSSL13         EQU (0x1 << 29) ;- (PWMC) Output Selection Set for PWML output of the channel 13
AT91C_PWMC_OSSL14         EQU (0x1 << 30) ;- (PWMC) Output Selection Set for PWML output of the channel 14
AT91C_PWMC_OSSL15         EQU (0x1 << 31) ;- (PWMC) Output Selection Set for PWML output of the channel 15
// - -------- PWMC_OSC : (PWMC Offset: 0x50) PWM Output Selection Clear Register -------- 
AT91C_PWMC_OSCH0          EQU (0x1 <<  0) ;- (PWMC) Output Selection Clear for PWMH output of the channel 0
AT91C_PWMC_OSCH1          EQU (0x1 <<  1) ;- (PWMC) Output Selection Clear for PWMH output of the channel 1
AT91C_PWMC_OSCH2          EQU (0x1 <<  2) ;- (PWMC) Output Selection Clear for PWMH output of the channel 2
AT91C_PWMC_OSCH3          EQU (0x1 <<  3) ;- (PWMC) Output Selection Clear for PWMH output of the channel 3
AT91C_PWMC_OSCH4          EQU (0x1 <<  4) ;- (PWMC) Output Selection Clear for PWMH output of the channel 4
AT91C_PWMC_OSCH5          EQU (0x1 <<  5) ;- (PWMC) Output Selection Clear for PWMH output of the channel 5
AT91C_PWMC_OSCH6          EQU (0x1 <<  6) ;- (PWMC) Output Selection Clear for PWMH output of the channel 6
AT91C_PWMC_OSCH7          EQU (0x1 <<  7) ;- (PWMC) Output Selection Clear for PWMH output of the channel 7
AT91C_PWMC_OSCH8          EQU (0x1 <<  8) ;- (PWMC) Output Selection Clear for PWMH output of the channel 8
AT91C_PWMC_OSCH9          EQU (0x1 <<  9) ;- (PWMC) Output Selection Clear for PWMH output of the channel 9
AT91C_PWMC_OSCH10         EQU (0x1 << 10) ;- (PWMC) Output Selection Clear for PWMH output of the channel 10
AT91C_PWMC_OSCH11         EQU (0x1 << 11) ;- (PWMC) Output Selection Clear for PWMH output of the channel 11
AT91C_PWMC_OSCH12         EQU (0x1 << 12) ;- (PWMC) Output Selection Clear for PWMH output of the channel 12
AT91C_PWMC_OSCH13         EQU (0x1 << 13) ;- (PWMC) Output Selection Clear for PWMH output of the channel 13
AT91C_PWMC_OSCH14         EQU (0x1 << 14) ;- (PWMC) Output Selection Clear for PWMH output of the channel 14
AT91C_PWMC_OSCH15         EQU (0x1 << 15) ;- (PWMC) Output Selection Clear for PWMH output of the channel 15
AT91C_PWMC_OSCL0          EQU (0x1 << 16) ;- (PWMC) Output Selection Clear for PWML output of the channel 0
AT91C_PWMC_OSCL1          EQU (0x1 << 17) ;- (PWMC) Output Selection Clear for PWML output of the channel 1
AT91C_PWMC_OSCL2          EQU (0x1 << 18) ;- (PWMC) Output Selection Clear for PWML output of the channel 2
AT91C_PWMC_OSCL3          EQU (0x1 << 19) ;- (PWMC) Output Selection Clear for PWML output of the channel 3
AT91C_PWMC_OSCL4          EQU (0x1 << 20) ;- (PWMC) Output Selection Clear for PWML output of the channel 4
AT91C_PWMC_OSCL5          EQU (0x1 << 21) ;- (PWMC) Output Selection Clear for PWML output of the channel 5
AT91C_PWMC_OSCL6          EQU (0x1 << 22) ;- (PWMC) Output Selection Clear for PWML output of the channel 6
AT91C_PWMC_OSCL7          EQU (0x1 << 23) ;- (PWMC) Output Selection Clear for PWML output of the channel 7
AT91C_PWMC_OSCL8          EQU (0x1 << 24) ;- (PWMC) Output Selection Clear for PWML output of the channel 8
AT91C_PWMC_OSCL9          EQU (0x1 << 25) ;- (PWMC) Output Selection Clear for PWML output of the channel 9
AT91C_PWMC_OSCL10         EQU (0x1 << 26) ;- (PWMC) Output Selection Clear for PWML output of the channel 10
AT91C_PWMC_OSCL11         EQU (0x1 << 27) ;- (PWMC) Output Selection Clear for PWML output of the channel 11
AT91C_PWMC_OSCL12         EQU (0x1 << 28) ;- (PWMC) Output Selection Clear for PWML output of the channel 12
AT91C_PWMC_OSCL13         EQU (0x1 << 29) ;- (PWMC) Output Selection Clear for PWML output of the channel 13
AT91C_PWMC_OSCL14         EQU (0x1 << 30) ;- (PWMC) Output Selection Clear for PWML output of the channel 14
AT91C_PWMC_OSCL15         EQU (0x1 << 31) ;- (PWMC) Output Selection Clear for PWML output of the channel 15
// - -------- PWMC_OSSUPD : (PWMC Offset: 0x54) Output Selection Set for PWMH / PWML output of the channel x -------- 
AT91C_PWMC_OSSUPDH0       EQU (0x1 <<  0) ;- (PWMC) Output Selection Set for PWMH output of the channel 0
AT91C_PWMC_OSSUPDH1       EQU (0x1 <<  1) ;- (PWMC) Output Selection Set for PWMH output of the channel 1
AT91C_PWMC_OSSUPDH2       EQU (0x1 <<  2) ;- (PWMC) Output Selection Set for PWMH output of the channel 2
AT91C_PWMC_OSSUPDH3       EQU (0x1 <<  3) ;- (PWMC) Output Selection Set for PWMH output of the channel 3
AT91C_PWMC_OSSUPDH4       EQU (0x1 <<  4) ;- (PWMC) Output Selection Set for PWMH output of the channel 4
AT91C_PWMC_OSSUPDH5       EQU (0x1 <<  5) ;- (PWMC) Output Selection Set for PWMH output of the channel 5
AT91C_PWMC_OSSUPDH6       EQU (0x1 <<  6) ;- (PWMC) Output Selection Set for PWMH output of the channel 6
AT91C_PWMC_OSSUPDH7       EQU (0x1 <<  7) ;- (PWMC) Output Selection Set for PWMH output of the channel 7
AT91C_PWMC_OSSUPDH8       EQU (0x1 <<  8) ;- (PWMC) Output Selection Set for PWMH output of the channel 8
