una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u4.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR HDMA Channel structure
// - *****************************************************************************
// - -------- HDMA_SADDR : (HDMA_CH Offset: 0x0)  -------- 
AT91C_SADDR               EQU (0x0 <<  0) ;- (HDMA_CH) 
// - -------- HDMA_DADDR : (HDMA_CH Offset: 0x4)  -------- 
AT91C_DADDR               EQU (0x0 <<  0) ;- (HDMA_CH) 
// - -------- HDMA_DSCR : (HDMA_CH Offset: 0x8)  -------- 
AT91C_HDMA_DSCR           EQU (0x3FFFFFFF <<  2) ;- (HDMA_CH) Buffer Transfer descriptor address. This address is word aligned.
// - -------- HDMA_CTRLA : (HDMA_CH Offset: 0xc)  -------- 
AT91C_HDMA_BTSIZE         EQU (0xFFFF <<  0) ;- (HDMA_CH) Buffer Transfer Size.
AT91C_HDMA_SCSIZE         EQU (0x1 << 16) ;- (HDMA_CH) Source Chunk Transfer Size.
AT91C_HDMA_SCSIZE_1       EQU (0x0 << 16) ;- (HDMA_CH) 1.
AT91C_HDMA_SCSIZE_4       EQU (0x1 << 16) ;- (HDMA_CH) 4.
AT91C_HDMA_DCSIZE         EQU (0x1 << 20) ;- (HDMA_CH) Destination Chunk Transfer Size
AT91C_HDMA_DCSIZE_1       EQU (0x0 << 20) ;- (HDMA_CH) 1.
AT91C_HDMA_DCSIZE_4       EQU (0x1 << 20) ;- (HDMA_CH) 4.
AT91C_HDMA_SRC_WIDTH      EQU (0x3 << 24) ;- (HDMA_CH) Source Single Transfer Size
AT91C_HDMA_SRC_WIDTH_BYTE EQU (0x0 << 24) ;- (HDMA_CH) BYTE.
AT91C_HDMA_SRC_WIDTH_HALFWORD EQU (0x1 << 24) ;- (HDMA_CH) HALF-WORD.
AT91C_HDMA_SRC_WIDTH_WORD EQU (0x2 << 24) ;- (HDMA_CH) WORD.
AT91C_HDMA_DST_WIDTH      EQU (0x3 << 28) ;- (HDMA_CH) Destination Single Transfer Size
AT91C_HDMA_DST_WIDTH_BYTE EQU (0x0 << 28) ;- (HDMA_CH) BYTE.
AT91C_HDMA_DST_WIDTH_HALFWORD EQU (0x1 << 28) ;- (HDMA_CH) HALF-WORD.
AT91C_HDMA_DST_WIDTH_WORD EQU (0x2 << 28) ;- (HDMA_CH) WORD.
AT91C_HDMA_DONE           EQU (0x1 << 31) ;- (HDMA_CH) 
// - -------- HDMA_CTRLB : (HDMA_CH Offset: 0x10)  -------- 
AT91C_HDMA_SRC_DSCR       EQU (0x1 << 16) ;- (HDMA_CH) Source Buffer Descriptor Fetch operation
AT91C_HDMA_SRC_DSCR_FETCH_FROM_MEM EQU (0x0 << 16) ;- (HDMA_CH) Source address is updated when the descriptor is fetched from the memory.
AT91C_HDMA_SRC_DSCR_FETCH_DISABLE EQU (0x1 << 16) ;- (HDMA_CH) Buffer Descriptor Fetch operation is disabled for the Source.
AT91C_HDMA_DST_DSCR       EQU (0x1 << 20) ;- (HDMA_CH) Destination Buffer Descriptor operation
AT91C_HDMA_DST_DSCR_FETCH_FROM_MEM EQU (0x0 << 20) ;- (HDMA_CH) Destination address is updated when the descriptor is fetched from the memory.
AT91C_HDMA_DST_DSCR_FETCH_DISABLE EQU (0x1 << 20) ;- (HDMA_CH) Buffer Descriptor Fetch operation is disabled for the destination.
AT91C_HDMA_FC             EQU (0x7 << 21) ;- (HDMA_CH) This field defines which devices controls the size of the buffer transfer, also referred as to the Flow Controller.
AT91C_HDMA_FC_MEM2MEM     EQU (0x0 << 21) ;- (HDMA_CH) Memory-to-Memory (DMA Controller).
AT91C_HDMA_FC_MEM2PER     EQU (0x1 << 21) ;- (HDMA_CH) Memory-to-Peripheral (DMA Controller).
AT91C_HDMA_FC_PER2MEM     EQU (0x2 << 21) ;- (HDMA_CH) Peripheral-to-Memory (DMA Controller).
AT91C_HDMA_FC_PER2PER     EQU (0x3 << 21) ;- (HDMA_CH) Peripheral-to-Peripheral (DMA Controller).
AT91C_HDMA_SRC_ADDRESS_MODE EQU (0x3 << 24) ;- (HDMA_CH) Type of addressing mode
AT91C_HDMA_SRC_ADDRESS_MODE_INCR EQU (0x0 << 24) ;- (HDMA_CH) Incrementing Mode.
AT91C_HDMA_SRC_ADDRESS_MODE_DECR EQU (0x1 << 24) ;- (HDMA_CH) Decrementing Mode.
AT91C_HDMA_SRC_ADDRESS_MODE_FIXED EQU (0x2 << 24) ;- (HDMA_CH) Fixed Mode.
AT91C_HDMA_DST_ADDRESS_MODE EQU (0x3 << 28) ;- (HDMA_CH) Type of addressing mode
AT91C_HDMA_DST_ADDRESS_MODE_INCR EQU (0x0 << 28) ;- (HDMA_CH) Incrementing Mode.
AT91C_HDMA_DST_ADDRESS_MODE_DECR EQU (0x1 << 28) ;- (HDMA_CH) Decrementing Mode.
AT91C_HDMA_DST_ADDRESS_MODE_FIXED EQU (0x2 << 28) ;- (HDMA_CH) Fixed Mode.
AT91C_HDMA_IEN            EQU (0x1 << 30) ;- (HDMA_CH) buffer transfer completed
// - -------- HDMA_CFG : (HDMA_CH Offset: 0x14)  -------- 
AT91C_HDMA_SRC_PER        EQU (0xF <<  0) ;- (HDMA_CH) Channel Source Request is associated with peripheral identifier coded SRC_PER handshaking interface.
AT91C_HDMA_SRC_PER_0      EQU (0x0) ;- (HDMA_CH) HW Handshaking Interface number 0.
AT91C_HDMA_SRC_PER_1      EQU (0x1) ;- (HDMA_CH) HW Handshaking Interface number 1.
AT91C_HDMA_SRC_PER_2      EQU (0x2) ;- (HDMA_CH) HW Handshaking Interface number 2.
AT91C_HDMA_SRC_PER_3      EQU (0x3) ;- (HDMA_CH) HW Handshaking Interface number 3.
AT91C_HDMA_SRC_PER_4      EQU (0x4) ;- (HDMA_CH) HW Handshaking Interface number 4.
AT91C_HDMA_SRC_PER_5      EQU (0x5) ;- (HDMA_CH) HW Handshaking Interface number 5.
AT91C_HDMA_SRC_PER_6      EQU (0x6) ;- (HDMA_CH) HW Handshaking Interface number 6.
AT91C_HDMA_SRC_PER_7      EQU (0x7) ;- (HDMA_CH) HW Handshaking Interface number 7.
AT91C_HDMA_DST_PER        EQU (0xF <<  4) ;- (HDMA_CH) Channel Destination Request is associated with peripheral identifier coded DST_PER handshaking interface.
AT91C_HDMA_DST_PER_0      EQU (0x0 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 0.
AT91C_HDMA_DST_PER_1      EQU (0x1 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 1.
AT91C_HDMA_DST_PER_2      EQU (0x2 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 2.
AT91C_HDMA_DST_PER_3      EQU (0x3 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 3.
AT91C_HDMA_DST_PER_4      EQU (0x4 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 4.
AT91C_HDMA_DST_PER_5      EQU (0x5 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 5.
AT91C_HDMA_DST_PER_6      EQU (0x6 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 6.
AT91C_HDMA_DST_PER_7      EQU (0x7 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 7.
AT91C_HDMA_SRC_H2SEL      EQU (0x1 <<  9) ;- (HDMA_CH) Source Handshaking Mode
AT91C_HDMA_SRC_H2SEL_SW   EQU (0x0 <<  9) ;- (HDMA_CH) Software handshaking interface is used to trigger a transfer request.
AT91C_HDMA_SRC_H2SEL_HW   EQU (0x1 <<  9) ;- (HDMA_CH) Hardware handshaking interface is used to trigger a transfer request.
AT91C_HDMA_DST_H2SEL      EQU (0x1 << 13) ;- (HDMA_CH) Destination Handshaking Mode
AT91C_HDMA_DST_H2SEL_SW   EQU (0x0 << 13) ;- (HDMA_CH) Software handshaking interface is used to trigger a transfer request.
AT91C_HDMA_DST_H2SEL_HW   EQU (0x1 << 13) ;- (HDMA_CH) Hardware handshaking interface is used to trigger a transfer request.
AT91C_HDMA_SOD            EQU (0x1 << 16) ;- (HDMA_CH) STOP ON DONE
AT91C_HDMA_SOD_DISABLE    EQU (0x0 << 16) ;- (HDMA_CH) STOP ON DONE disabled, the descriptor fetch operation ignores DONE Field of CTRLA register.
AT91C_HDMA_SOD_ENABLE     EQU (0x1 << 16) ;- (HDMA_CH) STOP ON DONE activated, the DMAC module is automatically disabled if DONE FIELD is set to 1.
AT91C_HDMA_LOCK_IF        EQU (0x1 << 20) ;- (HDMA_CH) Interface Lock
AT91C_HDMA_LOCK_IF_DISABLE EQU (0x0 << 20) ;- (HDMA_CH) Interface Lock capability is disabled.
AT91C_HDMA_LOCK_IF_ENABLE EQU (0x1 << 20) ;- (HDMA_CH) Interface Lock capability is enabled.
AT91C_HDMA_LOCK_B         EQU (0x1 << 21) ;- (HDMA_CH) AHB Bus Lock
AT91C_HDMA_LOCK_B_DISABLE EQU (0x0 << 21) ;- (HDMA_CH) AHB Bus Locking capability is disabled.
AT91C_HDMA_LOCK_B_ENABLE  EQU (0x1 << 21) ;- (HDMA_CH) AHB Bus Locking capability is enabled.
AT91C_HDMA_LOCK_IF_L      EQU (0x1 << 22) ;- (HDMA_CH) Master Interface Arbiter Lock
AT91C_HDMA_LOCK_IF_L_CHUNK EQU (0x0 << 22) ;- (HDMA_CH) The Master Interface Arbiter is locked by the channel x for a chunk transfer.
AT91C_HDMA_LOCK_IF_L_BUFFER EQU (0x1 << 22) ;- (HDMA_CH) The Master Interface Arbiter is locked by the channel x for a buffer transfer.
AT91C_HDMA_AHB_PROT       EQU (0x7 << 24) ;- (HDMA_CH) AHB Prot
AT91C_HDMA_FIFOCFG        EQU (0x3 << 28) ;- (HDMA_CH) FIFO Request Configuration
AT91C_HDMA_FIFOCFG_LARGESTBURST EQU (0x0 << 28) ;- (HDMA_CH) The largest defined length AHB burst is performed on the destination AHB interface.
AT91C_HDMA_FIFOCFG_HALFFIFO EQU (0x1 << 28) ;- (HDMA_CH) When half fifo size is available/filled a source/destination request is serviced.
AT91C_HDMA_FIFOCFG_ENOUGHSPACE EQU (0x2 << 28) ;- (HDMA_CH) When there is enough space/data available to perfom a single AHB access then the request is serviced.

